////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с рабочим календарем.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Позволяет переопределить проверку отсутствия пользователя по записи рабочего календаря.
//
// Параметры:
//	Форма 	- УправляемаяФорма - форма элемента записи рабочего календаря.
//	Отказ	- Булево - признак отказа от записи.
//	ИнформацияОбОтсутствии	 - Структура - со свойствами:
//		* ЕстьПредупреждения - Булево - признак наличия записей об отсутствии.
//		* Отсутствия - Массив - массив ссылок на регистраторы отсутствий.
//	ЕстьОтсутствия - Булево - переопределяемый признак того, что есть отсутствия.
//
Процедура ПриПроверкеОтсутствияПоЗаписиРабочегоКалендаря(Форма, Отказ, ИнформацияОбОтсутствии, ЕстьОтсутствия) Экспорт
	
	РаботаСРабочимКалендаремБЗККлиент.ПриПроверкеОтсутствияПоЗаписиРабочегоКалендаря(Форма, Отказ, ИнформацияОбОтсутствии, ЕстьОтсутствия);
	
КонецПроцедуры

// Позволяет переопределить показ предупреждения об отсутствии для записи рабочего календаря.
// Описание см. РаботаСРабочимКалендаремКлиент.ПоказатьПредупреждениеОбОтсутствииПоЗаписиРабочегоКалендаря.
//
Процедура ПриПоказеПредупрежденияОбОтсутствииПоЗаписиРабочегоКалендаря(
	ИнформацияОбОтсутствии, Оповещение, Владелец) Экспорт
	
	РаботаСРабочимКалендаремБЗККлиент.ПриПоказеПредупрежденияОбОтсутствииПоЗаписиРабочегоКалендаря(
		ИнформацияОбОтсутствии, Оповещение, Владелец);
	
КонецПроцедуры

// Позволяет переопределить действия при начале выбора пользователя записи рабочего календаря.
// Описание см. РаботаСРабочимКалендаремКлиент.ВыбратьПользователяЗаписиРабочегоКалендаря.
//
Процедура ПриВыбореПользователяЗаписиРабочегоКалендаря(Элемент, Пользователь, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Позволяет открыть нужную форму для выбора пользователей, чья занятость будет отражена в календаре.
//
// Параметры:
//	Форма - УправляемаяФорма - форма календаря.
//	Оповещение - ОписаниеОповещения - описание процедуры, которая будет вызвана после выбора пользователей.
//
Процедура ПриНачалеВыбораПользователейДляКалендаря(Форма, Знач Оповещение) Экспорт
	
	РаботаСРабочимКалендаремБЗККлиент.ПриНачалеВыбораПользователейДляКалендаря(Форма, Оповещение);
	
КонецПроцедуры

// Позволяет переопределить действия после выбора пользователей для календаря.
//
// Параметры:
//	Форма - УправляемаяФорма - форма календаря.
//	ВыбранныеПользователи - ТаблицаЗначений - результат, полученный после закрытия формы выбора пользователей.
//
Процедура ПриОкончанииВыбораПользователейДляКалендаря(Форма, Знач ВыбранныеПользователи) Экспорт
	
	РаботаСРабочимКалендаремБЗККлиент.ПриОкончанииВыбораПользователейДляКалендаря(Форма, ВыбранныеПользователи);
	
КонецПроцедуры

// Позволяет уточнить действие при выборе записи календаря для открытия в отдельной форме.
// Описание см. РаботаСРабочимКалендаремКлиент.ПоказатьЗаписьКалендаря.
//
Процедура ПриПоказеЗаписиРабочегоКалендаря(ЗаписьКалендаря, ПользовательКалендаря, ПредметЗаписи) Экспорт
	
	РаботаСРабочимКалендаремБЗККлиент.ПриПоказеЗаписиРабочегоКалендаря(ЗаписьКалендаря, ПользовательКалендаря, ПредметЗаписи);
	
КонецПроцедуры

#КонецОбласти