#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЭффективностьИсточников");
	НастройкиВарианта.Описание = НСтр("ru = 'Сводные показатели эффективности источников информации о кандидатах'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЭффективностьДляРазличныхВакансий");
	НастройкиВарианта.Описание = НСтр("ru = 'Сравнение источников информации о кандидатах для подбора на разные вакансии'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЭффективностьКандидатов");
	НастройкиВарианта.Описание = НСтр("ru = 'Сравнивает кандидатов, поступивших из разных источников'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЭффективностьКачестваКандидатов");
	НастройкиВарианта.Описание = НСтр("ru = 'Сравнивает кандидатов, поступивших из разных источников по этапам отбора, до которых они дошли'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Диаграммы");
	НастройкиВарианта.Описание = НСтр("ru = 'Показатели эффективности источников информации о кандидатах графически'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли