#Область ПрограммныйИнтерфейс

// Открывает форму электронного курса для изучения.
// 
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - 
//              Задает ссылку на событие, в рамках которого пользователь изучает курс.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - 
//              Задает ссылку на учащегося.
//   ВладелецФормы - УправляемаяФорма - необязательный, форма-источник команды. 
//                   Владелец формы будет возвращен в обработку оповещения.
//                   см. ИзучениеЭлектронныхКурсовПереопределяемый.ПриСозданииФормыЭлектронногоКурса.
//
Процедура ИзучитьЭлектронныйКурс(ЭлектронныйКурс, Контекст = Неопределено, Учащийся = Неопределено, ВладелецФормы = Неопределено) Экспорт
	
	ИзучениеЭлектронныхКурсовСлужебныйКлиент.ОткрытьЭлектронныйКурс(ЭлектронныйКурс, Контекст, Учащийся, ВладелецФормы);
	
КонецПроцедуры

#КонецОбласти