
#Область СлужебныеПроцедурыИФункции

Процедура ПанельУправлениеПерсоналомИспользоватьГрейдыПриИзменении(Форма) Экспорт
	
	Форма.НастройкиГрейдовПрежняя.ИспользоватьГрейды = Форма.НастройкиГрейдов.ИспользоватьГрейды;
	
	Если Не Форма.НастройкиГрейдов.ИспользоватьГрейды Тогда
		
		Форма.НастройкиГрейдов.ИспользоватьИндивидуальныеГрейды = ?(Форма.ИндивидуальныеГрейдыЧисло = 1, Истина, Ложь);
		ЗаполнитьЗначенияСвойств(Форма.НастройкиГрейдовПрежняя, Форма.НастройкиГрейдов);
		
		Форма.НастройкиГрейдов.ИспользоватьИндивидуальныеГрейды = Ложь;
		Форма.НастройкиГрейдов.ИспользоватьСозданиеГрейдов = Ложь;
		Форма.ИндивидуальныеГрейдыЧисло = ?(Форма.НастройкиГрейдов.ИспользоватьИндивидуальныеГрейды, 1, 0);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(Форма.НастройкиГрейдов, Форма.НастройкиГрейдовПрежняя);
		Форма.ИндивидуальныеГрейдыЧисло = ?(Форма.НастройкиГрейдов.ИспользоватьИндивидуальныеГрейды, 1, 0);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПанельУправлениеПерсоналомПоНастройкеИспользоватьГрейды(Форма) Экспорт 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ИндивидуальныеГрейдыГруппа", "Доступность", Форма.НастройкиГрейдов.ИспользоватьГрейды);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "СозданиеГрейдовГруппа", "Доступность", Форма.НастройкиГрейдов.ИспользоватьГрейды);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ОбщаяКомандаСозданиеГрейдов", "Доступность",
		Форма.НастройкиГрейдов.ИспользоватьГрейды И Форма.НастройкиГрейдов.ИспользоватьСозданиеГрейдов);
	
КонецПроцедуры

#КонецОбласти
