#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура УстановитьИспользоватьПлановыеПрочиеДоходы(Параметры = Неопределено) Экспорт
	
	ИспользоватьПлановыеПрочиеДоходы = ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") 
		И ПолучитьФункциональнуюОпцию("ИспользоватьРегистрациюПрочихДоходов");
		
	НаборЗаписей = РегистрыСведений.НастройкиПлановыхПрочихДоходов.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Запись = ?(НаборЗаписей.Количество() = 0, НаборЗаписей.Добавить(), НаборЗаписей[0]);
	Запись.ИспользоватьПлановыеПрочиеДоходы = ИспользоватьПлановыеПрочиеДоходы;

	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли