#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивВакансий = ЭтотОбъект.Выгрузить().ВыгрузитьКолонку("Вакансия");
	СоответствиеПозиций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивВакансий, "Позиция");
	МассивПозиций = Новый Массив;
	Для Каждого ЭлементСоответствия Из СоответствиеПозиций Цикл
		Если МассивПозиций.Найти(ЭлементСоответствия.Значение) = Неопределено Тогда
			МассивПозиций.Добавить(ЭлементСоответствия.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОбменДаннымиЗарплатаКадрыРасширенный.ОграниченияРегистрацииПоПозициямШтатногоРасписания(ЭтотОбъект, МассивПозиций);
	
КонецФункции

#КонецОбласти 

#КонецЕсли
