
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "СотрудникСсылка");
	
	СотрудникиФормы.ПрочитатьДанныеИзХранилищаВФорму(
		ЭтаФорма,
		СотрудникиКлиентСервер.ОписаниеДополнительнойФормы(ИмяФормы),
		Параметры.АдресВХранилище);
	
	ПроинициализироватьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ИнструктажПоОхранеТруда" И Параметр.Свойство("ВладелецФормы") И Параметр.ВладелецФормы = ЭтаФорма Тогда
		ПроинициализироватьФорму();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнструктажиПоОхранеТруда

&НаКлиенте
Процедура ИнструктажиПоОхранеТрудаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ИнструктажиПоОхранеТрудаДействие" Тогда
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Организация", Организация);
		ЗначенияЗаполнения.Вставить("ВидИнструктажа", ТекущиеДанные.Инструктаж);
		ЗначенияЗаполнения.Вставить("ДатаПроведения", ОбщегоНазначенияКлиент.ДатаСеанса());
		ЗначенияЗаполнения.Вставить("СписокСотрудников", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СотрудникСсылка));
		
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		
		ОткрытьФорму("Документ.ИнструктажПоОхранеТруда.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРезультатыСпециальнойОценкиУсловийТруда

&НаКлиенте
Процедура РезультатыСпециальнойОценкиУсловийТрудаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "РезультатыСпециальнойОценкиУсловийТрудаСрокДействия" И ЗначениеЗаполнено(ТекущиеДанные.РегистраторСрокДействия) Тогда
		ПоказатьЗначение(,ТекущиеДанные.РегистраторСрокДействия);
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.Регистратор) Тогда
		ПоказатьЗначение(,ТекущиеДанные.Регистратор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроинициализироватьФорму()
	
	ЭтаФорма.Заголовок = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СотрудникСсылка, "Наименование");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Сотрудник", СотрудникСсылка);
	Запрос.УстановитьПараметр("ДатаАктуальности", ТекущаяДатаСеанса());
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	&Сотрудник КАК Сотрудник,
	|	&ДатаАктуальности КАК Период
	|ПОМЕСТИТЬ ВТСотрудники";
	
	Запрос.Выполнить();
	
	ОписательВТКадровыеДанные = КадровыйУчет.ОписательВременныхТаблицДляСоздатьВТКадровыеДанныеСотрудников(Запрос.МенеджерВременныхТаблиц, "ВТСотрудники");
	
	КадровыйУчет.СоздатьВТКадровыеДанныеСотрудников(ОписательВТКадровыеДанные, Истина, "Организация, ДолжностьПоШтатномуРасписанию");
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию,
	|	КадровыеДанныеСотрудников.Организация
	|ИЗ
	|	ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Организация = Выборка.Организация;
		РабочееМесто = Выборка.ДолжностьПоШтатномуРасписанию;
	КонецЦикла;
	
	//Спецоценка
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто,
	|	РезультатыСпециальнойОценкиУсловийТруда.КлассУсловийТруда,
	|	РезультатыСпециальнойОценкиУсловийТруда.Период КАК ДатаПроведения,
	|	РезультатыСпециальнойОценкиУсловийТруда.Регистратор КАК Регистратор,
	|	ПлановыеДатыСпециальнойОценкиУсловийТруда.ДатаБлижайшейОценки КАК СрокДействия,
	|	ПлановыеДатыСпециальнойОценкиУсловийТруда.Регистратор КАК РегистраторСрокДействия
	|ИЗ
	|	РегистрСведений.РезультатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаАктуальности, РабочееМесто = &РабочееМесто) КАК РезультатыСпециальнойОценкиУсловийТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеДатыСпециальнойОценкиУсловийТруда.СрезПоследних(&ДатаАктуальности, РабочееМесто = &РабочееМесто) КАК ПлановыеДатыСпециальнойОценкиУсловийТруда
	|		ПО РезультатыСпециальнойОценкиУсловийТруда.РабочееМесто = ПлановыеДатыСпециальнойОценкиУсловийТруда.РабочееМесто";
	
	РезультатыСпециальнойОценкиУсловийТруда.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = РезультатыСпециальнойОценкиУсловийТруда.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
	// Инструктажи
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыИнструктажейПоОхранеТруда.Ссылка КАК Инструктаж,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА НЕ ВидыИнструктажейПоОхранеТруда.КонтролироватьПроведениеИнструктажа
	|				ТОГДА ИСТИНА
	|			КОГДА ВидыИнструктажейПоОхранеТруда.ИспользоватьДляВсехРабочихМест
	|					ИЛИ ВидыИнструктажейПоОхранеТрудаРабочиеМеста.РабочееМесто = КадровыеДанныеСотрудников.ДолжностьПоШтатномуРасписанию
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Используется
	|ПОМЕСТИТЬ ВТВсеИнструктажи
	|ИЗ
	|	Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда.РабочиеМеста КАК ВидыИнструктажейПоОхранеТрудаРабочиеМеста
	|		ПО ВидыИнструктажейПоОхранеТруда.Ссылка = ВидыИнструктажейПоОхранеТрудаРабочиеМеста.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеДанныеСотрудников КАК КадровыеДанныеСотрудников
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыИнструктажейПоОхранеТруда.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВсеИнструктажи.Инструктаж КАК Инструктаж,
	|	ИнструктажиПоОхранеТруда.Период КАК ДатаПолучения,
	|	ИнструктажиПоОхранеТруда.Регистратор КАК Регистратор,
	|	ИнструктажиПоОхранеТруда.СрокДействия КАК СрокДействия,
	|	ВЫБОР
	|		КОГДА ИнструктажиПоОхранеТруда.ВидИнструктажа = ЗНАЧЕНИЕ(Справочник.ВидыИнструктажейПоОхранеТруда.Вводный)
	|			ТОГДА """"
	|		КОГДА ИнструктажиПоОхранеТруда.ВидИнструктажа ЕСТЬ NULL 
	|			ТОГДА ""Оформить""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ВидыИнструктажейПоОхранеТруда.ПроводитсяПовторно
	|					ТОГДА ""Продлить""
	|				ИНАЧЕ ""Оформить""
	|			КОНЕЦ
	|	КОНЕЦ КАК Действие
	|ИЗ
	|	ВТВсеИнструктажи КАК ВсеИнструктажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыИнструктажейПоОхранеТруда КАК ВидыИнструктажейПоОхранеТруда
	|		ПО ВсеИнструктажи.Инструктаж = ВидыИнструктажейПоОхранеТруда.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИнструктажиПоОхранеТруда.СрезПоследних(&ДатаАктуальности, Сотрудник = &Сотрудник) КАК ИнструктажиПоОхранеТруда
	|		ПО ВсеИнструктажи.Инструктаж = ИнструктажиПоОхранеТруда.ВидИнструктажа
	|ГДЕ
	|	ВсеИнструктажи.Используется";
	
	ИнструктажиПоОхранеТруда.Очистить();
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ИнструктажиПоОхранеТруда.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
