////////////////////////////////////////////////////////////////////////////////
// Подсистема "Перенос данных из E-Staff Рекрутер".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Функция ФайловОбъектовНет(КаталогПоиска, КлючОбъекта) Экспорт
	
	ФайлыДанных = Новый Массив;
	
	Если КлючОбъекта = ПереносДанныхEStaffКлиентСервер.КлючСтраны() Тогда
		Описание = ПереносДанныхEStaffКлиентСервер.ОписаниеСтраныМира();
	ИначеЕсли КлючОбъекта = ПереносДанныхEStaffКлиентСервер.КлючФизическогоЛица() Тогда
		Описание = ПереносДанныхEStaffКлиентСервер.ОписаниеФизическогоЛица();
	ИначеЕсли КлючОбъекта = ПереносДанныхEStaffКлиентСервер.КлючКандидата() Тогда
		Описание = ПереносДанныхEStaffКлиентСервер.ОписаниеКандидата();
	ИначеЕсли КлючОбъекта = ПереносДанныхEStaffКлиентСервер.КлючВакансии() Тогда
		Описание = ПереносДанныхEStaffКлиентСервер.ОписаниеВакансии();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Описание) Тогда
		ФайлыДанных = ФайлыПоОписаниюОбъекта(Описание, КаталогПоиска);
	КонецЕсли;
	
	Возврат ФайлыДанных.Количество() = 0;
	
КонецФункции

Функция ФайлыПоОписаниюОбъекта(ОписаниеОбъекта, КаталогПоиска, ИскатьВПодкаталогах = Истина) Экспорт
	
	Если ОписаниеОбъекта.ВОдномФайле Тогда
		Маска = СтрШаблон("%1.XML", ОписаниеОбъекта.Ключ);
	Иначе
		Маска = СтрШаблон("%1-0x????????????????.XML", ОписаниеОбъекта.Ключ);
	КонецЕсли;
	
	Возврат НайтиФайлы(КаталогПоиска, Маска, ИскатьВПодкаталогах);
	
КонецФункции

#КонецОбласти