
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("СписокНомеров") Тогда
		СписокНомеров = Параметры.СписокНомеров;
		
		Если ЗначениеЗаполнено(СписокНомеров) Тогда
			Для Каждого Номер Из СписокНомеров Цикл
				
				НовыйТелефон = НомераТелефонов.Добавить();
				ЗаполнитьЗначенияСвойств(НовыйТелефон, Номер.Значение);
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)

	СписокНомеров = Новый СписокЗначений;
	
	Для Каждого СтрокаНомерТелефона Из НомераТелефонов Цикл
		
		СтруктураНомераТелефона = Новый Структура("КодСтраны, КодГорода, НомерТелефона, Комментарий");
		ЗаполнитьЗначенияСвойств(СтруктураНомераТелефона, СтрокаНомерТелефона);
		
		СписокНомеров.Добавить(СтруктураНомераТелефона);
		
	КонецЦикла;
	
	Закрыть(СписокНомеров);
	
КонецПроцедуры

#КонецОбласти
