#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс		

Функция ТаблицаИзмеренийПланаПодразделений() Экспорт

	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("ПериодДействия", Новый ОписаниеТипов("Дата"));
	Таблица.Колонки.Добавить("Подразделение", Новый ОписаниеТипов("СправочникСсылка.СтруктураПредприятия"));
	Таблица.Колонки.Добавить("Показатель", Новый ОписаниеТипов("СправочникСсылка.СтруктураЦелей"));
	
	Возврат Таблица;

КонецФункции
 
#КонецОбласти

#КонецЕсли
