
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Пострадавший = Параметры.Пострадавший;
	Организация = Параметры.Организация;
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Больничные листы: %1'"),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пострадавший, "Наименование"));
	
	БольничныеЛисты.Очистить();
	Для каждого БольничныйЛист Из Параметры.БольничныеЛисты Цикл
		НоваяСтрока = БольничныеЛисты.Добавить();
		НоваяСтрока.БольничныйЛист = БольничныйЛист;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)

	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("Пострадавший", Пострадавший);
	
	МассивБольничныхЛистов = Новый Массив;
	Для каждого СтрокаТаблицы Из БольничныеЛисты Цикл
		МассивБольничныхЛистов.Добавить(СтрокаТаблицы.БольничныйЛист);
	КонецЦикла;
	
	ПараметрыЗакрытия.Вставить("БольничныеЛисты", МассивБольничныхЛистов);
	
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

#КонецОбласти
