#Область СлужебныйПрограммныйИнтерфейс

#Область Печать

// См. УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Документы.ЗапросСправкиСотрудником);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаЕдиновременнуюКомпенсацию);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаКомандировку);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаОтпуск);
	СписокОбъектов.Добавить(Документы.ОтменаЗаявкиНаЕдиновременнуюКомпенсацию);
	СписокОбъектов.Добавить(Документы.ОтменаЗаявкиНаКомандировку);
	СписокОбъектов.Добавить(Документы.ОтменаЗаявкиНаОтпуск);
	СписокОбъектов.Добавить(Документы.СообщениеОбОтсутствии);
	СписокОбъектов.Добавить(Документы.СообщениеОНеправильныхДанныхСотрудника);
	
КонецПроцедуры

#КонецОбласти

#Область ОчередьЗаданий

// См. ОчередьЗаданийПереопределяемый.ПриПолученииСпискаШаблонов.
//
Процедура ПриПолученииСпискаШаблоновОчередиЗаданий(Шаблоны) Экспорт
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.ЗапретНаВходВПрограммуУволеннымРаботникам.Имя);
	Шаблоны.Добавить(Метаданные.РегламентныеЗадания.СозданиеПользователейФизическихЛиц.Имя);
КонецПроцедуры

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.ЗапретНаВходВПрограммуУволеннымРаботникам.ИмяМетода);
	СоответствиеИменПсевдонимам.Вставить(Метаданные.РегламентныеЗадания.СозданиеПользователейФизическихЛиц.ИмяМетода);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФизическоеЛицоПользователя(Пользователь = Неопределено) Экспорт 
	
	Если Пользователь = Неопределено Тогда 
		Пользователь = Пользователи.ТекущийПользователь()
	КонецЕсли;
	
	ФизическоеЛицо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Пользователь, "ФизическоеЛицо");
	
	Возврат ФизическоеЛицо;
	
КонецФункции

Функция ПользователиФизическихЛиц(СписокФизическихЛиц) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокФизическихЛиц", СписокФизическихЛиц);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	Пользователи.Недействителен КАК Недействителен,
	               |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ,
	               |	Пользователи.ИдентификаторПользователяСервиса КАК ИдентификаторПользователяСервиса
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ФизическоеЛицо В(&СписокФизическихЛиц)
	               |ИТОГИ ПО
	               |	ФизическоеЛицо";
				   
	ВыборкаПоФизическимЛицам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПользователиФизическихЛиц = Новый Соответствие;
	
	Пока ВыборкаПоФизическимЛицам.Следующий() Цикл 
		СписокПользователей = Новый Массив;
		Выборка = ВыборкаПоФизическимЛицам.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОписаниеПользователя = СамообслуживаниеСотрудниковКлиентСервер.ОписаниеПользователя();
			ЗаполнитьЗначенияСвойств(ОписаниеПользователя, Выборка);
			СписокПользователей.Добавить(ОписаниеПользователя);
		КонецЦикла;
		ПользователиФизическихЛиц.Вставить(ВыборкаПоФизическимЛицам.ФизическоеЛицо, СписокПользователей);
	КонецЦикла;
	
	Возврат ПользователиФизическихЛиц;
	
КонецФункции

Функция ГруппыДоступаПользователей(СписокПользователей) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокПользователей", СписокПользователей);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступаПользователи.Пользователь КАК Пользователь,
	               |	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |ГДЕ
	               |	ГруппыДоступаПользователи.Пользователь В(&СписокПользователей)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Пользователь";
				   
	ГруппыДоступа = Новый Соответствие;			   
				   
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Пользователь") Цикл 
		МассивГруппДоступа = Новый Массив;
		ГруппыДоступа.Вставить(Выборка.Пользователь, МассивГруппДоступа);
		Пока Выборка.Следующий() Цикл 
			МассивГруппДоступа.Добавить(Выборка.ГруппаДоступа);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ГруппыДоступа;
	
КонецФункции

Процедура ЗаполнитьПоставляемыеПрофилиГруппДоступаПодсистемыСамообслуживание(ОписанияПрофилей, ПараметрыОбновления) Экспорт 

	ОписаниеПрофиля = ОписаниеПрофиляСотрудник();
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Функция ОписаниеПрофиляСотрудник()

	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Идентификатор = ИдентификаторПрофиляСотрудник();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Сотрудник'");
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляОбязательныеРоли(ОписаниеПрофиля);
	
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЗапросовСправокСотрудником");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЗаявокНаЕдиновременнуюКомпенсацию");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЗаявокНаКомандировку");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеЗаявокНаОтпуск");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСообщенийОбОтсутствии");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеСообщенийОНеправильныхДанныхСотрудника");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ДобавлениеИзменениеОткликовНаОткрытыеПубликации");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ПодсистемаСамообслуживание");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИспользованиеСамообслуживаниеСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИнтерфейсРабочегоСтолаСотрудник");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВидовЗаявокНаЕдиновременнуюКомпенсациюСотрудникам");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеВидовПредоставляемыхСотрудникамСправок");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадры");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеДанныхФизическихЛицЗарплатаКадрыРасширенная");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЖурналаЗаявокСотрудников");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЗаявокНаЕдиновременнуюКомпенсацию");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЗаявокНаКомандировку");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеЗаявокНаОтпуск");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСообщенийОбОтсутствии");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ЧтениеСообщенийОНеправильныхДанныхСотрудника");
	// Электронное обучение.
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "БазовыеПраваЭлектронногоОбучения", "ЗарплатаКадрыКорпоративнаяПодсистемы.ЭлектронноеОбучение");
	ЗарплатаКадрыРасширенный.ДобавитьВОписаниеПрофиляРоль(ОписаниеПрофиля, "ИзучениеЭлектронныхКурсов");	
	
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ПодразделенияОрганизаций");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ГруппыФизическихЛиц");
	ОписаниеПрофиля.ВидыДоступа.Добавить("СтруктураПредприятия");
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ИдентификаторПрофиляСотрудник()
	
	Возврат "cb5c7284-4955-11e4-ac39-c86000df10c6";
	
КонецФункции

Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("ВремяЗавершенияРаботыПользователя", "СамообслуживаниеСотрудников.УстановитьПараметрыСеанса");
	
КонецПроцедуры

Процедура УстановитьПараметрыСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	Если ИмяПараметра = "ВремяЗавершенияРаботыПользователя" Тогда
		
		УстановитьПараметрСеансаВремяЗавершенияРаботыПользователя();
		Если УстановленныеПараметры <> Неопределено Тогда
			УстановленныеПараметры.Добавить("ВремяЗавершенияРаботыПользователя");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьПараметрСеансаВремяЗавершенияРаботыПользователя()
	
	ПараметрыСеанса.ВремяЗавершенияРаботыПользователя = Дата(1, 1, 1);
	
	Если Не ПолучитьФункциональнуюОпцию("ОграничиватьПродолжительностьСеансаПользователей") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Пользователи.ЭтоПолноправныйПользователь(, , Ложь) Тогда 
		Возврат;
	КонецЕсли;
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
		|ПОМЕСТИТЬ ВТГруппыДоступаПользователя
		|ИЗ
		|	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|ГДЕ
		|	ГруппыДоступаПользователи.Пользователь = &Пользователь
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступаПользователя.ГруппаДоступа КАК ГруппаДоступа
		|ИЗ
		|	ВТГруппыДоступаПользователя КАК ГруппыДоступаПользователя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыДоступаБезОграниченияПродолжительностиСеанса КАК ГруппыДоступаБезОграниченияПродолжительностиСеанса
		|		ПО ГруппыДоступаПользователя.ГруппаДоступа = ГруппыДоступаБезОграниченияПродолжительностиСеанса.ГруппаДоступа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступаПользователя.ГруппаДоступа КАК ГруппаДоступа,
		|	МАКСИМУМ(ПродолжительностьСеансаГруппДоступа.ПродолжительностьСеанса) КАК ПродолжительностьСеанса
		|ИЗ
		|	ВТГруппыДоступаПользователя КАК ГруппыДоступаПользователя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПродолжительностьСеансаГруппДоступа КАК ПродолжительностьСеансаГруппДоступа
		|		ПО ГруппыДоступаПользователя.ГруппаДоступа = ПродолжительностьСеансаГруппДоступа.ГруппаДоступа
		|
		|СГРУППИРОВАТЬ ПО
		|	ГруппыДоступаПользователя.ГруппаДоступа";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если Не РезультатыЗапроса[1].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Если РезультатыЗапроса[2].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатыЗапроса[2].Выбрать();
	Если Выборка.Следующий() Тогда 
		ПараметрыСеанса.ВремяЗавершенияРаботыПользователя = ТекущаяДатаСеанса() + Выборка.ПродолжительностьСеанса * 60;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриОпределенииПараметровБлокировкиСеансов(ПараметрыБлокировки) Экспорт 
	
	Если Не ПолучитьФункциональнуюОпцию("ОграничиватьПродолжительностьСеансаПользователей") Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПараметрыСеанса.ВремяЗавершенияРаботыПользователя) Тогда 
		
		НачалоБлокировки = ПараметрыБлокировки.Начало;
		
		Если Не ЗначениеЗаполнено(НачалоБлокировки) Или НачалоБлокировки > ПараметрыСеанса.ВремяЗавершенияРаботыПользователя Тогда
			
			ПараметрыБлокировки.Начало = ПараметрыСеанса.ВремяЗавершенияРаботыПользователя;
			ПараметрыБлокировки.Установлена = Истина;
			ПараметрыБлокировки.ПерезапуститьПриЗавершении = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт 
	
	Параметры.Вставить("ПревышеноМаксимальноеКоличествоСоединений", Ложь);
	
	Если Не ПолучитьФункциональнуюОпцию("ОграничиватьКоличествоОдновременныхСеансовПользователей") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Пользователи.ЭтоПолноправныйПользователь(, , Ложь) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Пользователь = Пользователи.АвторизованныйПользователь();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
	               |ПОМЕСТИТЬ ВТГруппыДоступаПользователя
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |ГДЕ
	               |	ГруппыДоступаПользователи.Пользователь = &Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыДоступаПользователя.ГруппаДоступа
	               |ИЗ
	               |	ВТГруппыДоступаПользователя КАК ГруппыДоступаПользователя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыДоступаБезОграниченийНаКоличествоСеансов КАК ГруппыДоступаБезОграниченийНаКоличествоСеансов
	               |		ПО ГруппыДоступаПользователя.ГруппаДоступа = ГруппыДоступаБезОграниченийНаКоличествоСеансов.ГруппаДоступа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыДоступаПользователя.ГруппаДоступа
	               |ИЗ
	               |	ВТГруппыДоступаПользователя КАК ГруппыДоступаПользователя
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоОдновременныхСеансовГруппДоступа КАК КоличествоОдновременныхСеансовГруппДоступа
	               |		ПО ГруппыДоступаПользователя.ГруппаДоступа = КоличествоОдновременныхСеансовГруппДоступа.ГруппаДоступа";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Пользователь входит в группу доступа, которая не подпадает под ограничение на количество сеансов.
	Если Не РезультатыЗапроса[1].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	// Ни для одной из групп доступа, в которые входит пользователь, ограничение не установлено.
	Если РезультатыЗапроса[2].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ГруппыДоступаПользователя = Новый Массив;
	
	Выборка = РезультатыЗапроса[2].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ГруппыДоступаПользователя.Добавить(Выборка.ГруппаДоступа);
	КонецЦикла;
	
	СеансыИБ = ПолучитьСеансыИнформационнойБазы();
	
	ИдентификаторыПользователейИБ = Новый Массив;
	КоличествоТекущихСеансов = Новый Соответствие;
	
	Для Каждого СеансИБ Из СеансыИБ Цикл
		
		Если СеансИБ.ИмяПриложения = "SrvrConsole" Или СеансИБ.ИмяПриложения = "BackgroundJob" Тогда
			Продолжить;
		КонецЕсли;
		
		Если СеансИБ.Пользователь <> Неопределено Тогда
			КоличествоАктивныхСеансов = КоличествоТекущихСеансов[СеансИБ.Пользователь.УникальныйИдентификатор];
			Если КоличествоАктивныхСеансов = Неопределено Тогда 
				ИдентификаторыПользователейИБ.Добавить(СеансИБ.Пользователь.УникальныйИдентификатор);
				КоличествоТекущихСеансов.Вставить(СеансИБ.Пользователь.УникальныйИдентификатор, 1);
			Иначе 
				КоличествоТекущихСеансов[СеансИБ.Пользователь.УникальныйИдентификатор] = КоличествоАктивныхСеансов + 1;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ИдентификаторыПользователейИБ", ИдентификаторыПользователейИБ);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Пользователи.Ссылка КАК Пользователь,
	               |	Пользователи.ИдентификаторПользователяИБ КАК ИдентификаторПользователяИБ
	               |ИЗ
	               |	Справочник.Пользователи КАК Пользователи
	               |ГДЕ
	               |	Пользователи.ИдентификаторПользователяИБ В(&ИдентификаторыПользователейИБ)";
				   
	АктивныеСеансыПользователей = Новый ТаблицаЗначений;
	АктивныеСеансыПользователей.Колонки.Добавить("Пользователь", Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	АктивныеСеансыПользователей.Колонки.Добавить("КоличествоАктивныхСеансов", Новый ОписаниеТипов("Число"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = АктивныеСеансыПользователей.Добавить();
		НоваяСтрока.Пользователь = Выборка.Пользователь;
		НоваяСтрока.КоличествоАктивныхСеансов = КоличествоТекущихСеансов[Выборка.ИдентификаторПользователяИБ];
	КонецЦикла;
	
	Запрос.УстановитьПараметр("АктивныеСеансыПользователей", АктивныеСеансыПользователей);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	АктивныеСеансыПользователей.Пользователь КАК Пользователь,
	               |	АктивныеСеансыПользователей.КоличествоАктивныхСеансов КАК КоличествоАктивныхСеансов
	               |ПОМЕСТИТЬ ВТПользователи
	               |ИЗ
	               |	&АктивныеСеансыПользователей КАК АктивныеСеансыПользователей
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыДоступаПользователи.Пользователь КАК Пользователь,
	               |	ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
	               |ПОМЕСТИТЬ ВТГруппыДоступаПользователей
	               |ИЗ
	               |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПользователи КАК Пользователи
	               |		ПО ГруппыДоступаПользователи.Пользователь = Пользователи.Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ГруппыДоступаПользователей.Пользователь
	               |ПОМЕСТИТЬ ВТПользователиВнеЛимита
	               |ИЗ
	               |	ВТГруппыДоступаПользователей КАК ГруппыДоступаПользователей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыДоступаБезОграниченийНаКоличествоСеансов КАК ГруппыДоступаБезОграниченийНаКоличествоСеансов
	               |		ПО ГруппыДоступаПользователей.ГруппаДоступа = ГруппыДоступаБезОграниченийНаКоличествоСеансов.ГруппаДоступа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ГруппыДоступаПользователей.Пользователь КАК Пользователь,
	               |	ГруппыДоступаПользователей.ГруппаДоступа КАК ГруппаДоступа
	               |ПОМЕСТИТЬ ВТОграничениеКоличестваСеансов
	               |ИЗ
	               |	ВТГруппыДоступаПользователей КАК ГруппыДоступаПользователей
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КоличествоОдновременныхСеансовГруппДоступа КАК КоличествоОдновременныхСеансовГруппДоступа
	               |		ПО ГруппыДоступаПользователей.ГруппаДоступа = КоличествоОдновременныхСеансовГруппДоступа.ГруппаДоступа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТПользователиВнеЛимита КАК ПользователиВнеЛимита
	               |		ПО ГруппыДоступаПользователей.Пользователь = ПользователиВнеЛимита.Пользователь
	               |ГДЕ
	               |	ПользователиВнеЛимита.Пользователь ЕСТЬ NULL 
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОграничениеКоличестваСеансов.Пользователь КАК Пользователь,
	               |	КОЛИЧЕСТВО(ОграничениеКоличестваСеансов.ГруппаДоступа) КАК КоличествоГруппДоступа
	               |ПОМЕСТИТЬ ВТКоличествоГруппДоступаПользователей
	               |ИЗ
	               |	ВТОграничениеКоличестваСеансов КАК ОграничениеКоличестваСеансов
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОграничениеКоличестваСеансов.Пользователь
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОграничениеКоличестваСеансов.ГруппаДоступа КАК ГруппаДоступа,
	               |	СУММА(Пользователи.КоличествоАктивныхСеансов) КАК КоличествоПользователей
	               |ПОМЕСТИТЬ ВТИспользованныеСеансыГруппДоступа
	               |ИЗ
	               |	ВТОграничениеКоличестваСеансов КАК ОграничениеКоличестваСеансов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоГруппДоступаПользователей КАК КоличествоГруппДоступаПользователей
	               |		ПО ОграничениеКоличестваСеансов.Пользователь = КоличествоГруппДоступаПользователей.Пользователь
	               |			И (КоличествоГруппДоступаПользователей.КоличествоГруппДоступа = 1)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПользователи КАК Пользователи
	               |		ПО ОграничениеКоличестваСеансов.Пользователь = Пользователи.Пользователь
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОграничениеКоличестваСеансов.ГруппаДоступа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КоличествоОдновременныхСеансовГруппДоступа.ГруппаДоступа,
	               |	КоличествоОдновременныхСеансовГруппДоступа.КоличествоСеансов - ЕСТЬNULL(ИспользованныеСеансыГруппДоступа.КоличествоПользователей, 0) КАК КоличествоДоступныхСеансов
	               |ИЗ
	               |	РегистрСведений.КоличествоОдновременныхСеансовГруппДоступа КАК КоличествоОдновременныхСеансовГруппДоступа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТИспользованныеСеансыГруппДоступа КАК ИспользованныеСеансыГруппДоступа
	               |		ПО КоличествоОдновременныхСеансовГруппДоступа.ГруппаДоступа = ИспользованныеСеансыГруппДоступа.ГруппаДоступа
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОграничениеКоличестваСеансов.Пользователь КАК Пользователь,
	               |	ОграничениеКоличестваСеансов.ГруппаДоступа КАК ГруппаДоступа,
	               |	Пользователи.КоличествоАктивныхСеансов КАК КоличествоАктивныхСеансов,
	               |	КоличествоГруппДоступаПользователей.КоличествоГруппДоступа КАК КоличествоГруппДоступа
	               |ИЗ
	               |	ВТОграничениеКоличестваСеансов КАК ОграничениеКоличестваСеансов
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТКоличествоГруппДоступаПользователей КАК КоличествоГруппДоступаПользователей
	               |		ПО ОграничениеКоличестваСеансов.Пользователь = КоличествоГруппДоступаПользователей.Пользователь
	               |			И (КоличествоГруппДоступаПользователей.КоличествоГруппДоступа > 1)
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПользователи КАК Пользователи
	               |		ПО ОграничениеКоличестваСеансов.Пользователь = Пользователи.Пользователь
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КоличествоГруппДоступа,
	               |	Пользователь,
	               |	ГруппаДоступа";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	КоличествоРезультатов = РезультатыЗапроса.Количество();
	
	КоличествоДоступныхСеансов = Новый Соответствие;
	
	Выборка = РезультатыЗапроса[КоличествоРезультатов - 2].Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		КоличествоДоступныхСеансов.Вставить(Выборка.ГруппаДоступа, Выборка.КоличествоДоступныхСеансов);
	КонецЦикла;
	
	Выборка = РезультатыЗапроса[КоличествоРезультатов - 1].Выбрать();
	
	Пока Выборка.СледующийПоЗначениюПоля("Пользователь") Цикл
		
		ГруппыДоступаПользователя = Новый Массив;
		КоличествоАктивныхСеансов = 0;
		
		Пока Выборка.Следующий() Цикл 
			ГруппыДоступаПользователя.Добавить(Выборка.ГруппаДоступа);
		    КоличествоАктивныхСеансов = Выборка.КоличествоАктивныхСеансов;
		КонецЦикла;
		
		Для Сч = 1 По КоличествоАктивныхСеансов Цикл 
			
			ГруппаДоступа = Неопределено;
			КоличествоСеансов = 0;
			
			Для Каждого ГруппаДоступаПользователя Из ГруппыДоступаПользователя Цикл 
				ОсталосьСеансов = КоличествоДоступныхСеансов[ГруппаДоступаПользователя];
				Если ГруппаДоступа = Неопределено Или ОсталосьСеансов > КоличествоСеансов Тогда 
					ГруппаДоступа = ГруппаДоступаПользователя;
					КоличествоСеансов = ОсталосьСеансов;
				КонецЕсли;
			КонецЦикла;
			
			КоличествоДоступныхСеансов[ГруппаДоступа] = КоличествоСеансов - 1;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из КоличествоДоступныхСеансов Цикл 
		Если КлючИЗначение.Значение < 0 Тогда
			Параметры.Вставить("ПревышеноМаксимальноеКоличествоСоединений", Истина);
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьОграниченияПродолжительностиСеансаПоУмолчанию() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиСамообслуживанияСотрудников.ОграничиватьПродолжительностьСеансаПользователей КАК ОграничиватьПродолжительностьСеансаПользователей
		|ИЗ
		|	РегистрСведений.НастройкиСамообслуживанияСотрудников КАК НастройкиСамообслуживанияСотрудников
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИСТИНА КАК ЗначениеИстина
		|ИЗ
		|	РегистрСведений.ГруппыДоступаБезОграниченияПродолжительностиСеанса КАК ГруппыДоступаБезОграниченияПродолжительностиСеанса";
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ОграничиватьПродолжительностьСеансаПользователей = Ложь;
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда 
		ОграничиватьПродолжительностьСеансаПользователей = Выборка.ОграничиватьПродолжительностьСеансаПользователей;
	КонецЕсли;
	
	Если Не ОграничиватьПродолжительностьСеансаПользователей Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не РезультатыЗапроса[1].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ИдентификаторыПоставляемыхДанных = ИдентификаторыПоставляемыхПрофилейДоступа();
	ПрофильСотрудник = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору(ИдентификаторПрофиляСотрудник());
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторыПоставляемыхДанных", ИдентификаторыПоставляемыхДанных);
	Запрос.УстановитьПараметр("ПрофильСотрудник", ПрофильСотрудник);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка КАК ГруппаДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
		|		ПО ГруппыДоступа.Профиль = ПрофилиГруппДоступа.Ссылка
		|			И (ПрофилиГруппДоступа.ИдентификаторПоставляемыхДанных В (&ИдентификаторыПоставляемыхДанных))
		|			И (ПрофилиГруппДоступа.Ссылка <> &ПрофильСотрудник)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ГруппыДоступа.Ссылка КАК ГруппаДоступа
		|ИЗ
		|	Справочник.ГруппыДоступа КАК ГруппыДоступа
		|ГДЕ
		|	ГруппыДоступа.Профиль = &ПрофильСотрудник";
				   
	УстановитьПривилегированныйРежим(Истина);
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Группы доступа без ограничения продолжительности сеанса
	НаборЗаписей = РегистрыСведений.ГруппыДоступаБезОграниченияПродолжительностиСеанса.СоздатьНаборЗаписей();
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	// Продолжительность сеанса групп доступа
	НаборЗаписей = РегистрыСведений.ПродолжительностьСеансаГруппДоступа.СоздатьНаборЗаписей();
	
	Выборка = РезультатыЗапроса[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.ГруппаДоступа = Выборка.ГруппаДоступа;
		НоваяСтрока.ПродолжительностьСеанса = 10;
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьОграниченияНаКоличествоСеансовПоУмолчанию() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиСамообслуживанияСотрудников.ОграничиватьКоличествоОдновременныхСеансовПользователей
	               |ИЗ
	               |	РегистрСведений.НастройкиСамообслуживанияСотрудников КАК НастройкиСамообслуживанияСотрудников
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	РегистрСведений.ГруппыДоступаБезОграниченийНаКоличествоСеансов КАК ГруппыДоступаБезОграниченийНаКоличествоСеансов";
				   
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ОграничиватьКоличествоОдновременныхСеансовПользователей = Ложь;
	
	Выборка = РезультатыЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда 
		ОграничиватьКоличествоОдновременныхСеансовПользователей = Выборка.ОграничиватьКоличествоОдновременныхСеансовПользователей;
	КонецЕсли;
	
	Если Не ОграничиватьКоличествоОдновременныхСеансовПользователей Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не РезультатыЗапроса[1].Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ИдентификаторыПоставляемыхДанных = ИдентификаторыПоставляемыхПрофилейДоступа();
	ПрофильСотрудник = Справочники.ПрофилиГруппДоступа.ПоставляемыйПрофильПоИдентификатору(ИдентификаторПрофиляСотрудник());
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ИдентификаторыПоставляемыхДанных", ИдентификаторыПоставляемыхДанных);
	Запрос.УстановитьПараметр("ПрофильСотрудник", ПрофильСотрудник);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ГруппыДоступа.Ссылка КАК ГруппаДоступа
	               |ИЗ
	               |	Справочник.ГруппыДоступа КАК ГруппыДоступа
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа КАК ПрофилиГруппДоступа
	               |		ПО ГруппыДоступа.Профиль = ПрофилиГруппДоступа.Ссылка
	               |			И (ПрофилиГруппДоступа.ИдентификаторПоставляемыхДанных В (&ИдентификаторыПоставляемыхДанных))
	               |			И (ПрофилиГруппДоступа.Ссылка <> &ПрофильСотрудник)";
				   
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	// Группы доступа без ограничений на количество сеансов
	НаборЗаписей = РегистрыСведений.ГруппыДоступаБезОграниченийНаКоличествоСеансов.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
	// Количество одновременных сеансов групп доступа
	НаборЗаписей = РегистрыСведений.КоличествоОдновременныхСеансовГруппДоступа.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ИдентификаторыПоставляемыхПрофилейДоступа()
	
	ПоставляемыеПрофили = УправлениеДоступомСлужебныйПовтИсп.ОписаниеПоставляемыхПрофилей();
	
	ИдентификаторыПоставляемыхДанных = Новый Массив;
	
	Для Каждого КлючИЗначение Из ПоставляемыеПрофили.ОписанияПрофилей Цикл 
		СвойстваПрофиля = КлючИЗначение.Значение;
	    ИдентификаторыПоставляемыхДанных.Добавить(Новый УникальныйИдентификатор(СвойстваПрофиля.Идентификатор));
	КонецЦикла;
	
	Возврат ИдентификаторыПоставляемыхДанных;
	
КонецФункции

Процедура ПриУстановкеНастройкиИспользоватьПубликацииМероприятийОбученияРазвития(ИспользоватьПубликацииМероприятийОбученияРазвития) Экспорт
	
	ИспользоватьЭлектронноеОбучение = ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеОбучение");
	УстановитьИспользованиеМоегоОбученияРазвития(ИспользоватьЭлектронноеОбучение, ИспользоватьПубликацииМероприятийОбученияРазвития);
	
КонецПроцедуры

Процедура УстановитьИспользованиеМоегоОбученияРазвития(ИспользоватьЭлектронноеОбучение, ИспользоватьПубликацииМероприятийОбученияРазвития) Экспорт
	
	ИспользоватьМоеОбучениеРазвитие = (ИспользоватьЭлектронноеОбучение Или ИспользоватьПубликацииМероприятийОбученияРазвития);
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 
		Или Не НаборЗаписей[0].ИспользоватьСамообслуживаниеСотрудников
		Или НаборЗаписей[0].ИспользоватьМоеОбучениеРазвитие = ИспользоватьМоеОбучениеРазвитие Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей[0].ИспользоватьМоеОбучениеРазвитие = ИспользоватьМоеОбучениеРазвитие;
	НаборЗаписей.Записать();
	
КонецПроцедуры

#Область РаботаСЗаявками

Процедура СформироватьДвиженияКадровыхПриказовЗаявокСотрудников(Движения, ДанныеКадровыхПриказовЗаявокСотрудников) Экспорт 
	
	Для Каждого ДанныеКадровогоПриказа Из ДанныеКадровыхПриказовЗаявокСотрудников Цикл
		
		Если Не ЗначениеЗаполнено(ДанныеКадровогоПриказа.ЗаявкаСотрудника) Тогда 
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Движения.КадровыеПриказыЗаявокСотрудников.Добавить();
		НоваяСтрока.ЗаявкаСотрудника = ДанныеКадровогоПриказа.ЗаявкаСотрудника;
		НоваяСтрока.Сотрудник = ДанныеКадровогоПриказа.Сотрудник;
		
	КонецЦикла;
	
	Движения.КадровыеПриказыЗаявокСотрудников.Записывать = (Движения.КадровыеПриказыЗаявокСотрудников.Количество() > 0);
	
КонецПроцедуры

Функция ДанныеДляПроведенияКадровыеПриказыЗаявокСотрудников(Ссылка) Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КадровыйПриказ.ЗаявкаСотрудника,
	               |	КадровыйПриказ.Сотрудник
	               |ИЗ
	               |	#КадровыйПриказ КАК КадровыйПриказ
	               |ГДЕ
	               |	КадровыйПриказ.Ссылка = &Ссылка";
				   
	ИмяТаблицыКадровогоПриказа = ОбщегоНазначения.ИмяТаблицыПоСсылке(Ссылка);			   
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#КадровыйПриказ", ИмяТаблицыКадровогоПриказа);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ПроверитьНаличиеКадровогоПриказаПоЗаявкеСотрудника(ЗаявкаСотрудника, Сотрудник, Регистратор, Отказ) Экспорт 

	Если Не ЗначениеЗаполнено(ЗаявкаСотрудника) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаявкаСотрудника", ЗаявкаСотрудника);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыеПриказыЗаявокСотрудников.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.КадровыеПриказыЗаявокСотрудников КАК КадровыеПриказыЗаявокСотрудников
		|ГДЕ
		|	КадровыеПриказыЗаявокСотрудников.ЗаявкаСотрудника = &ЗаявкаСотрудника
		|	И КадровыеПриказыЗаявокСотрудников.Сотрудник = &Сотрудник
		|	И КадровыеПриказыЗаявокСотрудников.Регистратор <> &Регистратор";
				   
	УстановитьПривилегированныйРежим(Истина);			   
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда 
		ТекстСообщения = НСтр("ru = 'По заявке сотрудника %1 уже оформлен кадровый приказ %2.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ЗаявкаСотрудника, Выборка.Регистратор);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ЗаявкаСотрудника", "Объект", Отказ);
	КонецЕсли;
	
КонецПроцедуры

Функция КадровыеПриказыЗаявокСотрудников(СписокЗаявокСотрудников)

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("СписокЗаявокСотрудников", СписокЗаявокСотрудников);
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыеПриказыЗаявокСотрудников.Регистратор КАК Регистратор,
		|	КадровыеПриказыЗаявокСотрудников.ЗаявкаСотрудника КАК ЗаявкаСотрудника
		|ИЗ
		|	РегистрСведений.КадровыеПриказыЗаявокСотрудников КАК КадровыеПриказыЗаявокСотрудников
		|ГДЕ
		|	КадровыеПриказыЗаявокСотрудников.ЗаявкаСотрудника В(&СписокЗаявокСотрудников)";
				   
	УстановитьПривилегированныйРежим(Истина);			   
	Выборка = Запрос.Выполнить().Выбрать();
	УстановитьПривилегированныйРежим(Ложь);
	
	КадровыеПриказы = Новый Соответствие;
	
	Пока Выборка.Следующий() Цикл
		КадровыеПриказы.Вставить(Выборка.ЗаявкаСотрудника, Выборка.Регистратор);
	КонецЦикла;
	
	Возврат КадровыеПриказы;
	
КонецФункции

Функция КадровыйПриказЗаявкиСотрудника(ЗаявкаСотрудника) Экспорт 
	
	СписокЗаявокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ЗаявкаСотрудника);
	КадровыеПриказы = КадровыеПриказыЗаявокСотрудников(СписокЗаявокСотрудников);
	 
	Возврат КадровыеПриказы[ЗаявкаСотрудника];
	 
КонецФункции
 
Процедура УстановитьСтатусЗаявки(Объект, РежимЗаписи) Экспорт
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не ЗначениеЗаполнено(Объект.Статус) Тогда
		УстановитьПривилегированныйРежим(Истина);
		Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Подготовлено;
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьКадровыйПриказЗаявки(Форма) Экспорт 
	
	Объект = Форма.Объект;
	
	Форма.КадровыйПриказ = Неопределено;
	Форма.КадровыйПриказИсправленногоДокумента = Неопределено;
	Форма.ДоступноИсправлениеКадровогоПриказаИсправленногоДокумента = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Не ЗначениеЗаполнено(Объект.ИсправленныйДокумент) Тогда 
		Возврат;
	КонецЕсли;
	
	СписокЗаявокСотрудников = Новый Массив;
	СписокЗаявокСотрудников.Добавить(Объект.Ссылка);
	СписокЗаявокСотрудников.Добавить(Объект.ИсправленныйДокумент);
	
	КадровыеПриказы = КадровыеПриказыЗаявокСотрудников(СписокЗаявокСотрудников);
	
	// Кадровый приказ текущей заявки.
	Форма.КадровыйПриказ = КадровыеПриказы[Объект.Ссылка];
	
	// Кадровый приказ исправленной заявки.
	КадровыйПриказ = КадровыеПриказы[Объект.ИсправленныйДокумент];
	Если КадровыйПриказ <> Неопределено Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		РеквизитыКадровогоПриказа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КадровыйПриказ, "Организация, ПериодРегистрации");
		
		РезультатПроверки =  ИсправлениеДокументовЗарплатаКадры.ДоступноИсправлениеРасчетногоДокумента(
			КадровыйПриказ, РеквизитыКадровогоПриказа.Организация, РеквизитыКадровогоПриказа.ПериодРегистрации, Истина);
		ИсправлениеДоступно = РезультатПроверки.ИсправлениеДоступно;
		УстановитьПривилегированныйРежим(Ложь);
		
		Форма.КадровыйПриказИсправленногоДокумента = КадровыйПриказ;
		Форма.ДоступноИсправлениеКадровогоПриказаИсправленногоДокумента = ИсправлениеДоступно;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ГруппаИсправлениеДополнитьФорму(Форма) Экспорт 
	
	Элементы = Форма.Элементы;
	ГруппаОтмена = Элементы.ГруппаОтмена;
	ГруппаИсправление = Элементы.ГруппаИсправление;
	
	// Добавление реквизитов
	ДобавляемыеРеквизиты = Новый Массив;
	
	ИмяДокументаОтмены = ИмяДокументаОтменыЗаявки(Форма.Объект.Ссылка);
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ОтменаИнфоНадпись", Новый ОписаниеТипов("Строка")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДокументОтменен", Новый ОписаниеТипов("Булево")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДокументОтменаЗаявки", Новый ОписаниеТипов("ДокументСсылка." + ИмяДокументаОтмены)));
	
	МассивИменРеквизитовФормы = Новый Массив;
	ЗарплатаКадры.ЗаполнитьМассивИменРеквизитовФормы(Форма, МассивИменРеквизитовФормы);
	
	ЗарплатаКадры.ИзменитьРеквизитыФормы(Форма, ДобавляемыеРеквизиты, МассивИменРеквизитовФормы);
	
	// Добавление команд и элементов
	ИмяКоманды = "Отменить";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Отменить'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаИсправление, Элементы.Найти("ИсправлениеКартинка"));
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
	Если Элементы.Найти("ОтменаКартинка") = Неопределено Тогда
		Элемент = Элементы.Добавить("ОтменаКартинка", Тип("ДекорацияФормы"), ГруппаОтмена);
		Элемент.Вид = ВидДекорацииФормы.Картинка;
		Элемент.Картинка = БиблиотекаКартинок.Предупреждение;
		Элемент.Ширина = 2;
		Элемент.Высота = 1;
	КонецЕсли;
	
	Если Элементы.Найти("ОтменаИнфоНадпись") = Неопределено Тогда
		Элемент = Элементы.Добавить("ОтменаИнфоНадпись", Тип("ПолеФормы"), ГруппаОтмена);
		Элемент.ПутьКДанным = "ОтменаИнфоНадпись";
		Элемент.Вид = ВидПоляФормы.ПолеНадписи;
		Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
		Элемент.ЦветТекста = ЦветаСтиля.ПоясняющийТекст;
		Элемент.Высота = 3;
		Элемент.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
	
	ИмяКоманды = "ПерейтиКДокументуОтмены";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Открыть документ отмены'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаОтмена);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = ИмяКоманды;
		Элемент.Ширина = 11;
		Элемент.Высота = 3;
	КонецЕсли;
	
	ИмяКоманды = "Отозвать";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Отозвать'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	КонецЕсли;
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.КоманднаяПанель);
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
	ГруппаСогласование = Элементы.Найти("ГруппаСогласование");
	
	ИмяКоманды = "Согласовать";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Согласовать'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	КонецЕсли;
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаСогласование);
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
	ИмяКоманды = "Отклонить";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = НСтр("ru = 'Отклонить'");
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
		КомандаФормы.ИзменяетСохраняемыеДанные = Истина;
	КонецЕсли;
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаСогласование);
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьРеквизитыИсправления(Форма) Экспорт 
	
	Форма.ДокументОтменен = Ложь;
	Форма.ДокументОтменаЗаявки = Неопределено;
	
	Объект = Форма.Объект;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Возврат;
	КонецЕсли;
	
	ИмяДокументаОтмены = ИмяДокументаОтменыЗаявки(Объект.Ссылка);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Документ.Ссылка КАК Ссылка
	|ИЗ
	|	Документ." + ИмяДокументаОтмены + " КАК Документ
	|ГДЕ
	|	Документ.ЗаявкаСотрудника = &Ссылка
	|	И Документ.Проведен");
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Форма.ДокументОтменен = Истина;
		Форма.ДокументОтменаЗаявки = Выборка.Ссылка;
	КонецЕсли;
	
	Форма.ТолькоПросмотр = Форма.ТолькоПросмотр Или Форма.ДокументОтменен;
			
КонецПроцедуры

Процедура УстановитьПоляИсправления(Форма, КадровыйПриказ = Неопределено) Экспорт 
	
	Если ЗначениеЗаполнено(КадровыйПриказ) И Не ЗначениеЗаполнено(Форма.ДокументИсправление) Тогда 
		Форма.Элементы.ИсправлениеКартинка.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'На основании заявки оформлен кадровый приказ. Воспользуйтесь командой Исправить для исправления этого документа или Отменить для его отмены.'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.ДокументОтменаЗаявки) Тогда 
		Форма.ОтменаИнфоНадпись = НСтр("ru = 'Документ отменен и его редактирование невозможно.'");
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементовЗаявки(Форма, КадровыйПриказ = Неопределено) Экспорт 
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	
	ПриказОформлен = ЗначениеЗаполнено(КадровыйПриказ);
	ЕстьИсправленныйДокумент = ЗначениеЗаполнено(Объект.ИсправленныйДокумент);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
		"ГруппаИсправление", "Видимость", Не Форма.ДокументОтменен И Объект.Проведен И (ПриказОформлен Или ЕстьИсправленныйДокумент));
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаОтмена", "Видимость", Форма.ДокументОтменен);
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	ДоступноСогласование = МенеджерОбъекта.ДоступноСогласованиеДокумента();
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Согласовать", "Видимость", ДоступноСогласование);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отклонить", "Видимость", ДоступноСогласование);
	
	ДокументРассмотрен = Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Отклонено Или Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ГруппаСтатус", "Видимость", ДокументРассмотрен И Не Форма.ДокументОтменен);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПерейтиКДокументуОтмены", "Видимость", Форма.ДокументОтменен);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "Отменить", "Видимость", Не ЗначениеЗаполнено(Форма.ДокументИсправление));
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ФизическоеЛицо", "ТолькоПросмотр", Форма.РежимМоиЗаявки);
	
	Если ПриказОформлен Тогда 
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяДокументаОтменыЗаявки(ЗаявкаСотрудника)
	
	ИмяТаблицы = ОбщегоНазначения.ИмяТаблицыПоСсылке(ЗаявкаСотрудника);
	ЧастиИмени = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИмяТаблицы, ".");
	ИмяДокумента = ЧастиИмени[ЧастиИмени.Количество()-1];
	ИмяДокументаОтмены = "ОтменаЗаявки" + Сред(ИмяДокумента, 7);
	
	Возврат ИмяДокументаОтмены;
	
КонецФункции

Процедура ЗаполнитьОтпускПоЗаявкеСотрудника(Объект, ДанныеЗаполнения) Экспорт
	
	Если Не ДанныеЗаполнения.Свойство("ДанныеЗаявкиСотрудника") Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеОтпуска = ДанныеЗаполнения.ДанныеЗаявкиСотрудника;
	
	Объект.ЗаявкаСотрудника = ДанныеОтпуска.ЗаявкаСотрудника;
	
	Если Объект.ЭтоНовый() Тогда
		
		Объект.ПредоставитьОсновнойОтпуск = Истина;
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
		Объект.ДатаНачалаСобытия = ДанныеОтпуска.ДатаНачала;
		
		Если ЗначениеЗаполнено(ДанныеОтпуска.ФизическоеЛицо) Тогда 
			СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеОтпуска.ФизическоеЛицо);
			ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Ложь, Неопределено, ДанныеОтпуска.ДатаНачала);
			Если ТаблицаСотрудников.Количество() > 0 Тогда 
				Объект.Сотрудник = ТаблицаСотрудников[0].Сотрудник;
			КонецЕсли;
		КонецЕсли;	
		
		ПроизводственныйКалендарьСотрудника = КалендарныеГрафики.ПроизводственныйКалендарьРоссийскойФедерации();
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Сотрудник), "Организация, ГрафикРаботы");
			Объект.Организация = КадровыеДанныеСотрудника[0].Организация;
			ПроизводственныйКалендарьСотрудника = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КадровыеДанныеСотрудника[0].ГрафикРаботы, "ПроизводственныйКалендарь");
		КонецЕсли;
		
		ПланируемаяДатыВыплатыОтпуска = Документы.Отпуск.ПланируемаяДатыВыплатыОтпуска(Объект.ДатаНачалаСобытия, ПроизводственныйКалендарьСотрудника);
		Если ПланируемаяДатыВыплатыОтпуска <> Неопределено Тогда
			Объект.ПланируемаяДатаВыплаты = ПланируемаяДатыВыплатыОтпуска;
		КонецЕсли;														
	
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			
			ЗапрашиваемыеЗначения = Новый Структура;
			ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
			
			Если НЕ ЗначениеЗаполнено(Объект.Руководитель) Тогда
				ЗапрашиваемыеЗначения.Вставить("Руководитель", "Руководитель");
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Объект.ДолжностьРуководителя) Тогда
				ЗапрашиваемыеЗначения.Вставить("ДолжностьРуководителя", "ДолжностьРуководителя");
			КонецЕсли; 
			
			ЗапрашиваемыеЗначения.Вставить("ГлавныйБухгалтер", "ГлавныйБухгалтер");
			ЗапрашиваемыеЗначения.Вставить("Бухгалтер", "Бухгалтер");
			
			ЗапрашиваемыеЗначения.Вставить("РаботникКадровойСлужбы", "РаботникКадровойСлужбы");
			ЗапрашиваемыеЗначения.Вставить("ДолжностьРаботникаКадровойСлужбы", "ДолжностьРаботникаКадровойСлужбы");
			
			ЗарплатаКадры.ЗаполнитьЗначенияВФорме(Объект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
			
		КонецЕсли; 
		
	КонецЕсли;
	
	Если Объект.ПредоставитьОсновнойОтпуск Тогда 
		
		Объект.ДатаНачалаОсновногоОтпуска = ДанныеОтпуска.ДатаНачала;
		Объект.ДатаОкончанияОсновногоОтпуска = ДанныеОтпуска.ДатаОкончания;
		
		Объект.КоличествоДнейОсновногоОтпуска = ДанныеОтпуска.КоличествоДней;
		
		УстановитьПривилегированныйРежим(Истина);
		
		СтруктураПараметров = ОстаткиОтпусков.ПараметрыПолученияРабочегоПериодаОтпуска();
		СтруктураПараметров.Сотрудник = Объект.Сотрудник;
		СтруктураПараметров.ТекущийРегистратор = Объект.Ссылка;
		СтруктураПараметров.ВидОтпуска = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
		СтруктураПараметров.ДатаНачала = Объект.ДатаНачалаОсновногоОтпуска;
		СтруктураПараметров.ДатаОкончания = Объект.ДатаОкончанияОсновногоОтпуска;
		СтруктураПараметров.ДатаКомпенсации = Объект.ПериодРегистрации;
		СтруктураПараметров.КоличествоДнейКомпенсации = Объект.КоличествоДнейКомпенсацииОсновногоОтпуска;
		ПериодОсновногоОтпуска = ОстаткиОтпусков.РабочийПериодОтпуска(СтруктураПараметров);
		
		Объект.НачалоПериодаЗаКоторыйПредоставляетсяОтпуск	= ПериодОсновногоОтпуска.РабочийГодС;
		Объект.КонецПериодаЗаКоторыйПредоставляетсяОтпуск	= ПериодОсновногоОтпуска.РабочийГодПо;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьКомандировкуПоЗаявкеСотрудника(Объект, ДанныеЗаполнения) Экспорт

	Если Не ДанныеЗаполнения.Свойство("ДанныеЗаявкиСотрудника") Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеКомандировки = ДанныеЗаполнения.ДанныеЗаявкиСотрудника;
	
	Объект.ЗаявкаСотрудника = ДанныеКомандировки.ЗаявкаСотрудника;
	
	Объект.ДатаНачала = ДанныеКомандировки.ДатаНачала;
	Объект.ДатаОкончания = ДанныеКомандировки.ДатаОкончания;
	Объект.МестоНазначения = ДанныеКомандировки.МестоНазначения;
	Объект.ОрганизацияНазначения = ДанныеКомандировки.ОрганизацияНазначения;
	Объект.Цель = ДанныеКомандировки.Цель;
	
	Если Объект.ЭтоНовый() Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
		Объект.ДатаНачалаСобытия = ДанныеКомандировки.ДатаНачала;
		
		Если ЗначениеЗаполнено(ДанныеКомандировки.ФизическоеЛицо) Тогда 
			СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеКомандировки.ФизическоеЛицо);
			ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Ложь, Неопределено, ДанныеКомандировки.ДатаНачала);
			Если ТаблицаСотрудников.Количество() > 0 Тогда 
				Объект.Сотрудник = ТаблицаСотрудников[0].Сотрудник;
			КонецЕсли;
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(Объект.Сотрудник) Тогда
			КадровыеДанныеСотрудника = КадровыйУчет.КадровыеДанныеСотрудников(Истина, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Сотрудник), "Организация");
			Объект.Организация = КадровыеДанныеСотрудника[0].Организация;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			
			ЗапрашиваемыеЗначения = Новый Структура;
			ЗапрашиваемыеЗначения.Вставить("Организация", "Организация");
			
			Если НЕ ЗначениеЗаполнено(Объект.Руководитель) Тогда
				ЗапрашиваемыеЗначения.Вставить("Руководитель", "Руководитель");
			КонецЕсли; 
			
			Если НЕ ЗначениеЗаполнено(Объект.ДолжностьРуководителя) Тогда
				ЗапрашиваемыеЗначения.Вставить("ДолжностьРуководителя", "ДолжностьРуководителя");
			КонецЕсли; 
			
			ЗарплатаКадры.ЗаполнитьЗначенияВФорме(Объект, ЗапрашиваемыеЗначения, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Организация"));
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ГруппаЗаявкаСотрудникаДополнитьФорму(Форма) Экспорт 
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	ГруппаЗаявкаСотрудника = Элементы.ГруппаЗаявкаСотрудника;
	
	Если ТипЗнч(Объект.ЗаявкаСотрудника) = Тип("ДокументСсылка.ЗаявкаНаОтпуск") И Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаОтпуск")
		Или ТипЗнч(Объект.ЗаявкаСотрудника) = Тип("ДокументСсылка.ЗаявкаНаКомандировку") И Не ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаКомандировку") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ЗаявкаСотрудника) Тогда 
		Возврат;
	КонецЕсли;
	
	// Добавление команд
	ИмяКоманды = "ОткрытьЗаявкуСотрудника";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = Строка(Объект.ЗаявкаСотрудника);
		КомандаФормы.Действие = "Подключаемый_" + ИмяКоманды;
	КонецЕсли;
	Если Элементы.Найти(ИмяКоманды) = Неопределено Тогда
		Элемент = Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), ГруппаЗаявкаСотрудника);
		Элемент.Вид = ВидКнопкиФормы.Гиперссылка;
		Элемент.ИмяКоманды = ИмяКоманды;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтозватьЗаявку(Форма) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект = Форма.Объект;
	
	Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Отозвано;
	Объект.Рассмотрел = Неопределено;
	Объект.ДатаРассмотрения = Неопределено;
	
	Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
КонецПроцедуры

Процедура СогласоватьЗаявку(Форма) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект = Форма.Объект;
	
	Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Согласовано;
	Объект.Рассмотрел = Строка(Пользователи.ТекущийПользователь());
	Объект.ДатаРассмотрения = ТекущаяДатаСеанса();
	
	Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
КонецПроцедуры

Процедура ОтклонитьЗаявку(Форма) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Объект = Форма.Объект;
	
	Объект.Статус = Перечисления.СтатусыЗаявокСотрудников.Отклонено;
	Объект.Рассмотрел = Строка(Пользователи.ТекущийПользователь());
	Объект.ДатаРассмотрения = ТекущаяДатаСеанса();
	
	Форма.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
	
КонецПроцедуры

Процедура ОбработкаЗаполненияДокументаДоходВНатуральнойФорме(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если Не ТипЗнч(ДанныеЗаполнения.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаЕдиновременнуюКомпенсацию") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаявкиСотрудника = ДанныеЗаполнения.ДанныеЗаявкиСотрудника;
	
	Если ЗначениеЗаполнено(ДанныеЗаявкиСотрудника.ФизическоеЛицо) Тогда 
		
		МесяцНачисления = НачалоМесяца(ТекущаяДатаСеанса());
		СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаявкиСотрудника.ФизическоеЛицо);
		ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Ложь, Неопределено, МесяцНачисления);
		
		Если ТаблицаСотрудников.Количество() > 0 Тогда
			
			КадровыеДанные = "Организация, Подразделение";
			СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТаблицаСотрудников[0].Сотрудник);
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, КадровыеДанные, МесяцНачисления);
			
			Если КадровыеДанныеСотрудников.Количество() > 0 Тогда
				
				Объект.Организация = КадровыеДанныеСотрудников[0].Организация;
				Объект.МесяцНачисления = МесяцНачисления;
				
				НоваяСтрока = Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник = КадровыеДанныеСотрудников[0].Сотрудник;
				НоваяСтрока.Подразделение = КадровыеДанныеСотрудников[0].Подразделение;
				НоваяСтрока.Результат = ДанныеЗаявкиСотрудника.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполненияДокументаМатериальнаяПомощь(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если Не ТипЗнч(ДанныеЗаполнения.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаЕдиновременнуюКомпенсацию") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаявкиСотрудника = ДанныеЗаполнения.ДанныеЗаявкиСотрудника;
	
	Если ЗначениеЗаполнено(ДанныеЗаявкиСотрудника.ФизическоеЛицо) Тогда 
		
		МесяцНачисления = НачалоМесяца(ТекущаяДатаСеанса());
		СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаявкиСотрудника.ФизическоеЛицо);
		ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Ложь, Неопределено, МесяцНачисления);
		
		Если ТаблицаСотрудников.Количество() > 0 Тогда
			
			КадровыеДанные = "Организация, Подразделение";
			СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТаблицаСотрудников[0].Сотрудник);
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, КадровыеДанные, МесяцНачисления);
			
			Если КадровыеДанныеСотрудников.Количество() > 0 Тогда
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "ВЫБРАТЬ
				               |	Начисления.Ссылка
				               |ИЗ
				               |	ПланВидовРасчета.Начисления КАК Начисления
				               |ГДЕ
				               |	Начисления.ВидДокументаНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовНачисления.МатериальнаяПомощь)
				               |	И Начисления.КодДоходаНДФЛ = ЗНАЧЕНИЕ(Справочник.ВидыДоходовНДФЛ.Код2760)
				               |	И НЕ Начисления.ВАрхиве";
							   
				ВидРасчета = Неопределено;
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					ВидРасчета = Выборка.Ссылка;
				КонецЕсли;
				
				Объект.Организация = КадровыеДанныеСотрудников[0].Организация;
				Объект.ПериодРегистрации = МесяцНачисления;
				Объект.ВидРасчета = ВидРасчета;
				
				НоваяСтрока = Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник = КадровыеДанныеСотрудников[0].Сотрудник;
				НоваяСтрока.Подразделение = КадровыеДанныеСотрудников[0].Подразделение;
				НоваяСтрока.Результат = ДанныеЗаявкиСотрудника.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполненияДокументаРазовоеНачисление(Объект, ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	
	Если Не ТипЗнч(ДанныеЗаполнения.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаЕдиновременнуюКомпенсацию") Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеЗаявкиСотрудника = ДанныеЗаполнения.ДанныеЗаявкиСотрудника;
	
	Если ЗначениеЗаполнено(ДанныеЗаявкиСотрудника.ФизическоеЛицо) Тогда 
		
		МесяцНачисления = НачалоМесяца(ТекущаяДатаСеанса());
		СписокФизическихЛиц = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗаявкиСотрудника.ФизическоеЛицо);
		ТаблицаСотрудников = КадровыйУчет.ОсновныеСотрудникиФизическихЛиц(СписокФизическихЛиц, Ложь, Неопределено, МесяцНачисления);
		
		Если ТаблицаСотрудников.Количество() > 0 Тогда
			
			КадровыеДанные = "Организация, Подразделение";
			СписокСотрудников = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТаблицаСотрудников[0].Сотрудник);
			КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СписокСотрудников, КадровыеДанные, МесяцНачисления);
			
			Если КадровыеДанныеСотрудников.Количество() > 0 Тогда
				
				Запрос = Новый Запрос;
				
				Запрос.Текст = "ВЫБРАТЬ
				               |	Начисления.Ссылка
				               |ИЗ
				               |	ПланВидовРасчета.Начисления КАК Начисления
				               |ГДЕ
				               |	Начисления.ВидДокументаНачисления = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовНачисления.РазовоеНачисление)
				               |	И НЕ Начисления.ВАрхиве";
							   
				Начисление = Неопределено;
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда 
					Начисление = Выборка.Ссылка;
				КонецЕсли;
				
				Объект.Организация = КадровыеДанныеСотрудников[0].Организация;
				Объект.МесяцНачисления = МесяцНачисления;
				Объект.Начисление = Начисление;
				
				НоваяСтрока = Объект.Начисления.Добавить();
				НоваяСтрока.Сотрудник = КадровыеДанныеСотрудников[0].Сотрудник;
				НоваяСтрока.Подразделение = КадровыеДанныеСотрудников[0].Подразделение;
				НоваяСтрока.Результат = ДанныеЗаявкиСотрудника.Сумма;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

// Предназначена для использования в ОбщегоНазначенияПереопределяемый.ЗаполнитьТаблицуПереименованияОбъектовМетаданных.
//
// Заполняет переименования тех объектов метаданных, которые невозможно
// автоматически найти по типу, но ссылки на которые требуется сохранять
// в базе данных (например: подсистемы, роли).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьПереименование().
//
Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.0.20.28",
		"Роль.ПрофильСотрудник",
		"Роль.ИнтерфейсРабочегоСтолаСотрудник",
		"ЗарплатаКадрыРасширенная");
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеПользователейФизическихЛиц

Функция НовыйПользователь(ДанныеСотрудника, НастройкиПользователей, НастройкиСообщений) Экспорт 
	
	ИмяПользователя = СвободноеИмяПользователя(ДанныеСотрудника.Фамилия, ДанныеСотрудника.Имя, ДанныеСотрудника.Отчество, " (2)");
	
	ОписаниеПользователяИБ = Пользователи.НовоеОписаниеПользователяИБ();
	ОписаниеПользователяИБ.Имя = ИмяПользователя;
	ОписаниеПользователяИБ.ПолноеИмя = ИмяПользователя;
	ОписаниеПользователяИБ.АутентификацияСтандартная = НастройкиПользователей.АутентификацияСтандартная;
	ОписаниеПользователяИБ.ПоказыватьВСпискеВыбора = НастройкиПользователей.ПоказыватьВСпискеВыбора;
	ОписаниеПользователяИБ.ЗапрещеноИзменятьПароль = НастройкиПользователей.ЗапрещеноИзменятьПароль;
	ОписаниеПользователяИБ.АутентификацияOpenID = НастройкиПользователей.АутентификацияOpenID;
	ОписаниеПользователяИБ.АутентификацияОС = НастройкиПользователей.АутентификацияОС;
	ОписаниеПользователяИБ.Пароль = СлучайныйПароль();
	
	Если ОписаниеПользователяИБ.АутентификацияОС Тогда 
		ОписаниеПользователяИБ.ПользовательОС = ДанныеСотрудника.ПользовательОС;
	КонецЕсли;
	
	ИдентификаторПользователяИБ = Неопределено;
	СоздатьНовогоПользователяИБ = Истина;
	ОписаниеОшибки = "";
	ПользовательИБ = Неопределено;
	
	Пользователи.УстановитьСвойстваПользователяИБ(ИмяПользователя, ОписаниеПользователяИБ, Истина);
	ПользовательИБ = ОписаниеПользователяИБ.ПользовательИБ;
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	
	Пользователь.Наименование = ПользовательИБ.Имя;
	Если ЗначениеЗаполнено(НастройкиПользователей.ГруппаПользователей) Тогда 
		Пользователь.ДополнительныеСвойства.Вставить("ГруппаНовогоПользователя", НастройкиПользователей.ГруппаПользователей);
	КонецЕсли;
	
	Пользователь.ФизическоеЛицо = ДанныеСотрудника.ФизическоеЛицо;
	
	СвойстваПользователяИБ = Новый Структура;
	СвойстваПользователяИБ.Вставить("Действие", "Записать");
	СвойстваПользователяИБ.Вставить("УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);
	
	Пользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", СвойстваПользователяИБ);
	
	Пользователь.Записать();
	
	Если НастройкиСообщений.РассылатьУведомленияАвтоматически Тогда 
		ТекстПисьма = ТекстПисьмаУведомления(ОписаниеПользователяИБ.Имя, ОписаниеПользователяИБ.Пароль, НастройкиСообщений);
	    ОтправитьСообщениеПользователю(ДанныеСотрудника, ТекстПисьма, НастройкиСообщений);
	КонецЕсли;
	
	Возврат Пользователь.Ссылка;
	
КонецФункции

Функция СвободноеИмяПользователя(Фамилия, Имя, Отчество, Постфикс = Неопределено)
	
	ВозможныеЗначения = Новый Массив;
	
	ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 1) + Лев(Отчество, 1));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 1) + Лев(Отчество, 1) + " " + Постфикс);
	КонецЕсли;
	
	ВозможныеЗначения.Добавить(Фамилия);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Постфикс);
	КонецЕсли;
	
	ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Отчество);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Отчество + " " + Постфикс);
	КонецЕсли;
	
	ВозможныеЗначения.Добавить(Фамилия + " " + Имя);
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Постфикс);
	КонецЕсли;
	
	ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Лев(Отчество, 1));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + " " + Имя + " " + Лев(Отчество, 1) + " " + Постфикс);
	КонецЕсли;
	
	ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 4) + Лев(Отчество, 4));
	Если ЗначениеЗаполнено(Постфикс) Тогда
		ВозможныеЗначения.Добавить(Фамилия + Лев(Имя, 4) + Лев(Отчество, 4) + " " + Постфикс);
	КонецЕсли;
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Пользователи.Наименование
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Наименование В(&ВозможныеЗначения)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ВозможныеЗначения", ВозможныеЗначения);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЗанятыеЗначения = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		ЗанятыеЗначения.Вставить(СокрЛП(Выборка.Наименование), Истина);
	КонецЦикла;
	
	Для Каждого ИмяПользователя Из ВозможныеЗначения Цикл
		Если ЗанятыеЗначения[ИмяПользователя] = Неопределено Тогда
			Возврат ИмяПользователя;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

Функция СлучайныйПароль() Экспорт 
	
	НастройкиВхода = ПользователиСлужебныйПовтИсп.Настройки().Пользователи;
	
	Если НастройкиВхода.МинимальнаяДлинаПароля > 8 Тогда
		МинимальнаяДлинаПароля = НастройкиВхода.МинимальнаяДлинаПароля;
	Иначе
		МинимальнаяДлинаПароля = 8;
	КонецЕсли;
	
	ПараметрыПароля = ПользователиСлужебный.ПараметрыПароля(МинимальнаяДлинаПароля, Истина);
	
	НовыйПароль = ПользователиСлужебный.СоздатьПароль(ПараметрыПароля);
	
	Возврат НовыйПароль;
	
КонецФункции

Процедура ОтправитьСообщениеПользователю(ДанныеСотрудника, ТекстПисьма, НастройкиСообщений) Экспорт 
	
	Если Не ЗначениеЗаполнено(ДанныеСотрудника.АдресЭлектроннойПочты) Тогда 
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Для работника %1 не указан адрес электронной почты.'"), ДанныеСотрудника.ФизическоеЛицо);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = Новый Структура;
	ПараметрыПисьма.Вставить("Кому", ДанныеСотрудника.АдресЭлектроннойПочты);
	ПараметрыПисьма.Вставить("Тема", НастройкиСообщений.ЗаголовокУведомления);
	ПараметрыПисьма.Вставить("Тело", ТекстПисьма);
	ПараметрыПисьма.Вставить("ТипТекста", "HTML");
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(
			РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись(), ПараметрыПисьма);
	Исключение
		ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка при отправке уведомления работнику %1: %2.'"), ДанныеСотрудника.ФизическоеЛицо, ОписаниеОшибки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецПопытки;
	
	НаборЗаписей = РегистрыСведений.ДатыОтправкиСообщенийСотрудникам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ФизическоеЛицо.Установить(ДанныеСотрудника.ФизическоеЛицо);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ФизическоеЛицо = ДанныеСотрудника.ФизическоеЛицо;
	НоваяЗапись.ДатаОтправки = ТекущаяДатаСеанса();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Функция ТекстПисьмаУведомления(ПользовательИБ, Пароль, НастройкиСообщений) Экспорт 
	
	ТекстПисьма = НастройкиСообщений.ШаблонУведомления;
	
	// имя пользователя и пароль
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%ИмяПользователяИБ%", ПользовательИБ);
	ТекстПисьма = СтрЗаменить(ТекстПисьма, "%Пароль%", ?(Не ПустаяСтрока(Пароль), Пароль, НСтр("ru = 'без пароля'")));
	
	// адрес веб-сервера
	Если НастройкиСообщений.ВключатьВебСсылкуВУведомление Тогда
		ТекстПисьма = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1
                                                                                    |
                                                                                    |Прямая ссылка:
                                                                                    |<a href=""%2"">%2</a>'"),
						ТекстПисьма,
						ВебСсылкаПереходаВСистему(ПользовательИБ, Пароль));
	КонецЕсли;
	
	// обрабатываем разрывы строк
	ОтдельныеСтрокиТекста = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТекстПисьма, Символы.ПС);
	HTMLКодОтдельныхСтрок = ОтдельныеСтрокиТекста[0];
	НомерСтроки = 1;
	Пока НомерСтроки < ОтдельныеСтрокиТекста.Количество() Цикл
		HTMLКодОтдельныхСтрок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1<BR>%2</BR>",
									HTMLКодОтдельныхСтрок, 
									ОтдельныеСтрокиТекста[НомерСтроки]);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	HTMLКод = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("%1<P>%2</P>",
				HTMLКод,
				HTMLКодОтдельныхСтрок);
	
	Возврат HTMLКод;
	
КонецФункции

Функция ВебСсылкаПереходаВСистему(ИмяПользователя, Пароль)
	
	АдресВебСервера = ОбщегоНазначения.АдресПубликацииИнформационнойБазыВИнтернете();
	
	Шаблон = "%1%2" + ?(ЗначениеЗаполнено(ИмяПользователя), "?N=%3", "") + ?(ЗначениеЗаполнено(Пароль), "&P=%4", "");
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, 
				СокрЛП(АдресВебСервера), ?(Прав(СокрЛП(АдресВебСервера), 1) <> "/", "/", ""), ИмяПользователя, Пароль);
				
КонецФункции

Процедура УстановитьАутентификациюПользователя(ПользовательСсылка, ВходВПрограммуРазрешен) Экспорт 
	
	Пользователь = ПользовательСсылка.ПолучитьОбъект();
	Пользователь.Недействителен = Не ВходВПрограммуРазрешен;
	СвойстваПользователяИБ = Новый Структура;
	СвойстваПользователяИБ.Вставить("Действие", "Записать");
	СвойстваПользователяИБ.Вставить("ВходВПрограммуРазрешен", ВходВПрограммуРазрешен);
	Пользователь.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ", СвойстваПользователяИБ);
	Пользователь.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ПервоначальногоЗаполненияИОбновленияИБ

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.19.27";
	Обработчик.Процедура = "СамообслуживаниеСотрудников.НачальноеЗаполнениеПараметровСозданияПользователейРегламентнымЗаданием";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.19.29";
	Обработчик.Процедура = "СамообслуживаниеСотрудников.НачальноеЗаполнениеПричинОтсутствияСотрудников";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.0.25.47";
	Обработчик.Процедура = "СамообслуживаниеСотрудников.НачальноеЗаполнениеВидовПредоставляемыхСотрудникамСправок";
	Обработчик.НачальноеЗаполнение = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.3.56";
	Обработчик.Процедура = "РегистрыСведений.НастройкиСамообслуживанияСотрудников.ВключитьИспользованиеМоегоОбученияРазвития";
	Обработчик.РежимВыполнения = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОсновнойРежимВыполненияОбновления();
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a88b0860-5ad3-4bdf-9a07-8b88fec0c2fc");
	Обработчик.Комментарий = НСтр("ru = 'Установка использования моего обучения и развития.'");
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.1.4.20";
	Обработчик.Процедура = "СамообслуживаниеСотрудников.УстановитьПараметрыНабораСвойствСправочников";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("aacbe089-231d-461d-841c-cad0811170f2");
	Обработчик.Комментарий = НСтр("ru = 'Установка параметров для набора свойств справочников самообслуживания сотрудников. Дополнительные реквизиты временно недоступны.'");
	
КонецПроцедуры

Процедура НачальноеЗаполнениеПараметровСозданияПользователейРегламентнымЗаданием() Экспорт 
	
	РегистрыСведений.ПараметрыСозданияПользователейФизическихЛиц.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура НачальноеЗаполнениеПричинОтсутствияСотрудников() Экспорт 
	
	Справочники.ПричиныОтсутствияСотрудников.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура НачальноеЗаполнениеВидовПредоставляемыхСотрудникамСправок() Экспорт 
	
	Справочники.ВидыПредоставляемыхСотрудникамСправок.НачальноеЗаполнение();
	
КонецПроцедуры

Процедура УстановитьПараметрыНабораСвойствСправочников(ПараметрыОбновления = НеОпределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(НастройкиСамообслуживанияСотрудников.ИспользоватьЗаявкиНаЕдиновременнуюКомпенсацию) КАК ИспользоватьЗаявкиНаЕдиновременнуюКомпенсацию,
	|	МАКСИМУМ(НастройкиСамообслуживанияСотрудников.ИспользоватьЗапросыСправокСотрудником) КАК ИспользоватьЗапросыСправокСотрудником,
	|	МАКСИМУМ(НастройкиСамообслуживанияСотрудников.ИспользоватьСообщенияОбОтсутствии) КАК ИспользоватьСообщенияОбОтсутствии
	|ИЗ
	|	РегистрСведений.НастройкиСамообслуживанияСотрудников КАК НастройкиСамообслуживанияСотрудников";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		ПараметрыНабора.Используется = Выборка.ИспользоватьЗаявкиНаЕдиновременнуюКомпенсацию;
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ВидыЗаявокНаЕдиновременнуюКомпенсациюСотрудникам", ПараметрыНабора);
		
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		ПараметрыНабора.Используется = Выборка.ИспользоватьЗапросыСправокСотрудником;
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ВидыПредоставляемыхСотрудникамСправок", ПараметрыНабора);
		
		ПараметрыНабора = УправлениеСвойствами.СтруктураПараметровНабораСвойств();
		ПараметрыНабора.Используется = Выборка.ИспользоватьСообщенияОбОтсутствии;
		УправлениеСвойствами.УстановитьПараметрыНабораСвойств("Справочник_ПричиныОтсутствияСотрудников", ПараметрыНабора);
		
	КонецЦикла;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НачальнаяНастройкаПрограммы

Процедура ЗначенияСохраняемыхРеквизитовФормыНачальнаяНастройкаПрограммы(Форма, СохраняемыеРеквизиты) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.РаботаВКОРП Тогда
		Возврат;
	КонецЕсли;
	
	СохраняемыеРеквизиты.Вставить("НастройкиСамообслуживанияСотрудников", ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(
			Форма.НастройкиСамообслуживанияСотрудников, Метаданные.РегистрыСведений.НастройкиСамообслуживанияСотрудников));
	
КонецПроцедуры

Процедура СохраненныеНастройкиВРеквизитыФормыНачальнаяНастройкаПрограммы(Форма, СохраненныеНастройки) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Если СохраненныеНастройки.Свойство("НастройкиСамообслуживанияСотрудников") Тогда
		ЗаполнитьЗначенияСвойств(Форма["НастройкиСамообслуживанияСотрудников"], СохраненныеНастройки["НастройкиСамообслуживанияСотрудников"]);
	КонецЕсли;
	
КонецПроцедуры

Процедура НастройкиПрограммыВРеквизитыФормы(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиСамообслуживанияСотрудников);
	ЗаполнитьЗначенияСвойств(Форма.НастройкиСамообслуживанияСотрудников, НастройкиСтруктура);
	
КонецПроцедуры

Процедура ПолучитьНастройкиПрограммы(НастройкиПрограммы) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьМенеджерЗаписи();
	Настройки.Прочитать();
	НастройкиСтруктура = ОбщегоНазначения.СтруктураПоМенеджеруЗаписи(Настройки, Метаданные.РегистрыСведений.НастройкиСамообслуживанияСотрудников);
	НастройкиПрограммы.Вставить("НастройкиСамообслуживанияСотрудников", НастройкиСтруктура);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиНачальнаяНастройкаПрограммы(Параметры) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьЗарплатаКадрыКорпоративнаяПодсистемы") Тогда
		Возврат;
	КонецЕсли;
	
	Настройки = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Настройки, Параметры.НастройкиСамообслуживанияСотрудников);
	Настройки.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
