#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение
//
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Справочник.ИсточникиИнформацииОКандидатах КАК ИсточникиИнформацииОКандидатах
	|ГДЕ
	|	НЕ ИсточникиИнформацииОКандидатах.Предопределенный");
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникиИнформации = Новый Массив;
	ИсточникиИнформации.Добавить(НСтр("ru = 'Приведи друга'"));
	ИсточникиИнформации.Добавить(НСтр("ru = 'Кадровое агентство'"));
	
	Для Каждого Источник Из ИсточникиИнформации Цикл
		НовыйЭлемент = Справочники.ИсточникиИнформацииОКандидатах.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Источник;
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли