////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетВызовСервера: методы кадрового учета, работающие на стороне сервера.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ФормированиеПредставленийЭлементовСправочникаСотрудники

Процедура ОбработкаПолученияПолейПредставленияСотрудников(Поля, СтандартнаяОбработка) Экспорт
	
	КадровыйУчетВнутренний.ОбработкаПолученияПолейПредставленияСотрудников(Поля, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставленияСотрудника(Данные, Представление, СтандартнаяОбработка) Экспорт
	
	КадровыйУчетВнутренний.ОбработкаПолученияПредставленияСотрудника(Данные, Представление, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
