#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ОбъектПоИдентификатору(Идентификатор) Экспорт
	
	Объект = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИдентификаторыEStaff.ИдентификаторОбъекта КАК Идентификатор,
	|	ИдентификаторыEStaff.ОбъектСсылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ИдентификаторыEStaff КАК ИдентификаторыEStaff
	|ГДЕ
	|	ИдентификаторыEStaff.ИдентификаторОбъекта = &Идентификатор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

#КонецОбласти

#КонецЕсли