////////////////////////////////////////////////////////////////////////////////
// Подсистема "Займы сотрудникам".
// Процедуры и функции, предназначенные для обслуживания выданных сотрудникам займов.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Открывает документ выдачи займа по договору.
//
Процедура ОткрытьДокументВыдачиЗайма(Форма, ДокументыВыдачиЗайма) Экспорт 
	
	ДокументВыдачиЗайма = ?(ДокументыВыдачиЗайма.Количество() = 0, Неопределено, ДокументыВыдачиЗайма[0].Значение);
	ПараметрыФормы = Новый Структура("Ключ", ДокументВыдачиЗайма);
	ОткрытьФорму("Документ.ВыдачаЗаймаСотруднику.ФормаОбъекта", ПараметрыФормы, Форма);
	
КонецПроцедуры

// Открывает список документов выдачи займа по договору.
//
Процедура ОткрытьСписокДокументовВыдачиЗайма(Форма) Экспорт
	
	Отбор = Новый Структура("ДоговорЗайма, Проведен", Форма.Объект.Ссылка, Истина);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("Документ.ВыдачаЗаймаСотруднику.ФормаСписка", ПараметрыФормы, Форма);
	
КонецПроцедуры

#КонецОбласти