#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Выполняет поиск документа по переданному контексту
//
Функция НайтиПоКонтексту(Знач ЭлектронныйКурс, Знач Контекст, Знач Учащийся) Экспорт
	
	// Делаем проверки
	
	Если НЕ ЗначениеЗаполнено(Контекст) ИЛИ НЕ ЗначениеЗаполнено(Учащийся) ИЛИ НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		ВызватьИсключение НСтр("ru = 'Контекст поиска документа изучения электронного курса не задан'");
	КонецЕсли;		
	
	// Ищем документ изучения электронного курса по контексту
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ИзучениеЭлектронногоКурса.Ссылка КАК ИзучениеЭлектронногоКурса
		|ИЗ
		|	Документ.ИзучениеЭлектронногоКурса КАК ИзучениеЭлектронногоКурса
		|ГДЕ
		|	ИзучениеЭлектронногоКурса.ЭлектронныйКурс = &ЭлектронныйКурс
		|	И ИзучениеЭлектронногоКурса.Учащийся = &Учащийся
		|	И ИзучениеЭлектронногоКурса.Контекст = &Контекст
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИзучениеЭлектронногоКурса.Дата УБЫВ";		
	
	Запрос.УстановитьПараметр("ЭлектронныйКурс", ЭлектронныйКурс);	
	Запрос.УстановитьПараметр("Контекст", Контекст);	
	Запрос.УстановитьПараметр("Учащийся", Учащийся);			
	
	УстановитьПривилегированныйРежим(Истина); // Для доступа учащимся

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();		
		
		Возврат ВыборкаДетальныеЗаписи.ИзучениеЭлектронногоКурса;
		
	КонецЕсли;	
	
КонецФункции

Функция ДанныеОбИзучении(ИзучениеЭлектронногоКурса) Экспорт
	
	Возврат ИзучениеЭлектронныхКурсовСлужебный.ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса);
	
КонецФункции

Функция ПрогрессИзучения(ИзучениеЭлектронногоКурса) Экспорт
	
	Возврат ДанныеОбИзучении(ИзучениеЭлектронногоКурса).ИзученоВПроцентах;
	
КонецФункции

Функция РезультатИзучения(ИзучениеЭлектронногоКурса) Экспорт
	
	Возврат ДанныеОбИзучении(ИзучениеЭлектронногоКурса).Результат;
	
КонецФункции

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
