#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализМассовогоНабораПерсонала");
	НастройкиВарианта.Описание = НСтр("ru = 'Динамика показателей массового набора персонала по месяцам. 
                                       |Отображаются количество вакантных ставок, ставки по плану и фактически занятые ставки.'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СравнениеМассовогоНабораПоГодам");
	НастройкиВарианта.Описание = НСтр("ru = 'Диаграмма показателей массового набора по месяцам разных годов. 
                                       |Выполняется для сравнения ситуации с учетом сезонности, например.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли

