
&НаКлиенте
Процедура Ок(Команда)
	Результат = Новый Массив;
	Для Каждого СтрокаТаблицы Из ШаблонЗаполнения Цикл
		Результат.Добавить(СтрокаТаблицы.Смена);
	КонецЦикла;	
	
	Закрыть(Результат);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ШаблонЗаполнения <> Неопределено Тогда
		Для Каждого Смена Из Параметры.ШаблонЗаполнения Цикл
			СтрокаТаблицы = ШаблонЗаполнения.Добавить();
			СтрокаТаблицы.Смена = Смена;
		КонецЦикла;
	КонецЕсли;
	
	РежимРаботы = Параметры.РежимРаботы;
КонецПроцедуры

&НаКлиенте
Процедура ШаблонЗаполненияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		Элементы.ШаблонЗаполнения.ТекущиеДанные.НомерДня = ШаблонЗаполнения.Количество();
	КонецЕсли;	
КонецПроцедуры
