////////////////////////////////////////////////////////////////////////////////
// Подсистема "Охрана труда"
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

#Область СпециальнаяОценкаУсловийТруда

Процедура УстановитьДоступностьЭлементовФормыПозицииШтатногоРасписания(Форма) Экспорт
	
	ИспользоватьСпециальнуюОценкуУсловийТруда = Форма.ИспользоватьСпециальнуюОценкуУсловийТруда;
	
	ГруппаСпецоценкаУсловийТрудаКлассыУсловийТрудаТолькоПросмотр = ОбщегоНазначенияКлиентСервер.ЗначениеСвойстваЭлементаФормы(Форма.Элементы, "ГруппаСпецоценкаУсловийТрудаКлассыУсловийТруда", "ТолькоПросмотр");
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаСпецоценкаУсловийТрудаКлассыУсловийТруда", "ТолькоПросмотр", ИспользоватьСпециальнуюОценкуУсловийТруда Или ГруппаСпецоценкаУсловийТрудаКлассыУсловийТрудаТолькоПросмотр);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ГруппаСпецоценкаУсловийТрудаДополнительно", "Видимость", ИспользоватьСпециальнуюОценкуУсловийТруда);
	
КонецПроцедуры

#КонецОбласти

#Область Периодичность

Функция ПроизвольноеЗначениеСпискаВыбораПериодов(Форма) Экспорт
	Возврат Форма.ПроизвольноеЗначениеСпискаВыбора;
КонецФункции

Функция СтруктураПериодаПоПредставлению(Форма, ПериодСтрокой) Экспорт
	
	СтруктураПериода = Неопределено;
	Если ПериодСтрокой = Форма.ПроизвольноеЗначениеСпискаВыбора Тогда
		Возврат СтруктураПериода;
	КонецЕсли;
	
	Для Каждого ЗначениеСписка Из Форма.СписокВыбораПериодов Цикл
		Если ЗначениеСписка.Представление = ПериодСтрокой Тогда
			СтруктураПериода = ЗначениеСписка.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураПериода;
	
КонецФункции

#КонецОбласти

Процедура ДополнитьОписаниеДополнительнойФормыСотрудника(ОписаниеФормы, ИмяОткрываемойФормы, СтандартнаяОбработка) Экспорт
	
	Если ИмяОткрываемойФормы = "ОбщаяФорма.СотрудникиОхранаТруда" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("СотрудникСсылка");
		ОписаниеФормы.КлючевыеРеквизиты.Вставить("Заголовок", "Сотрудник.Наименование");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

