#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение() Экспорт 
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.ВидыОперацийРасчетаЗарплаты КАК ВидыОперацийРасчетаЗарплаты";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ВидОперации = Справочники.ВидыОперацийРасчетаЗарплаты.СоздатьЭлемент();
	ВидОперации.Наименование = НСтр("ru = 'Расчет начислений'");
	ВидОперации.Начисление = Истина;
	ВидОперации.Договоры = Истина;
	ВидОперации.Пособия = Истина;
	ВидОперации.Льготы = Истина;
	ВидОперации.Записать();
	
	ВидОперации = Справочники.ВидыОперацийРасчетаЗарплаты.СоздатьЭлемент();
	ВидОперации.Наименование = НСтр("ru = 'Расчет удержаний'");
	ВидОперации.Удержания = Истина;
	ВидОперации.НДФЛ = Истина;
	ВидОперации.Займы = Истина;
	ВидОперации.Записать();
	
	ВидОперации = Справочники.ВидыОперацийРасчетаЗарплаты.СоздатьЭлемент();
	ВидОперации.Наименование = НСтр("ru = 'Начисление взносов'");
	ВидОперации.Взносы = Истина;
	ВидОперации.Записать();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли	