
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПриЗаписи(Отказ)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
	   Возврат;
	КонецЕсли; 	
	
	Если ЭтотОбъект.Значение Тогда
		
		Справочники.ВидыВыплатБывшимСотрудникам.СоздатьВидыВыплатБывшимСотрудникамПоНастройкам();
		
	Иначе
		
		Настройки = РегистрыСведений.НастройкиРасчетаЗарплатыРасширенный.СоздатьМенеджерЗаписи();
		Настройки.Прочитать();
		Настройки.ИспользоватьДоплатуДоСохраняемогоДенежногоСодержанияЗаДниБолезни = Ложь;
		Настройки.Записать();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
