#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ПозицияШтатногоРасписания) Тогда
		
		ПозицияШтатногоРасписания = Параметры.ПозицияШтатногоРасписания;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ИсторияИзменения,
			"ПозицияШтатногоРасписания",
			ПозицияШтатногоРасписания)
		
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыИсторияИзменения

&НаКлиенте
Процедура ИсторияИзмененияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуДокументаИзменившегоПозициюЗавершение", ЭтотОбъект);
		УправлениеШтатнымРасписаниемКлиент.ОткрытьФормуДокументаИзменившегоПозицию(Элемент.ТекущиеДанные.Регистратор, ПозицияШтатногоРасписания, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуДокументаИзменившегоПозициюЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

#КонецОбласти
