#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ВзаиморасчетыПоПрочимДоходамВызовСервера.СпособыВыплатыПрочихДоходовОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры
	
#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Формируется массив доступных способов выплаты.
//
Функция ДоступныеСпособыВыплаты() Экспорт
	
	СпособыВыплаты = Новый Массив;
	СпособыВыплаты.Добавить(Перечисления.СпособыВыплатыПрочихДоходов.ВыплатыБывшимСотрудникам);
	СпособыВыплаты.Добавить(Перечисления.СпособыВыплатыПрочихДоходов.ВыплатаПрочихДоходов);
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.Дивиденды") Тогда
		СпособыВыплаты.Добавить(Перечисления.СпособыВыплатыПрочихДоходов.Дивиденды);
		СпособыВыплаты.Добавить(Перечисления.СпособыВыплатыПрочихДоходов.ДивидендыСотрудникам);
	КонецЕсли;
	
	Возврат СпособыВыплаты;
	
КонецФункции

#КонецОбласти

#КонецЕсли