
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ВоинскийУчет);
	Заголовок = Строка(ФизическоеЛицо);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВоинскийУчет = Новый Структура("ФизическоеЛицо, Звание, Состав, ВУС, Годность, НаличиеМобпредписания, НомерКомандыПартии");
	ЗаполнитьЗначенияСвойств(ВоинскийУчет, ЭтотОбъект);
	Оповестить("ИзмененыДанныеВоинскогоУчета", ВоинскийУчет, ЭтотОбъект.ВладелецФормы);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)

	Закрыть();
	
КонецПроцедуры

#КонецОбласти
