////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПлатежноеПоручениеОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	ВзаиморасчетыССотрудникамиВХОКлиентРасширенный.ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

Процедура ПослеОтправкиВБанк(Форма) Экспорт
	ВзаиморасчетыССотрудникамиВХОКлиентРасширенный.ПослеОтправкиВБанк(Форма);
КонецПроцедуры

Процедура ОбработчикОжиданияПослеОтправкиВБанк(Форма) Экспорт
	ВзаиморасчетыССотрудникамиВХОКлиентРасширенный.ОбработчикОжиданияПослеОтправкиВБанк(Форма);
КонецПроцедуры

#КонецОбласти
