////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ДополнитьТаблицуФизическиеЛицаПоВедомостям(ФизическиеЛица, ВедомостиДокумента) Экспорт
	
	ВзаиморасчетыССотрудникамиВХОРасширенный.ДополнитьТаблицуФизическиеЛицаПоВедомостям(ФизическиеЛица, ВедомостиДокумента);
	
КонецПроцедуры


#КонецОбласти
