
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
				
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ХарактеристикаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
				Список, "Ключи.ХарактеристикаПерсонала", Характеристика, ВидСравненияКомпоновкиДанных.Равно,, Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИзБиблиотеки(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипВопроса") И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЭлементОтбора.Использование = Истина Тогда
			
			ДополнительныеПараметры.Вставить("ОтборТипВопроса", ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(Характеристика) Тогда
		ДополнительныеПараметры.Вставить("Характеристика", Характеристика);
	КонецЕсли;
	ОткрытьФорму("Справочник.ВопросыДляСобеседования.Форма.БиблиотекаВопросовДляСобеседования", ДополнительныеПараметры, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти

