
#Область СлужебныйПрограммныйИнтерфейс

// Предназначена для использования в ОбщегоНазначенияПереопределяемый.ЗаполнитьТаблицуПереименованияОбъектовМетаданных.
//
// Заполняет переименования тех объектов метаданных, которые невозможно
// автоматически найти по типу, но ссылки на которые требуется сохранять
// в базе данных (например: подсистемы, роли).
//
// Подробнее: см. ОбщегоНазначения.ДобавитьПереименование().
//
Процедура ЗаполнитьТаблицуПереименованияОбъектовМетаданных(Итог) Экспорт
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.0.5.7",
		"Роль.ДобавлениеИзменениеДокументовОбменаСБанкамиПоЗарплатнымПроектам",
		"Роль.ДобавлениеИзменениеОбменаСБанкамиПоЗарплатнымПроектам",
		"ЗарплатаКадрыБазовая");
		
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.0.5.7",
		"Роль.ЧтениеДокументовОбменаСБанкамиПоЗарплатнымПроектам",
		"Роль.ЧтениеОбменаСБанкамиПоЗарплатнымПроектам",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.0.18.7",
		"Роль.ДобавлениеИзменениеКадровогоСостояния",
		"Роль.ДобавлениеИзменениеДокументовЗарплатаКадры",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.0.18.7",
		"Роль.ЧтениеКадровогоСостояния",
		"Роль.ЧтениеДокументовЗарплатаКадры",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.4.83",
		"Подсистема.ЗарплатаКадрыПодсистемы.Подсистема.УчетПособийСоциальногоСтрахования",
		"Подсистема.ЗарплатаКадрыПодсистемы.Подсистема.ПособияСоциальногоСтрахования",
		"ЗарплатаКадрыБазовая");
	
	ОбщегоНазначения.ДобавитьПереименование(Итог,
		"3.1.4.83",
		"Подсистема.ЗарплатаКадрыПодсистемы.Подсистема.ПособияСоциальногоСтрахования.Подсистема.ПрямыеВыплатыПособийСоциальногоСтрахования",
		"Подсистема.ЗарплатаКадрыПодсистемы.Подсистема.ПособияСоциальногоСтрахования.Подсистема.ПрямыеВыплаты",
		"ЗарплатаКадрыБазовая");
	
КонецПроцедуры

Функция ОтветственныеЛицаОрганизации(Организация, Сведения, ДатаСведений) Экспорт
	
	ОтветственныеЛица = Новый Структура();
	ОтветственныеЛица.Вставить("Руководитель", Справочники.ФизическиеЛица.ПустаяСсылка());
	ОтветственныеЛица.Вставить("ДолжностьРуководителя", Справочники.Должности.ПустаяСсылка());
	ОтветственныеЛица.Вставить("ГлавныйБухгалтер", Справочники.ФизическиеЛица.ПустаяСсылка());
	ОтветственныеЛица.Вставить("Кассир", Справочники.ФизическиеЛица.ПустаяСсылка());
	ОтветственныеЛица.Вставить("ДолжностьКассира", Справочники.Должности.ПустаяСсылка());
	
	Возврат ОтветственныеЛица;
	
КонецФункции

Функция УсловияЗапросаПроверкиНеобходимостиЗаполненияПодчиненныхПодразделений(Запрос, ИсточникДанных) Экспорт
	
	ВыполняетсяЗаписьОрганизации = (ТипЗнч(ИсточникДанных.Ссылка) = Тип("СправочникСсылка.Организации"));
	
	СписокУсловий = Новый Массив;
	
	СписокУсловий.Добавить("ПодразделенияОрганизаций.РайонныйКоэффициент <> &РайонныйКоэффициент");
	Запрос.УстановитьПараметр("РайонныйКоэффициент", ИсточникДанных.РайонныйКоэффициент);
	
	СписокУсловий.Добавить("ПодразделенияОрганизаций.РегистрацияВНалоговомОргане <> &РегистрацияВНалоговомОргане");
	Запрос.УстановитьПараметр("РегистрацияВНалоговомОргане", ИсточникДанных.РегистрацияВНалоговомОргане);
	
	СписокУсловий.Добавить("ПодразделенияОрганизаций.РайонныйКоэффициентРФ <> &РайонныйКоэффициентРФ");
	Запрос.УстановитьПараметр("РайонныйКоэффициентРФ", ИсточникДанных.РайонныйКоэффициентРФ);
	
	Если НЕ ВыполняетсяЗаписьОрганизации Тогда
		СписокУсловий.Добавить("&СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов И НЕ ПодразделенияОрганизаций.СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов");
		Запрос.УстановитьПараметр("СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов", ИсточникДанных.СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов);
	КонецЕсли;
	
	Возврат СписокУсловий;

КонецФункции

Процедура ЗаполнитьПодчиненноеПодразделение(ПодразделениеОбъект, ИсточникДанных) Экспорт
	
	ВыполняетсяЗаписьОрганизации = (ТипЗнч(ИсточникДанных.Ссылка) = Тип("СправочникСсылка.Организации"));
	
	ПодразделениеОбъект.РайонныйКоэффициент = ИсточникДанных.РайонныйКоэффициент;
	ПодразделениеОбъект.РайонныйКоэффициентРФ = ИсточникДанных.РайонныйКоэффициентРФ;
		
	ПодразделениеОбъект.РегистрацияВНалоговомОргане = ИсточникДанных.РегистрацияВНалоговомОргане;
	
	Если НЕ ВыполняетсяЗаписьОрганизации Тогда
		ПодразделениеОбъект.СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов = ИсточникДанных.СоответствуетСудамЗарегистрированнымВРоссийскомМеждународномРеестреСудов;
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоОбъектЗарплатноКадровойБиблиотеки(ПолноеИмяОбъектаМетаданных) Экспорт
	
	Возврат ЗарплатаКадры.ОбъектМетаданныхВключенВПодсистемы(ПолноеИмяОбъектаМетаданных, "ЗарплатаКадрыПриложения,ЗарплатаКадрыПодсистемы");
	
КонецФункции

Функция ЭтоБазоваяВерсияКонфигурации() Экспорт
	Возврат СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации();
КонецФункции

// См. ЗарплатаКадры.ИспользуетсяУчетХозрасчетныхОрганизаций.
Функция ИспользуетсяУчетХозрасчетныхОрганизаций() Экспорт
	Возврат Истина;
КонецФункции

// См. ЗарплатаКадры.ИспользуютсяДокументыОплатыВедомостей.
Функция ИспользуютсяДокументыОплатыВедомостей() Экспорт
	Возврат Истина;
КонецФункции

Функция ПоддерживаемыеИдентификаторыОтветственныхРаботниковОрганизаций() Экспорт
	
	ПоддерживаемыеИдентификаторы = Новый Массив;
	
	ПоддерживаемыеИдентификаторы.Добавить("Исполнитель");
	ПоддерживаемыеИдентификаторы.Добавить("ДолжностьИсполнителя");
	ПоддерживаемыеИдентификаторы.Добавить("ДолжностьИсполнителяСтрокой");
	
	Возврат ПоддерживаемыеИдентификаторы;
	
КонецФункции

// Формирует таблицу значений с параметрами отпусков сотрудника для расчета оценочных обязательств
//	Параметры
//		МассивСотрудников
//		Период - месяц, для которого рассчитываются обязательства
//	Возвращаемое значение Таблица значений
//			* Сотрудник
//			* ОстатокОтпусков
//			* ОтпускАвансом
//			* СреднийЗаработок
//
Функция СведенияОбОтпускахСотрудниковДляРасчетаОценочныхОбязательств(МассивСотрудников, Период) Экспорт

	ТаблицаСведенийОбОтпусках = ЗарплатаКадры.НоваяТаблицаСведенияОбОтпускахСотрудниковДляРасчетаОценочныхОбязательств();
	
	ДатаРасчетаСреднего = НачалоМесяца(ДобавитьМесяц(Период, 1));
	
	Для каждого Сотрудник Из МассивСотрудников Цикл
	
		НоваяСтрока = ТаблицаСведенийОбОтпусках.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
		НоваяСтрока.СреднийЗаработок = СреднийЗаработокОбщийСотрудника(Сотрудник, ДатаРасчетаСреднего);
	
	КонецЦикла;
	
	Возврат ТаблицаСведенийОбОтпусках;

КонецФункции

// Выполняет расчет среднего заработка общего сотрудника на дату
Функция СреднийЗаработокОбщийСотрудника(Сотрудник, ДатаНачалаСобытия)

	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РасчетЗарплатыДляНебольшихОрганизаций") Тогда
		МодульРасчетЗарплатыДляНебольшихОрганизаций = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
	Иначе
		Возврат 0;
	КонецЕсли;
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудник, "ДатаПриема");
	Если КадровыеДанные.Количество() = 0 Тогда
		// Сотрудник не принят на работу.
		Возврат 0;
	Иначе
		Если ЗначениеЗаполнено(КадровыеДанные[0].ДатаПриема) И КадровыеДанные[0].ДатаПриема > ДатаНачалаСобытия Тогда
			// Дата начала события раньше, чем сотрудник принят на работу.
			Возврат 0;
		КонецЕсли;
	КонецЕсли;
	
	ДатаПриемаНаРаботу = КадровыеДанные[0].ДатаПриема;
	
	НачалоПериода = ДобавитьМесяц(НачалоМесяца(ДатаНачалаСобытия), -12);
	НачалоПериода = Макс(НачалоПериода, НачалоМесяца(ДатаПриемаНаРаботу));
	
	ОкончаниеПериода = НачалоМесяца(ДатаНачалаСобытия) - 1;
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник, "ГоловнаяОрганизация");
	
	ДанныеДляРасчета = МодульРасчетЗарплатыДляНебольшихОрганизаций.ДанныеДляРасчетаОбщегоСреднегоЗаработкаСотрудника(Сотрудник, Организация, НачалоПериода, ОкончаниеПериода);
	
	ОтработанноеВремяДляСреднегоОбщий = Новый ТаблицаЗначений; 
	ОтработанноеВремяДляСреднегоОбщий.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	ОтработанноеВремяДляСреднегоОбщий.Колонки.Добавить("ОтработаноДнейКалендарных", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(7, 2)));
	ОтработанноеВремяДляСреднегоОбщий.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Для каждого ДанныеОВремени Из ДанныеДляРасчета.ДанныеОВремени Цикл
		СтрокаДанныхОВремени = ОтработанноеВремяДляСреднегоОбщий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныхОВремени, ДанныеОВремени);
		СтрокаДанныхОВремени.Сотрудник = Сотрудник;
	КонецЦикла;
	
	СреднийЗаработокОбщий = Новый ТаблицаЗначений; 
	СреднийЗаработокОбщий.Колонки.Добавить("Сотрудник", Новый ОписаниеТипов("СправочникСсылка.Сотрудники"));
	СреднийЗаработокОбщий.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
	СреднийЗаработокОбщий.Колонки.Добавить("Период", Новый ОписаниеТипов("Дата"));
	
	Для каждого ДанныеОНачислениях Из ДанныеДляРасчета.ДанныеОНачислениях Цикл
		СтрокаДанныеОНачислениях = СреднийЗаработокОбщий.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДанныеОНачислениях, ДанныеОНачислениях);
		СтрокаДанныеОНачислениях.Сотрудник = Сотрудник;
	КонецЦикла;
	
	ТаблицыПоСотруднику = Новый Структура;
	ТаблицыПоСотруднику.Вставить("ДанныеОНачислениях", СреднийЗаработокОбщий);
	ТаблицыПоСотруднику.Вставить("ДанныеОВремени", ОтработанноеВремяДляСреднегоОбщий);
	
	ПараметрыПолученияДанныхСреднего = МодульРасчетЗарплатыДляНебольшихОрганизаций.ПараметрыПолученияДанныхСреднегоОбщего();
	ПараметрыПолученияДанныхСреднего.Вставить("ТаблицыПоСотруднику", 	ТаблицыПоСотруднику); 
	ПараметрыПолученияДанныхСреднего.Вставить("ДатаНачалаПериода",  	НачалоПериода); 
	ПараметрыПолученияДанныхСреднего.Вставить("ДатаОкончанияПериода",	ОкончаниеПериода); 
	ПараметрыПолученияДанныхСреднего.Вставить("ДатаНачалаСобытия", 		ДатаНачалаСобытия);		
	
	ДанныеРасчетаСреднегоЗаработка = МодульРасчетЗарплатыДляНебольшихОрганизаций.ДанныеРасчетаСреднегоЗаработкаОбщего(ПараметрыПолученияДанныхСреднего);
	
	Возврат ДанныеРасчетаСреднегоЗаработка.Итоги.СреднедневнойЗаработок;	

КонецФункции

// Получает информацию о виде расчета.
Функция ПолучитьИнформациюОВидеРасчета(ВидРасчета) Экспорт
	
	ЗапрашиваемыеДанныеСтрока =	"КатегорияНачисленияИлиНеоплаченногоВремени";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	#ЗапрашиваемыеДанные
	|ИЗ
	|	ПланВидовРасчета.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка = &Ссылка";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ЗапрашиваемыеДанные", ЗапрашиваемыеДанныеСтрока);

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ВидРасчета);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ЗначенияРеквизитов = Новый Структура(ЗапрашиваемыеДанныеСтрока);
	ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Выборка);
	
	Возврат ЗначенияРеквизитов;
	
КонецФункции

#Область БлокФункцийПолученияЗначенийПоУмолчанию

Процедура ПолучитьЗначенияПоУмолчанию(ЗаполняемыеЗначения, ДатаЗначений) Экспорт
	
	Если ЗаполняемыеЗначения.Свойство("Год") Тогда
		ЗаполняемыеЗначения.Год = Год(ДатаЗначений);
	КонецЕсли;
	Если ЗаполняемыеЗначения.Свойство("Месяц") Тогда
		ЗаполняемыеЗначения.Месяц = НачалоМесяца(ДатаЗначений);
	КонецЕсли;
		Если ЗаполняемыеЗначения.Свойство("Квартал") Тогда
		ЗаполняемыеЗначения.Квартал = НачалоКвартала(ДатаЗначений);
	КонецЕсли;
	Если ЗаполняемыеЗначения.Свойство("ПредыдущийГод") Тогда
		ЗаполняемыеЗначения.ПредыдущийГод = Год(ДатаЗначений) - 1;
	КонецЕсли;
	Если ЗаполняемыеЗначения.Свойство("ПредыдущийМесяц") Тогда
		ЗаполняемыеЗначения.ПредыдущийМесяц = НачалоМесяца(НачалоМесяца(ДатаЗначений) - 1);
	КонецЕсли;
	Если ЗаполняемыеЗначения.Свойство("ПредыдущийКвартал") Тогда
		ЗаполняемыеЗначения.ПредыдущийКвартал = НачалоКвартала(НачалоКвартала(ДатаЗначений) - 1);
	КонецЕсли;
	Если ЗаполняемыеЗначения.Свойство("ДатаСобытия") Тогда
		ЗаполняемыеЗначения.ДатаСобытия = ДатаЗначений;
	КонецЕсли;
	Если ЗаполняемыеЗначения.Свойство("Ответственный") Тогда
		ЗаполняемыеЗначения.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Значение организации известно - получим зависящие от нее значения.
	ОрганизацияСсылка = НеОпределено;
	Если (ЗаполняемыеЗначения.Свойство("Организация", ОрганизацияСсылка) И ОрганизацияСсылка <> НеОпределено) Тогда
		
		Если ЗаполняемыеЗначения.Свойство("НаименованиеПФР") Тогда
			НаименованиеПФР = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияСсылка, "НаименованиеТерриториальногоОрганаПФР");
			ЗаполняемыеЗначения.НаименованиеПФР = ?(НаименованиеПФР = Неопределено, "", НаименованиеПФР);
		КонецЕсли;
		
		Если ЗаполняемыеЗначения.Свойство("НаименованиеТерриториальногоОрганаФСС") Тогда
			НаименованиеТерриториальногоОрганаФСС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОрганизацияСсылка, "НаименованиеТерриториальногоОрганаФСС");
			ЗаполняемыеЗначения.НаименованиеТерриториальногоОрганаФСС = ?(НаименованиеТерриториальногоОрганаФСС = Неопределено, "", НаименованиеТерриториальногоОрганаФСС);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("Организация") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["Организация"]) Тогда
		ЗаполняемыеЗначения.Организация = Справочники.Организации.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("Подразделение") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["Подразделение"]) Тогда
		ЗаполняемыеЗначения.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("ГруппаДоступа") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["ГруппаДоступа"]) Тогда
		ЗаполняемыеЗначения.ГруппаДоступа = Справочники.ГруппыДоступаФизическихЛиц.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("Руководитель") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["Руководитель"]) Тогда
		ЗаполняемыеЗначения.Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("ДолжностьРуководителя") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["ДолжностьРуководителя"]) Тогда
		ЗаполняемыеЗначения.ДолжностьРуководителя = Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("ГлавныйБухгалтер") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["ГлавныйБухгалтер"]) Тогда
		ЗаполняемыеЗначения.ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("Кассир") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["Кассир"]) Тогда
		ЗаполняемыеЗначения.Кассир = Справочники.ФизическиеЛица.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗаполняемыеЗначения.Свойство("ДолжностьКассира") И НЕ ЗначениеЗаполнено(ЗаполняемыеЗначения["ДолжностьКассира"]) Тогда
		ЗаполняемыеЗначения.ДолжностьКассира = Справочники.Должности.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

// Массив поддерживаемых идентификаторов значений по умолчанию.
Функция СписокДоступныхЗначенийПоУмолчанию() Экспорт
	ПоддерживаемыеИдентификаторы = Новый Массив();
	ПоддерживаемыеИдентификаторы.Добавить("Год");
	ПоддерживаемыеИдентификаторы.Добавить("Квартал");
	ПоддерживаемыеИдентификаторы.Добавить("Месяц");
	ПоддерживаемыеИдентификаторы.Добавить("ПредыдущийГод");
	ПоддерживаемыеИдентификаторы.Добавить("ПредыдущийМесяц");
	ПоддерживаемыеИдентификаторы.Добавить("ПредыдущийКвартал");
	ПоддерживаемыеИдентификаторы.Добавить("ДатаСобытия");
	ПоддерживаемыеИдентификаторы.Добавить("Ответственный");
	ПоддерживаемыеИдентификаторы.Добавить("НаименованиеПФР");
	ПоддерживаемыеИдентификаторы.Добавить("НаименованиеТерриториальногоОрганаФСС");
	ПоддерживаемыеИдентификаторы.Добавить("Организация");
	ПоддерживаемыеИдентификаторы.Добавить("Руководитель");
	ПоддерживаемыеИдентификаторы.Добавить("ДолжностьРуководителя");
	ПоддерживаемыеИдентификаторы.Добавить("ГлавныйБухгалтер");
	ПоддерживаемыеИдентификаторы.Добавить("Кассир");
	ПоддерживаемыеИдентификаторы.Добавить("ДолжностьКассира");
	ПоддерживаемыеИдентификаторы.Добавить("Подразделение");
	ПоддерживаемыеИдентификаторы.Добавить("ГруппаДоступа");
	Возврат ПоддерживаемыеИдентификаторы;
	
КонецФункции

#КонецОбласти

#Область Пользователи

Процедура ПриОпределенииНазначенияРолей(НазначениеРолей) Экспорт
	НазначениеРолей.ТолькоДляПользователейСистемы.Добавить(Метаданные.Роли.НастройкаНалогиИВзносыОбщиеДанные.Имя);
	НазначениеРолей.ТолькоДляПользователейСистемы.Добавить(Метаданные.Роли.НастройкаНачисленияЗарплатыОбщиеДанные.Имя);
	НазначениеРолей.ТолькоДляПользователейСистемы.Добавить(Метаданные.Роли.НастройкаПерсУчетаОбщиеДанные.Имя);
КонецПроцедуры

#КонецОбласти

#Область ДатыЗапретаИзмененияДанных

// См. ДатыЗапретаИзмененияПереопределяемый.ПриЗаполненииРазделовДатЗапретаИзменения.
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	Раздел = Разделы.Добавить();
	Раздел.Имя           = "БухгалтерскийУчетЗарплаты";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("b2f888d2-9f43-44ea-a9f0-ea5a31df8205");
	Раздел.Представление = НСтр("ru = 'Бухгалтерский учет зарплаты'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
	Раздел = Разделы.Добавить();
	Раздел.Имя           = "Зарплата";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("d651f599-f0a4-4640-9de6-5bb1ee2d8e58");
	Раздел.Представление = НСтр("ru = 'Зарплата'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
	Раздел = Разделы.Добавить();
	Раздел.Имя           = "ВыплатаЗарплаты";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("ade6947c-1148-45ac-ac11-082c1cfd7f8e");
	Раздел.Представление = НСтр("ru = 'Выплата зарплаты'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
	Раздел = Разделы.Добавить();
	Раздел.Имя           = "КадровыйУчет";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("d9eb8add-a951-4377-b3b7-afdb4df84006");
	Раздел.Представление = НСтр("ru = 'Кадровый учет'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
	Раздел = Разделы.Добавить();
	Раздел.Имя           = "НДФЛ";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("3af3749a-c745-4487-adf2-8af2d67d9404");
	Раздел.Представление = НСтр("ru = 'НДФЛ'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	
	Раздел = Разделы.Добавить();
	Раздел.Имя           = "СтраховыеВзносы";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("c7546388-0906-4c52-b4fb-e65985234d0e");
	Раздел.Представление = НСтр("ru = 'Страховые взносы'");
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
КонецПроцедуры

// См. ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения.
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт
	
	// Раздел Зарплата
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.БольничныйЛист",                                        "ПериодРегистрации", "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов", "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение",          "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеСотрудникаНаВыплатуПособия",                   "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИсполнительныйЛист",                                    "ДатаДействия",      "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий",           "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НачислениеЗарплаты",                                    "МесяцНачисления",   "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий",             "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Отпуск",                                                "ПериодРегистрации", "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем",               "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий", "Дата",              "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МинимальнаяОплатаТрудаРФ",                       "Период",            "Зарплата", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПлановыеНачисления",                             "Период",            "Зарплата", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НачисленияУдержанияПоСотрудникам",             "Период",            "Зарплата", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОтработанноеВремяПоСотрудникам",               "Период",            "Зарплата", "Организация");
	
	// Раздел ВыплатаЗарплаты
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьНаВыплатуЗарплатыВБанк",                       "ПериодРегистрации", "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВедомостьНаВыплатуЗарплатыВКассу",                      "ПериодРегистрации", "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников",              "Дата",              "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников",              "Дата",              "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодтверждениеЗачисленияЗарплаты",                       "Дата",              "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников",         "Дата",              "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками",      "Период",            "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ВзаиморасчетыССотрудниками",                   "Период",            "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗарплатаКВыплате",                             "Период",            "ВыплатаЗарплаты",  "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ЗарплатаКВыплатеАвансом",                      "Период",            "ВыплатаЗарплаты",  "Организация");
	
	// Раздел БухгалтерскийУчетЗарплаты
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.БухучетЗарплатыОрганизаций", "Период",  "БухгалтерскийУчетЗарплаты", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.БухучетЗарплатыСотрудников", "Период",  "БухгалтерскийУчетЗарплаты", "Сотрудник.ГоловнаяОрганизация");
	
	// Раздел КадровыйУчет
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриемНаРаботу",                     "Дата",   "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КадровыйПеревод",                   "Дата",   "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Увольнение",                        "Дата",   "КадровыйУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ВидыЗанятостиСотрудников",	"Период",			"КадровыйУчет", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КадроваяИсторияСотрудников", "Период", "КадровыйУчет", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ГражданствоФизическихЛиц",   "Период", "КадровыйУчет", "");
	
	// Раздел НДФЛ
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратНДФЛ",                                              "Месяц",               "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ",        "Месяц",               "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ",         "Дата",                "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОперацияНалоговогоУчетаПоНДФЛ",                            "ДатаОперации",        "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АвансовыйПлатежИностранцаПоНДФЛ",                          "ДатаОперации",        "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПерерасчетНДФЛ",                                           "МесяцПерерасчета",    "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПрекращениеСтандартныхВычетовНДФЛ",                        "Месяц",               "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СправкиНДФЛДляПередачиВНалоговыйОрган",                    "Дата",				 "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ",             "ПрименятьВычетыС",    "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИсторияРегистрацийВНалоговомОргане",                "Период",              "НДФЛ", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИсторияРегистрацийВНалоговомОргане",                "Период",              "НДФЛ", "СтруктурнаяЕдиница.ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ",                "Период",              "НДФЛ", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтандартныеВычетыНаДетейНДФЛ",                      "МесяцРегистрации",    "НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ",                "Период",              "НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ",      "Период",              "НДФЛ", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ",               "Период",              "НДФЛ", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИмущественныеВычетыНДФЛ",                         "МесяцРегистрации",    "НДФЛ", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ", "Период",              "НДФЛ", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ",          "Период",              "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению",      "Период",              "НДФЛ", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ",        "Период",              "НДФЛ", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОДоходахНДФЛ",                            "Период",              "НДФЛ", "ГоловнаяОрганизация");
	
	// Раздел СтраховыеВзносы
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОперацияУчетаПоСтраховымВзносам",                           "МесяцРасчетногоПериода",   "СтраховыеВзносы", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктПроверкиСтраховыхВзносов",                               "ПериодРегистрации",        "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПерерасчетСтраховыхВзносов",                                "ПериодРегистрации",        "СтраховыеВзносы", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам", "ДатаРегистрацииИзменений", "СтраховыеВзносы", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КлассыУсловийТрудаПоДолжностям",                     "ДатаРегистрацииИзменений", "СтраховыеВзносы", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИсторияРегистрацийВОрганеПФР",                       "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтатусыЗастрахованныхФизическихЛиц",                 "ДатаРегистрацииИзменений", "СтраховыеВзносы", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПрименяемыеТарифыСтраховыхВзносов",                  "ДатаРегистрацииИзменений", "СтраховыеВзносы", "ГоловнаяОрганизация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СведенияОбИнвалидностиФизическихЛиц",                "ДатаРегистрацииИзменений", "СтраховыеВзносы", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев",       "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ТерриториальныеУсловияПФР",                          "Период",                   "СтраховыеВзносы", "СтруктурнаяЕдиница");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ТерриториальныеУсловияПФР",                          "Период",                   "СтраховыеВзносы", "СтруктурнаяЕдиница.Владелец");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИсчисленныеСтраховыеВзносы",                       "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СтраховыеВзносыПоФизическимЛицам",                 "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПособияПоСоциальномуСтрахованию",                  "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПособияПоУходуЗаРебенком",                         "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам",                "Период",                   "СтраховыеВзносы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СведенияОДоходахСтраховыеВзносы",                  "Период",                   "СтраховыеВзносы", "Организация");
	
	// Раздел ОбъектыБазовойРеализации
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ОбъектыБазовойРеализации") Тогда
		МодульОбъектыБазовойРеализации = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбъектыБазовойРеализации");
		МодульОбъектыБазовойРеализации.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	
	// Депоненты
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетДепонированнойЗарплаты") Тогда
		МодульУчетДепонированнойЗарплаты = ОбщегоНазначения.ОбщийМодуль("УчетДепонированнойЗарплаты");
		МодульУчетДепонированнойЗарплаты.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	
	// ВзаиморасчетыССотрудникамиВХО
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХО") Тогда
		МодульВзаиморасчеты = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыССотрудникамиВХО");
		МодульВзаиморасчеты.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	
	// ЗарплатаКадрыПриложения.БухучетХозрасчетныхОрганизаций
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.БухучетХозрасчетныхОрганизаций") Тогда
		МодульБухучетХозрасчетныхОрганизаций = ОбщегоНазначения.ОбщийМодуль("БухучетХозрасчетныхОрганизаций");
		МодульБухучетХозрасчетныхОрганизаций.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	
	// ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		МодульРезервОтпусков = ОбщегоНазначения.ОбщийМодуль("РезервОтпусков");
		МодульРезервОтпусков.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	
	// ЗарплатаКадрыПриложения.РегламентированнаяОтчетность
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РегламентированнаяОтчетность") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РегламентированнаяОтчетностьПриложения");
		Модуль.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрефиксацияСправочниковПоОрганизации

Процедура ПолучитьПрефиксообразующиеРеквизиты(Объекты) Экспорт
	
	СтрокаТаблицы = Объекты.Добавить();
	СтрокаТаблицы.Объект = Метаданные.Справочники.Сотрудники;
	СтрокаТаблицы.Реквизит = "ГоловнаяОрганизация";
	
КонецПроцедуры

#КонецОбласти

#Область ЗащитаПерсональныхДанных

// Процедура обеспечивает сбор сведений о хранении данных, 
// относящихся к персональным.
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации, 
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	// Заполнение таблицы сведений.
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Справочник.ФизическиеЛица";
	НовыеСведения.ПоляРегистрации	= "Ссылка,Наименование,ИНН,СтраховойНомерПФР";
	НовыеСведения.ПоляДоступа		= "КонтактнаяИнформация.ЗначенияПолей,КонтактнаяИнформация.Представление,КонтактнаяИнформация.Регион,КонтактнаяИнформация.Город,КонтактнаяИнформация.АдресЭП,КонтактнаяИнформация.НомерТелефона,КонтактнаяИнформация.НомерТелефонаБезКодов";
	НовыеСведения.ОбластьДанных		= "КонтактнаяИнформация";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Справочник.ФизическиеЛица";
	НовыеСведения.ПоляРегистрации	= "Ссылка,Наименование,ИНН,СтраховойНомерПФР";
	НовыеСведения.ПоляДоступа		= "ДатаРождения,Пол,МестоРождения,Наименование,ФИО,НаименованиеСлужебное";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Справочник.Сотрудники";
	НовыеСведения.ПоляРегистрации	= "Ссылка,ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Наименование";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.БольничныйЛист";
	НовыеСведения.ПоляРегистрации	= "Сотрудник,ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СреднийДневнойЗаработок,Начислено";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.БольничныйЛист";
	НовыеСведения.ПоляРегистрации	= "Начисления.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Начисления.Результат,Начисления.СуммаВычета";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ВедомостьНаВыплатуЗарплатыВБанк";
	НовыеСведения.ПоляРегистрации	= "Зарплата.Сотрудник";
	НовыеСведения.ПоляДоступа		= "СуммаПоДокументу,Зарплата.КВыплате,Зарплата.КомпенсацияЗаЗадержкуЗарплаты";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ВедомостьНаВыплатуЗарплатыВБанк";
	НовыеСведения.ПоляРегистрации	= "Зарплата.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Зарплата.НомерЛицевогоСчета";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ВедомостьНаВыплатуЗарплатыВКассу";
	НовыеСведения.ПоляРегистрации	= "Зарплата.Сотрудник";
	НовыеСведения.ПоляДоступа		= "СуммаПоДокументу,Зарплата.КВыплате,Зарплата.КомпенсацияЗаЗадержкуЗарплаты";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ЛицевойСчет,Сотрудники.ДатаЗакрытия";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СуммаПервоначальногоПополнения,Сотрудники.БонуснаяПрограмма,Сотрудники.НомерУчастникаБонуснойПрограммы,Сотрудники.АдресЭлектроннойПочты,Сотрудники.СчетДебета";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НомерМобильногоТелефона,Сотрудники.НомерМобильногоТелефонаПредставление,Сотрудники.ОператорСвязи,Сотрудники.КонтрольнаяИнформация";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НомерМиграционнойКарты,Сотрудники.ДатаНачалаПребыванияМиграционнойКарты,Сотрудники.ДатаОкончанияПребыванияМиграционнойКарты";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ВидМиграционногоДокумента,Сотрудники.НомерМиграционногоДокумента,Сотрудники.ДатаНачалаПребыванияМиграционногоДокумента,Сотрудники.ДатаОкончанияПребыванияМиграционногоДокумента";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ПрогнозируемыйМесячныйДоход,Сотрудники.КодВидаВклада,Сотрудники.КодПодвидаВклада";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДокументВид,Сотрудники.ДокументСерия,Сотрудники.ДокументНомер,Сотрудники.ДокументДатаВыдачи,Сотрудники.ДокументСрокДействия,Сотрудники.ДокументКемВыдан,Сотрудники.ДокументКодПодразделения,Сотрудники.ДокументПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.Пол,Сотрудники.ДатаРождения,Сотрудники.МестоРождения,Сотрудники.МестоРожденияПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.АдресДляИнформирования,Сотрудники.АдресДляИнформированияПредставление,Сотрудники.АдресПоПрописке,Сотрудники.АдресПоПропискеПредставление,Сотрудники.АдресМестаПроживания,Сотрудники.АдресМестаПроживанияПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо,Сотрудники.ЭмбоссированныйТекст1,Сотрудники.ЭмбоссированныйТекст2,Сотрудники.ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ТелефонДомашний,Сотрудники.ТелефонДомашнийПредставление,Сотрудники.ТелефонРабочий,Сотрудники.ТелефонРабочийПредставление,Сотрудники.ЯвляетсяРезидентом,Сотрудники.Гражданство,Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ИсполнительныйЛист";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Процент,Сумма,Числитель,Знаменатель";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.Отпуск";
	НовыеСведения.ПоляРегистрации	= "Сотрудник,ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "СреднийЗаработок,Начислено";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.Отпуск";
	НовыеСведения.ПоляРегистрации	= "Начисления.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Начисления.Результат,Начисления.СуммаВычета";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_1";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.АдресРегистрации,Сотрудники.АдресФактический,Сотрудники.Телефоны,Сотрудники.Пол,Сотрудники.ДатаРождения,Сотрудники.МестоРождения,Сотрудники.Гражданство";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияОЗастрахованныхЛицахСЗВ_М";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ИНН,Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_1";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ВидДокумента,Сотрудники.СерияДокумента,Сотрудники.НомерДокумента,Сотрудники.ДатаВыдачи,Сотрудники.КемВыдан,Сотрудники.АдресРегистрацииПредставление,Сотрудники.АдресФактическийПредставление,Сотрудники.МестоРожденияПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_2";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДатаПолученияСвидетельства,Сотрудники.СтраховойНомерПФРВСвидетельстве,Сотрудники.ФамилияВСвидетельстве,Сотрудники.ИмяВСвидетельстве,Сотрудники.ОтчествоВСвидетельстве";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_2";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.Пол,Сотрудники.ДатаРождения,Сотрудники.МестоРождения,Сотрудники.Гражданство,Сотрудники.АдресРегистрации,Сотрудники.АдресФактический,Сотрудники.Телефоны";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_2";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ВидДокумента,Сотрудники.СерияДокумента,Сотрудники.НомерДокумента,Сотрудники.ДатаВыдачи,Сотрудники.КемВыдан,Сотрудники.МестоРожденияПредставление,Сотрудники.АдресРегистрацииПредставление,Сотрудники.АдресФактическийПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДатаПолученияСвидетельства,Сотрудники.СтраховойНомерПФРВСвидетельстве,Сотрудники.ФамилияВСвидетельстве,Сотрудники.ИмяВСвидетельстве,Сотрудники.ОтчествоВСвидетельстве";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ПолВСвидетельстве,Сотрудники.ДатаРожденияВСвидетельстве,Сотрудники.МестоРожденияВСвидетельстве,Сотрудники.Пол,Сотрудники.МестоРождения,Сотрудники.Гражданство";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.АдресРегистрации,Сотрудники.АдресФактический,Сотрудники.Телефоны,Сотрудники.ВидДокумента,Сотрудники.СерияДокумента,Сотрудники.НомерДокумента,Сотрудники.ДатаВыдачи,Сотрудники.КемВыдан";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовАДВ_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.МестоРожденияВСвидетельствеПредставление,Сотрудники.МестоРожденияПредставление,Сотрудники.АдресРегистрацииПредставление,Сотрудники.АдресФактическийПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_1";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР,Сотрудники.АдресДляИнформирования,Сотрудники.АдресДляИнформированияПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_1";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НачисленоСтраховая,Сотрудники.УплаченоСтраховая,Сотрудники.НачисленоНакопительная,Сотрудники.УплаченоНакопительная,Сотрудники.ДоначисленоСтраховая,Сотрудники.ДоначисленоНакопительная,Сотрудники.ДоУплаченоНакопительная,Сотрудники.ДоУплаченоСтраховая";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_3";
	НовыеСведения.ПоляРегистрации	= "СведенияОЗаработке.Сотрудник";
	НовыеСведения.ПоляДоступа		= "СведенияОЗаработке.Заработок";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_4";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_4";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,СведенияОЗаработке.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НачисленоСтраховая,Сотрудники.УплаченоСтраховая,Сотрудники.НачисленоНакопительная,Сотрудники.УплаченоНакопительная";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_6_4";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,СведенияОЗаработке.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДоначисленоСтраховая,Сотрудники.ДоначисленоНакопительная,Сотрудники.ДоУплаченоНакопительная,Сотрудники.ДоУплаченоСтраховая,СведенияОЗаработке.Заработок";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСЗВ_К";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,СведенияДляОценкиПенсионныхПрав.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР,СведенияДляОценкиПенсионныхПрав.Лет,СведенияДляОценкиПенсионныхПрав.Месяцев,СведенияДляОценкиПенсионныхПрав.Дней";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСПВ_1";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПачкаДокументовСПВ_1";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НачисленоСтраховая,Сотрудники.УплаченоСтраховая,Сотрудники.НачисленоНакопительная,Сотрудники.УплаченоНакопительная";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПодтверждениеЗачисленияЗарплаты";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НомерЛицевогоСчета";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПодтверждениеЗачисленияЗарплаты";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Сотрудники.Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НомерЛицевогоСчета";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Сотрудники.Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.РеестрДСВ_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.СтраховойНомерПФР";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.РеестрДСВ_3";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ВзносыРаботника,Сотрудники.ВзносыРаботодателя";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.РеестрСЗВ_6_2";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.АдресДляИнформирования,Сотрудники.СтраховойНомерПФР,Сотрудники.АдресДляИнформированияПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.РеестрСЗВ_6_2";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.НачисленоСтраховая,Сотрудники.УплаченоСтраховая,Сотрудники.НачисленоНакопительная,Сотрудники.УплаченоНакопительная";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.РеестрСЗВ_6_2";
	НовыеСведения.ПоляРегистрации	= "Сотрудники.Сотрудник,Сотрудники.Фамилия,Сотрудники.Имя,Сотрудники.Отчество";
	НовыеСведения.ПоляДоступа		= "Сотрудники.ДоначисленоСтраховая,Сотрудники.ДоначисленоНакопительная,Сотрудники.ДоУплаченоНакопительная,Сотрудники.ДоУплаченоСтраховая";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.ВзаиморасчетыССотрудниками";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "СуммаВзаиморасчетов";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.ЗарплатаКВыплате";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "СуммаКВыплате";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.НачисленияУдержанияПоСотрудникам";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "Сумма";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.СтраховыеВзносыПереданныеВПФР";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Страховая,Накопительная,СтраховаяЧленамЭкипажейМорскихСудов,НакопительнаяЧленамЭкипажейМорскихСудов";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ГражданствоФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Страна";
	НовыеСведения.ОбластьДанных		= "ПаспортныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ДокументыФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "Физлицо";
	НовыеСведения.ПоляДоступа		= "Серия,Номер,ДатаВыдачи,СрокДействия,КемВыдан,КодПодразделения,Представление";
	НовыеСведения.ОбластьДанных		= "ПаспортныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "НомерЛицевогоСчета";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,ЭмбоссированныйТекст1,ЭмбоссированныйТекст2,ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "СуммаПервоначальногоПополнения,БонуснаяПрограмма,НомерУчастникаБонуснойПрограммы,АдресЭлектроннойПочты,СчетДебета";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,ЭмбоссированныйТекст1,ЭмбоссированныйТекст2,ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "НомерМобильногоТелефона,НомерМобильногоТелефонаПредставление,ОператорСвязи,КонтрольнаяИнформация";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,ЭмбоссированныйТекст1,ЭмбоссированныйТекст2,ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "НомерМиграционнойКарты,ДатаНачалаПребыванияМиграционнойКарты,ДатаОкончанияПребыванияМиграционнойКарты";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,ЭмбоссированныйТекст1,ЭмбоссированныйТекст2,ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "ВидМиграционногоДокумента,НомерМиграционногоДокумента,ДатаНачалаПребыванияМиграционногоДокумента,ДатаОкончанияПребыванияМиграционногоДокумента";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,ЭмбоссированныйТекст1,ЭмбоссированныйТекст2,ЭмбоссированныйТекст3";
	НовыеСведения.ПоляДоступа		= "ПрогнозируемыйМесячныйДоход,АдресДляИнформирования,АдресДляИнформированияПредставление";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ПлановыеНачисления";
	НовыеСведения.ПоляРегистрации	= "Сотрудник,ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Размер";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.СведенияОВзносахВПФР";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "НачисленоСтраховая,НачисленоНакопительная,УплаченоСтраховая,УплаченоНакопительная,ЗадолженностьСтраховая,ЗадолженностьНакопительная";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "ТекущаяТарифнаяСтавка";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрСведений.ФИОФизическихЛиц";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо";
	НовыеСведения.ПоляДоступа		= "Фамилия,Имя,Отчество";
	НовыеСведения.ОбластьДанных		= "ЛичныеДанные";
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "РегистрНакопления.БухгалтерскиеВзаиморасчетыССотрудниками";
	НовыеСведения.ПоляРегистрации	= "ФизическоеЛицо,Сотрудник";
	НовыеСведения.ПоляДоступа		= "СуммаВзаиморасчетов";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
	УчетНДФЛ.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	УчетПособийСоциальногоСтрахования.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	УчетСтраховыхВзносов.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	
	// Раздел ОбъектыБазовойРеализации
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ОбъектыБазовойРеализации") Тогда
		МодульОбъектыБазовойРеализации = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбъектыБазовойРеализации");
		МодульОбъектыБазовойРеализации.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		МодульРезервОтпусков = ОбщегоНазначения.ОбщийМодуль("РезервОтпусков");
		МодульРезервОтпусков.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетДепонированнойЗарплаты") Тогда
		МодульУчетДепонированнойЗарплаты = ОбщегоНазначения.ОбщийМодуль("УчетДепонированнойЗарплаты");
		МодульУчетДепонированнойЗарплаты.ЗаполнитьСведенияОПерсональныхДанных(ТаблицаСведений);
	КонецЕсли;
	
КонецПроцедуры

// Процедура дополняет сведения о хранении данных, 
// относящихся к персональным.
//
// Параметры:
//		ТаблицаСведений - таблица значений с полями:
//			Объект 			- строка, содержащая полное имя объекта метаданных,
//			ПоляРегистрации - строка, в которой перечислены имена полей регистрации, 
//								отдельные поля регистрации отделяются запятой,
//								альтернативные - символом "|",
//			ПоляДоступа		- строка, в которой перечислены через запятую имена полей доступа.
//			ОбластьДанных	- строка с идентификатором области данных, необязательно для заполнения.
//
Процедура ДополнитьСведенияОПерсональныхДанных(ТаблицаСведений) Экспорт
	
	НовыеСведения = ТаблицаСведений.Добавить();
	НовыеСведения.Объект			= "Документ.НачислениеЗарплаты";
	НовыеСведения.ПоляРегистрации	= "Начисления.Сотрудник,Удержания.Сотрудник";
	НовыеСведения.ПоляДоступа		= "Начисления.Результат,Удержания.Результат";
	НовыеСведения.ОбластьДанных		= "Доходы";
	
КонецПроцедуры

// Процедура обеспечивает составление коллекции областей персональных данных.
//
// Параметры:
//		ОбластиПерсональныхДанных - таблица значений с полями:
//			Имя - идентификатор области данных.
//			Представление - пользовательское представление области данных.
//			Родитель - идентификатор родительской области данных.
//
Процедура ЗаполнитьОбластиПерсональныхДанных(ОбластиПерсональныхДанных) Экспорт
	
	НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ЛичныеДанные";
	НоваяОбласть.Представление = НСтр("ru = 'Личные данные'");
	
	НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Доходы";
	НоваяОбласть.Представление = НСтр("ru = 'Данные о доходах'");
	
	НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "КонтактнаяИнформация";
	НоваяОбласть.Представление = НСтр("ru = 'Адреса и телефоны'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "ПаспортныеДанные";
	НоваяОбласть.Представление = НСтр("ru = 'Паспортные данные'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
	НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Имущество";
	НоваяОбласть.Представление = НСтр("ru = 'Данные об имуществе'");
	
	НоваяОбласть = ОбластиПерсональныхДанных.Добавить();
	НоваяОбласть.Имя = "Инвалидность";
	НоваяОбласть.Представление = НСтр("ru = 'Инвалидность'");
	НоваяОбласть.Родитель = "ЛичныеДанные";
	
КонецПроцедуры

// См. ЗащитаПерсональныхДанныхПереопределяемый.ПередСкрытиемПерсональныхДанныхСубъектов.
Процедура ПередСкрытиемПерсональныхДанныхСубъектов(Субъекты, ТаблицаИсключений, Отказ) Экспорт
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиПрограммы

// См. НастройкиПрограммыПереопределяемый.НастройкиПользователейИПравПриСозданииНаСервере.
Процедура НастройкиПользователейИПравПриСозданииНаСервере(Форма) Экспорт
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ИспользоватьСкрытиеПерсональныхДанных", "Доступность", Ложь);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ДнейДоСкрытияПерсональныхДанныхСубъектов", "Доступность", Ложь);
		
КонецПроцедуры

#КонецОбласти

#Область ВыгрузказагрузкаДанных

// Заполняет массив типов неразделенных данных, для которых поддерживается сопоставление ссылок
// при загрузке данных в другую информационную базу.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	// Здесь перечисляются неразделенные объекты метаданных ссылочного типа, имеющие непредопределенные элементы.
	// В модуле менеджера таких объектов должна быть определена функция ПоляЕстественногоКлюча, 
	// составляющая массив полей для однозначной идентификации элемента.
	
	Типы.Добавить(Метаданные.Справочники.ВидыДоходовНДФЛ);
	Типы.Добавить(Метаданные.Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК);
	Типы.Добавить(Метаданные.Справочники.ЗамещениеГосударственныхМуниципальныхДолжностейПФР);
	Типы.Добавить(Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсии);
	Типы.Добавить(Метаданные.Справочники.ОснованияИсчисляемогоСтраховогоСтажа);
	Типы.Добавить(Метаданные.Справочники.ОснованияУвольнения);
	Типы.Добавить(Метаданные.Справочники.ТерриториальныеУсловияПФР);
	
КонецПроцедуры

// Заполняет массив типов неразделенных данных, для которых не требуется сопоставление ссылок
// при загрузке данных в другую информационную базу, т.к. корректное сопоставление ссылок
// гарантируется с помощью других механизмов.
//
// Параметры:
//  Типы - Массив(ОбъектМетаданных).
//
Процедура ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке(Типы) Экспорт
	
	// Здесь перечисляются неразделенные объекты метаданных ссылочного типа, состоящие полностью из предопределенных
	// элементов.
	
	Типы.Добавить(Метаданные.Справочники.ВидыВычетовНДФЛ);
	Типы.Добавить(Метаданные.Справочники.ВидыДоходовПоСтраховымВзносам);
	Типы.Добавить(Метаданные.Справочники.ВидыТарифовСтраховыхВзносов);
	Типы.Добавить(Метаданные.Справочники.ОснованияДосрочногоНазначенияПенсииДляСЗВК);
	Типы.Добавить(Метаданные.Справочники.ОсобыеУсловияТрудаПФР);
	Типы.Добавить(Метаданные.Справочники.ОсобыеУсловияТрудаДляСЗВКПФР);
	Типы.Добавить(Метаданные.Справочники.ПараметрыИсчисляемогоСтраховогоСтажа);
	Типы.Добавить(Метаданные.Справочники.СтатусыНалогоплательщиковПоНДФЛ);
	
КонецПроцедуры

#КонецОбласти

#Область РегламентированнаяОтчетность

// Функция возвращает сведения об организации.
//
// Параметры:
//  Организация       - ссылка на элемент справочника "Организации";
//  ДатаЗначения      - дата, на которую нужно получить сведения;
//  СписокПоказателей - список показателей, значения которых нужно вернуть.
//  
// Возвращаемое значение:
//  Структура с ключами из списка показателей и возвращаемыми значениями.
//
// Пример:
//	ОргСведения = Новый Структура;
//  Для Каждого Показатель Из СписокПоказателей Цикл
//  	ИмяПоказателя = Показатель.Представление;
//      Если ИмяПоказателя = "КодНО" Тогда
//      	Значение = Организация.КодНалоговогоОргана;
//      ИначеЕсли ИмяПоказателя = "ОГРН" Тогда
//      	Значение = Организация.ОГРН;
//      Иначе
//      	Значение = "";
//      КонецЕсли;
//      ОргСведения.Вставить(ИмяПоказателя, Значение);
//  КонецЦикла;
//  Возврат ОргСведения;
//
Функция ПолучитьСведенияОбОрганизации(Знач Организация, Знач ДатаЗначения = Неопределено, Знач СписокПоказателей = Неопределено) Экспорт
	
	Перем ОргСведения;
	Перем Значение;
	
	ПустаяДата = '00010101000000';
	ПустойАдрес = ",,,,,,,,,";
	
	// Структура, в которой будут возвращаться найденные значения.
	ОргСведения = Новый Структура;
	
	Если ОбщегоНазначения.ЗначениеСсылочногоТипа(Организация) Тогда
		Организация = Организация.ПолучитьОбъект();
	КонецЕсли;

	Если ДатаЗначения = Неопределено Тогда
		ДатаЗначения = ТекущаяДатаСеанса();
	КонецЕсли;
	ДатаЗначения = КонецДня(ДатаЗначения);
	
	Если СписокПоказателей = Неопределено Тогда
		
		СписокПоказателей = Новый Массив;
		СписокПоказателей.Добавить("ТипНП");
		СписокПоказателей.Добавить("КатНП");
		СписокПоказателей.Добавить("КодНО");
		СписокПоказателей.Добавить("ОснВидДеят");
		СписокПоказателей.Добавить("ОКВЭД");
		СписокПоказателей.Добавить("ОснВидДеят2");
		СписокПоказателей.Добавить("ОКВЭД2");
		СписокПоказателей.Добавить("ОГРН");
		СписокПоказателей.Добавить("ОКАТО");
		СписокПоказателей.Добавить("ОКТМО");
		СписокПоказателей.Добавить("РегНомПФР");
		СписокПоказателей.Добавить("ОКПО");
		СписокПоказателей.Добавить("ОКФС");
		СписокПоказателей.Добавить("ДатаРегистрации");
		СписокПоказателей.Добавить("АдрПочт");
		СписокПоказателей.Добавить("АдрПочт_XML");
		СписокПоказателей.Добавить("СвидСН");
		СписокПоказателей.Добавить("СвидНО");
		СписокПоказателей.Добавить("СвидНОКод");
		СписокПоказателей.Добавить("НаимНО");
		СписокПоказателей.Добавить("НаимЮЛПол");
		СписокПоказателей.Добавить("ИННЮЛ");
		СписокПоказателей.Добавить("КППЮЛ");
		СписокПоказателей.Добавить("АдрЮР");
		СписокПоказателей.Добавить("АдрЮР_XML");
		СписокПоказателей.Добавить("ПолныйАдрЮР");
		СписокПоказателей.Добавить("АдрФакт");
		СписокПоказателей.Добавить("АдрФакт_XML");
		СписокПоказателей.Добавить("ОргИндекс");
		СписокПоказателей.Добавить("ОргСубъект");
		СписокПоказателей.Добавить("ОргКодСубъект");
		СписокПоказателей.Добавить("ОргРайон");
		СписокПоказателей.Добавить("ОргГород");
		СписокПоказателей.Добавить("ОргНПункт");
		СписокПоказателей.Добавить("ОргУлица");
		СписокПоказателей.Добавить("ОргДом");
		СписокПоказателей.Добавить("ОргКорпус");
		СписокПоказателей.Добавить("ОргКвартира");
		СписокПоказателей.Добавить("НаимОППол");
		СписокПоказателей.Добавить("КППОП");
		СписокПоказателей.Добавить("АдрОП");
		СписокПоказателей.Добавить("АдрОП_XML");
		СписокПоказателей.Добавить("ИндексОП");
		СписокПоказателей.Добавить("СубъектОП");
		СписокПоказателей.Добавить("КодСубъектОП");
		СписокПоказателей.Добавить("РайонОП");
		СписокПоказателей.Добавить("ГородОП");
		СписокПоказателей.Добавить("НПунктОП");
		СписокПоказателей.Добавить("УлицаОП");
		СписокПоказателей.Добавить("ДомОП");
		СписокПоказателей.Добавить("КорпусОП");
		СписокПоказателей.Добавить("КвартираОП");
		СписокПоказателей.Добавить("ФИО");
		СписокПоказателей.Добавить("ФамилияИП");
		СписокПоказателей.Добавить("ИмяИП");
		СписокПоказателей.Добавить("ОтчествоИП");
		СписокПоказателей.Добавить("ФИООтпрФЛ");
		СписокПоказателей.Добавить("ИННФЛ");
		СписокПоказателей.Добавить("СНИЛС");
		СписокПоказателей.Добавить("ДатаРожд");
		СписокПоказателей.Добавить("МестоРожд");
		СписокПоказателей.Добавить("Пол");
		СписокПоказателей.Добавить("Гражд");
		СписокПоказателей.Добавить("ГраждСтрана");
		СписокПоказателей.Добавить("КодУдЛичн");
		СписокПоказателей.Добавить("ВидУдЛичн");
		СписокПоказателей.Добавить("ОрганВыданУдЛичн");
		СписокПоказателей.Добавить("КодПодрУдЛичн");
		СписокПоказателей.Добавить("СерияУдЛичн");
		СписокПоказателей.Добавить("НомерУдЛичн");
		СписокПоказателей.Добавить("ДатаУдЛичн");
		СписокПоказателей.Добавить("АдрПрописки");
		СписокПоказателей.Добавить("АдрПрописки_XML");
		СписокПоказателей.Добавить("АдрМЖ");
		СписокПоказателей.Добавить("АдрМЖ_XML");
		СписокПоказателей.Добавить("ИндексМЖ");
		СписокПоказателей.Добавить("СубъектМЖ");
		СписокПоказателей.Добавить("КодСубъектМЖ");
		СписокПоказателей.Добавить("РайонМЖ");
		СписокПоказателей.Добавить("ГородМЖ");
		СписокПоказателей.Добавить("НПунктМЖ");
		СписокПоказателей.Добавить("УлицаМЖ");
		СписокПоказателей.Добавить("ДомМЖ");
		СписокПоказателей.Добавить("КорпусМЖ");
		СписокПоказателей.Добавить("КвартираМЖ");
		СписокПоказателей.Добавить("ТелСлуж");
		СписокПоказателей.Добавить("ТелДом");
		СписокПоказателей.Добавить("ФИОРук");
		СписокПоказателей.Добавить("ФамилияРук");
		СписокПоказателей.Добавить("ИмяРук");
		СписокПоказателей.Добавить("ОтчествоРук");
		СписокПоказателей.Добавить("ИННРук");
		СписокПоказателей.Добавить("ДатаРождРук");
		СписокПоказателей.Добавить("МестоРождРук");
		СписокПоказателей.Добавить("ПолРук");
		СписокПоказателей.Добавить("ГраждРук");
		СписокПоказателей.Добавить("ГраждСтранаРук");
		СписокПоказателей.Добавить("ТелРук");
		СписокПоказателей.Добавить("ДолжнРук");
		СписокПоказателей.Добавить("КодУдЛичнРук");
		СписокПоказателей.Добавить("ВидУдЛичнРук");
		СписокПоказателей.Добавить("ОрганВыданУдЛичнРук");
		СписокПоказателей.Добавить("КодПодрУдЛичнРук");
		СписокПоказателей.Добавить("СерияУдЛичнРук");
		СписокПоказателей.Добавить("НомерУдЛичнРук");
		СписокПоказателей.Добавить("ДатаУдЛичнРук");
		СписокПоказателей.Добавить("АдрМЖРукРФ");
		СписокПоказателей.Добавить("АдрМЖРукРФ_XML");
		СписокПоказателей.Добавить("ИндексМЖРук");
		СписокПоказателей.Добавить("СубъектМЖРук");
		СписокПоказателей.Добавить("КодСубъектМЖРук");
		СписокПоказателей.Добавить("РайонМЖРук");
		СписокПоказателей.Добавить("ГородМЖРук");
		СписокПоказателей.Добавить("НПунктМЖРук");
		СписокПоказателей.Добавить("УлицаМЖРук");
		СписокПоказателей.Добавить("ДомМЖРук");
		СписокПоказателей.Добавить("КорпусМЖРук");
		СписокПоказателей.Добавить("КвартираМЖРук");
		СписокПоказателей.Добавить("ФИООтпр");
		СписокПоказателей.Добавить("ФИОБух");
		СписокПоказателей.Добавить("ФамилияБух");
		СписокПоказателей.Добавить("ИмяБух");
		СписокПоказателей.Добавить("ОтчествоБух");
		СписокПоказателей.Добавить("ИННБух");
		СписокПоказателей.Добавить("ДатаРождБух");
		СписокПоказателей.Добавить("МестоРождБух");
		СписокПоказателей.Добавить("ПолБух");
		СписокПоказателей.Добавить("ПолУпПред");
		СписокПоказателей.Добавить("ГраждБух");
		СписокПоказателей.Добавить("ГраждУпПред");
		СписокПоказателей.Добавить("ГраждСтранаБух");
		СписокПоказателей.Добавить("ГраждСтранаУпПред");
		СписокПоказателей.Добавить("ТелБух");
		СписокПоказателей.Добавить("ТелОтпр");
		СписокПоказателей.Добавить("КодУдЛичнБух");
		СписокПоказателей.Добавить("ВидУдЛичнБух");
		СписокПоказателей.Добавить("ОрганВыданУдЛичнБух");
		СписокПоказателей.Добавить("КодПодрУдЛичнБух");
		СписокПоказателей.Добавить("СерияУдЛичнБух");
		СписокПоказателей.Добавить("НомерУдЛичнБух");
		СписокПоказателей.Добавить("ДатаУдЛичнБух");
		СписокПоказателей.Добавить("АдрМЖБухРФ");
		СписокПоказателей.Добавить("АдрМЖБухРФ_XML");
		СписокПоказателей.Добавить("ИндексМЖБух");
		СписокПоказателей.Добавить("СубъектМЖБух");
		СписокПоказателей.Добавить("КодСубъектМЖБух");
		СписокПоказателей.Добавить("РайонМЖБух");
		СписокПоказателей.Добавить("ГородМЖБух");
		СписокПоказателей.Добавить("НПунктМЖБух");
		СписокПоказателей.Добавить("УлицаМЖБух");
		СписокПоказателей.Добавить("ДомМЖБух");
		СписокПоказателей.Добавить("КорпусМЖБух");
		СписокПоказателей.Добавить("КвартираМЖБух");
		СписокПоказателей.Добавить("ФИОУпПред");
		СписокПоказателей.Добавить("ИННУпПред");
		СписокПоказателей.Добавить("ТелУпПред");
		СписокПоказателей.Добавить("КодУдЛичнУпПред");
		СписокПоказателей.Добавить("ВидУдЛичнУпПред");
		СписокПоказателей.Добавить("ОрганВыданУдЛичнУпПред");
		СписокПоказателей.Добавить("СерияУдЛичнУпПред");
		СписокПоказателей.Добавить("НомерУдЛичнУпПред");
		СписокПоказателей.Добавить("ДатаУдЛичнУпПред");
		СписокПоказателей.Добавить("ДатаРождУпПред");
		СписокПоказателей.Добавить("АдрМЖУпПредРФ");
		СписокПоказателей.Добавить("АдрМЖУпПредРФ_XML");
		СписокПоказателей.Добавить("МестоРождУпПред");
		СписокПоказателей.Добавить("ИндексМЖУпПред");
		СписокПоказателей.Добавить("СубъектМЖУпПред");
		СписокПоказателей.Добавить("КодСубъектМЖУпПред");
		СписокПоказателей.Добавить("РайонМЖУпПред");
		СписокПоказателей.Добавить("ГородМЖУпПред");
		СписокПоказателей.Добавить("НПунктМЖУпПред");
		СписокПоказателей.Добавить("УлицаМЖУпПред");
		СписокПоказателей.Добавить("ДомМЖУпПред");
		СписокПоказателей.Добавить("КорпусМЖУпПред");
		СписокПоказателей.Добавить("КвартираМЖУпПред");
		СписокПоказателей.Добавить("ФаксИсп");
		СписокПоказателей.Добавить("ДолжнОтпр");
		СписокПоказателей.Добавить("ДатаПереходаНаУСН");
		СписокПоказателей.Добавить("БанкСчетНомер");
		СписокПоказателей.Добавить("БанкСчетНаимБанка");
		СписокПоказателей.Добавить("БанкСчетКоррСчетБанка");
		СписокПоказателей.Добавить("БанкСчетБИКБанка");
		СписокПоказателей.Добавить("РегистрационныйНомерФСС");
		СписокПоказателей.Добавить("КодПодчиненностиФСС");
		СписокПоказателей.Добавить("СтраховойТариф");
		СписокПоказателей.Добавить("ТелОрганизации");
		СписокПоказателей.Добавить("ФаксОрганизации");
		СписокПоказателей.Добавить("ОбъектНалогообложенияУСН");
		СписокПоказателей.Добавить("НаимГоловнОрг");
		СписокПоказателей.Добавить("КППГоловнОрг");
		СписокПоказателей.Добавить("ФИОИсп");
		СписокПоказателей.Добавить("ДолжнИсп");
		СписокПоказателей.Добавить("ТелИсп");
		СписокПоказателей.Добавить("АдресЭлПочтыИсп");
		СписокПоказателей.Добавить("КодОрганаПФР");
		СписокПоказателей.Добавить("АдресЭлектроннойПочтыОрганизации");
		СписокПоказателей.Добавить("КодПодчФССДобрСтрах");
		СписокПоказателей.Добавить("ШифрСтрахователяФСС");
		СписокПоказателей.Добавить("СистемыНалогообложения");
		СписокПоказателей.Добавить("ВидПлательщикаСтраховыхВзносов");
		СписокПоказателей.Добавить("КодТарифаПлательщикаПоУмолчаниюДляРСВ");
		СписокПоказателей.Добавить("КодОрганаФСГС");
		
	КонецЕсли;
	
	Кэш = Новый Структура;
	Кэш.Вставить("Организация", Организация);
	Кэш.Вставить("ДатаЗначения", ДатаЗначения);
	
	ПБОЮЛ = НЕ ЗарплатаКадры.ЭтоЮридическоеЛицо(Организация.Ссылка);
	Кэш.Вставить("ПБОЮЛ", ПБОЮЛ);
	
	ДомашнийТелефонФизЛица = ?(РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонДомашнийФизическиеЛица"), Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица);
	РабочийТелефонФизЛица = ?(РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонРабочийФизическиеЛица"), Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	
	РегистрацияВНалоговомОргане = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация.Ссылка, ДатаЗначения);
	РегистрацияВНалоговомОрганеГоловнойОрганизации = ЗарплатаКадры.РегистрацияВНалоговомОргане(Организация.ГоловнаяОрганизация, ДатаЗначения);
	
	РоссийскийАдрес = Новый Соответствие;
	РоссийскийАдрес.Вставить("Индекс",          "");
	РоссийскийАдрес.Вставить("Регион",          "");
	РоссийскийАдрес.Вставить("КодРегиона",      "");
	РоссийскийАдрес.Вставить("Район",           "");
	РоссийскийАдрес.Вставить("Город",           "");
	РоссийскийАдрес.Вставить("НаселенныйПункт", "");
	РоссийскийАдрес.Вставить("Улица",           "");
	РоссийскийАдрес.Вставить("Дом",             "");
	РоссийскийАдрес.Вставить("Корпус",          "");
	РоссийскийАдрес.Вставить("Квартира",        "");
	
	ЭтоМассив = (ТипЗнч(СписокПоказателей) = Тип("Массив"));
	
	Для Каждого Показатель Из СписокПоказателей Цикл
		
		ИмяПоказателя = ?(ЭтоМассив, Показатель, Показатель.Представление);
		
		Если ИмяПоказателя = "ТипНП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка()
			 ИЛИ Организация.ГоловнаяОрганизация = Организация.Ссылка Тогда
				Если ПБОЮЛ Тогда
					Значение = 3;
				Иначе
					Значение = 1;
				КонецЕсли;
			Иначе
				Значение = 2;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КатНП" Тогда
			
			Значение = "01";
			
		ИначеЕсли ИмяПоказателя = "КодНО" Тогда
			
			Значение = РегистрацияВНалоговомОргане.Код;
			
		ИначеЕсли ИмяПоказателя = "ОснВидДеят" Тогда
			
			Значение = Организация.НаименованиеОКВЭД;
			
		ИначеЕсли ИмяПоказателя = "ОКВЭД" Тогда
			
			Значение = Организация.КодОКВЭД;
			
		ИначеЕсли ИмяПоказателя = "ОснВидДеят2" Тогда
			
			Значение = Организация.НаименованиеОКВЭД2;
			
		ИначеЕсли ИмяПоказателя = "ОКВЭД2" Тогда
			
			Значение = Организация.КодОКВЭД2;
			
		ИначеЕсли ИмяПоказателя	= "ОГРН" Тогда
			
			Значение = Организация.ОГРН;
			
		ИначеЕсли ИмяПоказателя = "ОКАТО" Тогда
			
			Значение = СокрЛП(РегистрацияВНалоговомОргане.КодПоОКАТО);
			
		ИначеЕсли ИмяПоказателя = "ОКТМО" Тогда
			
			Значение = СокрЛП(РегистрацияВНалоговомОргане.КодПоОКТМО);
			
		ИначеЕсли ИмяПоказателя = "РегНомПФР" Тогда
			
			Значение = ПерсонифицированныйУчет.РегистрационныйНомерПФР(Организация.Ссылка, ДатаЗначения);
			
		ИначеЕсли ИмяПоказателя = "РегНомПФРЗаСебя" Тогда
			
			Значение = ПерсонифицированныйУчет.РегистрационныйНомерПФР(Организация.Ссылка, ДатаЗначения);
			
		ИначеЕсли ИмяПоказателя = "КодОрганаПФР" Тогда
			
			Значение = Организация.КодОрганаПФР;
			
		ИначеЕсли ИмяПоказателя = "ОКПО" Тогда
			
			Значение = Организация.КодПоОКПО;
			
		ИначеЕсли ИмяПоказателя = "ОКФС" Тогда
			
			Значение = Организация.КодОКФС;
			
		ИначеЕсли ИмяПоказателя = "РегистрационныйНомерФСС" Тогда
			
			ЭтоГоловнаяОрганизация = 
				Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка()
			 	ИЛИ Организация.ГоловнаяОрганизация = Организация.Ссылка; 
			Если ЭтоГоловнаяОрганизация ИЛИ ДатаЗначения <= КонецДня('20150120') Тогда
				Значение = Организация.РегистрационныйНомерФСС;
			Иначе	
				// для обособленных подразделений с 2015 года используется дополнительный код ФСС
				Значение = Организация.ДополнительныйКодФСС;
			КонецЕсли	
			
		ИначеЕсли ИмяПоказателя = "РегистрационныйНомерФССДобрСтрах" Тогда	
			
			Если ПБОЮЛ Тогда
				Значение = Организация.РегистрационныйНомерФСС;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодПодчиненностиФСС" Тогда
			
			Значение = СокрЛП(Организация.КодПодчиненностиФСС);
			
		ИначеЕсли ИмяПоказателя = "КодПодчФССДобрСтрах" Тогда	
			
			Если ПБОЮЛ Тогда
				Значение = СокрЛП(Организация.КодПодчиненностиФСС);
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодОрганаФСГС" Тогда
			
			Значение = Организация.КодОрганаФСГС;
			
		ИначеЕсли ИмяПоказателя = "ШифрСтрахователяФСС" Тогда
			
			Тарифы = РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносов.СрезПоследних(ДатаЗначения, Новый Структура("ГоловнаяОрганизация", Организация.Ссылка));
			
			Если Тарифы.Количество() > 0 Тогда
				Значение = СокрЛП(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Тарифы[0].ВидТарифа, "КодФСС2012"));
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ВидПлательщикаСтраховыхВзносов" Тогда
			
			Значение = "00";
			
		ИначеЕсли ИмяПоказателя = "КодТарифаПлательщикаПоУмолчаниюДляРСВ" Тогда
			
			Значение = "01";
			
		ИначеЕсли ИмяПоказателя = "СистемыНалогообложения" Тогда
			
			СистемыНалогообложения = Новый Массив;
			
			Тарифы = РегистрыСведений.ПрименяемыеТарифыСтраховыхВзносов.СрезПоследних(ДатаЗначения, Новый Структура("ГоловнаяОрганизация", Организация.Ссылка));
			
			Если Тарифы.Количество() > 0 Тогда
				ВидТарифа = Тарифы[0].ВидТарифа;
				Если ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.БлаготворительныеОрганизации") Тогда
					СистемыНалогообложения.Добавить("УСН");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.ИндивидуальныйПредпринимательПрименяющийПатент") Тогда
					СистемыНалогообложения.Добавить("ПСН");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.НекоммерческиеОрганизации") Тогда
					СистемыНалогообложения.Добавить("УСН");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.СельХозПроизводители") Тогда
					СистемыНалогообложения.Добавить("ОСНО");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.ЕСХН") Тогда
					СистемыНалогообложения.Добавить("ЕСХН");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.ОбщийНалоговыйРежим") Тогда
					СистемыНалогообложения.Добавить("ОСНО");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежимПроизводство") Тогда
					СистемыНалогообложения.Добавить("УСН");
				ИначеЕсли ВидТарифа = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.ВидыТарифовСтраховыхВзносов.УпрощенныйНалоговыйРежим") Тогда
					СистемыНалогообложения.Добавить("УСН");
				Иначе	
					СистемыНалогообложения.Добавить("ОСНО");
				КонецЕсли;	
			Иначе
				СистемыНалогообложения.Добавить("ОСНО");
			КонецЕсли;
			
			УчетнаяПолитика = РегистрыСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(ДатаЗначения, Новый Структура("Организация", Организация.Ссылка));
			Если УчетнаяПолитика.Количество() > 0 И УчетнаяПолитика[0].ПлательщикЕНВД Тогда
				СистемыНалогообложения.Добавить("ЕНВД");
			КонецЕсли;
			
			Значение = СтрСоединить(СистемыНалогообложения, ", ");
			
		ИначеЕсли ИмяПоказателя = "ДатаРегистрации" Тогда
			
			Значение = ПустаяДата;
			
		ИначеЕсли ИмяПоказателя = "СтраховойТариф" Тогда
			
			Результат = РегистрыСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.СрезПоследних(ДатаЗначения, Новый Структура("Организация", Организация.Ссылка));
			Если Результат.Количество() > 0 Тогда
				Значение = Результат[0].Ставка;
			Иначе
				Значение = 0;
			КонецЕсли;
						
		ИначеЕсли ИмяПоказателя = "АдрПочт" Тогда
			
			ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ИмяПредопределенного);

			Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);

			Если Результат.Количество() > 0 Тогда
				Значение = АдресВФормате9Запятых(Результат[0], Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПочт_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ПолныйАдрПочт" Тогда
			
			ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации;
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ИмяПредопределенного);
			
			Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = Результат[0].Представление;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдресЭлектроннойПочтыОрганизации" Тогда
			
			Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	
			Результат = Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
			
			Если Результат.Количество() > 0 Тогда
				Значение = Результат[0].Представление;
			Иначе
				Значение = "";
			КонецЕсли;	
			
		ИначеЕсли ИмяПоказателя = "СвидСН" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "СвидНО" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "СвидНОКод" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "НаимНО" Тогда
			
			Значение = РегистрацияВНалоговомОргане.НаименованиеИФНС;
			
		ИначеЕсли ИмяПоказателя = "НаимЮЛПол" Тогда
			
			Значение = Организация.НаименованиеПолное;
			
		ИначеЕсли ИмяПоказателя = "ИННЮЛ" Тогда
			
			Значение = СокрЛП(Организация.ИНН);
			
		ИначеЕсли ИмяПоказателя = "КППЮЛ" Тогда
			
			Значение = РегистрацияВНалоговомОргане.КПП;
			
		ИначеЕсли ИмяПоказателя = "АдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = АдресВФормате9Запятых(Результат, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрЮР_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ПолныйАдрЮР" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "АдрФакт" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ФактАдресОрганизации");
			Если Результат <> Неопределено Тогда
				Значение = АдресВФормате9Запятых(Результат, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрФакт_XML" Тогда
			
			Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
			
		ИначеЕсли ИмяПоказателя = "ТелОрганизации" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

			Если Результат <> Неопределено Тогда
				Значение = Результат.Представление;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФаксОрганизации" Тогда
			
			Если Кэш.ПБОЮЛ Тогда
				Значение = "";
			Иначе
				ИмяПредопределенного = Справочники.ВидыКонтактнойИнформации.ФаксОрганизации;
				Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Факс, ИмяПредопределенного);
				Результат = Кэш.Организация.КонтактнаяИнформация.НайтиСтроки(Данные);
				Если Результат.Количество() > 0 Тогда
					Значение = Результат[0].Представление;
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргИндекс" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Индекс"];
								
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргСубъект" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
								
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Регион"];				
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргКодСубъект" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["КодРегиона"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргРайон" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Район"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргГород" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Город"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргНПункт" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["НаселенныйПункт"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргУлица" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Улица"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргДом" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Дом"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргКорпус" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Корпус"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОргКвартира" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

			Если Результат <> Неопределено Тогда
				
				РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
				Значение = РоссийскийАдрес["Квартира"];
					
			Иначе
				Значение = "";
			КонецЕсли;
			
		// *************************************************************Для обособленного подразделения.
		ИначеЕсли ИмяПоказателя = "НаимОППол" Тогда
		
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = Организация.НаименованиеПолное;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КППОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = РегистрацияВНалоговомОргане.КПП;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрОП" Тогда
			
			Если Организация.ОбособленноеПодразделение Тогда
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");
				Если Результат <> Неопределено Тогда
					Значение = АдресВФормате9Запятых(Результат, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
				Иначе
					Значение = ПустойАдрес;
				КонецЕсли;
			Иначе
				Значение = ПустойАдрес;
			КонецЕсли;
			
			Если ПустаяСтрока(Значение) Тогда
				Значение = ПустойАдрес;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрОП_XML" Тогда
			
			Если Организация.ОбособленноеПодразделение Тогда
				Значение = АдресВXML(Организация.КонтактнаяИнформация, Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
			Иначе
				Значение = Неопределено;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Индекс"];
							
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Регион"];
						
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодСубъектОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["КодРегиона"];
					
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "РайонОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Район"];
					
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГородОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе

				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Город"];
					
				Иначе
					Значение = "";
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НПунктОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["НаселенныйПункт"];
					
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "УлицаОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Улица"];
					
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДомОП" Тогда
					
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
					
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Дом"];
					
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КорпусОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Корпус"];
					
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КвартираОП" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				
				Результат = ПолучитьСУчетомКэша(Кэш, "ЮрАдресОрганизации");

				Если Результат <> Неопределено Тогда
										
					РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат.ЗначенияПолей, РоссийскийАдрес);
				
					Значение = РоссийскийАдрес["Квартира"];
					
				Иначе
					Значение = "";
				КонецЕсли;
			КонецЕсли;
			
			
		// ***************************************************Сведения об индивидуальном предпринимателе.
		ИначеЕсли ИмяПоказателя = "ФИО" ИЛИ ИмяПоказателя = "ФИООтпрФЛ" Тогда
			
			Если ПБОЮЛ Тогда
				Если Метаданные.Справочники.Организации.Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
					ФЛ = Организация.ИндивидуальныйПредприниматель;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = Организация.НаименованиеПолное;
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = Организация.НаименованиеПолное; 
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФамилияИП" Тогда
			
			Если ПБОЮЛ Тогда
				Если Метаданные.Справочники.Организации.Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
					ФЛ = Организация.ИндивидуальныйПредприниматель;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = Организация.НаименованиеПолное;
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(ДанныеФЛ[0].Фамилия);
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = Организация.НаименованиеПолное;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИмяИП" Тогда
			
			Если ПБОЮЛ Тогда
				Если Метаданные.Справочники.Организации.Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
					ФЛ = Организация.ИндивидуальныйПредприниматель;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(ДанныеФЛ[0].Имя);
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОтчествоИП" Тогда
			
			Если ПБОЮЛ Тогда
				Если Метаданные.Справочники.Организации.Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
					ФЛ = Организация.ИндивидуальныйПредприниматель;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(ДанныеФЛ[0].Отчество);
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННФЛ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Результат[0].ФизическоеЛицо.ИНН;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СНИЛС" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Результат[0].ФизическоеЛицо.СтраховойНомерПФР;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;	
			
		ИначеЕсли ИмяПоказателя = "ДатаРожд" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = ПустаяДата;
					Иначе
						Значение = Результат[0].ФизическоеЛицо.ДатаРождения;
					КонецЕсли;
				Иначе
					Значение = ПустаяДата;
				КонецЕсли;
				
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРожд" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Значение = Результат[0].ФизическоеЛицо.МестоРождения;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "Пол" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = 0;
					Иначе
						Если Результат[0].ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
							Значение = 2;
						ИначеЕсли Результат[0].ФизическоеЛицо.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
							Значение = 1;
						Иначе
							Значение = 0;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = 0;
				КонецЕсли;
				
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "Гражд" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеГражданство", Результат[0].ФизическоеЛицо);

						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = Гражданство.Код;
						КонецЕсли;

					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтрана" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеГражданство", Результат[0].ФизическоеЛицо);
						Если Гражданство = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = Неопределено;
						Иначе
							Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ВидДокумента.КодМВД;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ВидУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
								Значение = "";
							Иначе
								Значение = УдЛичн.ВидДокумента.Наименование;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.КемВыдан;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодПодрУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
			
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");
				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					
					ФЛ = Результат[0].ФизическоеЛицо;
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", ФЛ);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.КодПодразделения;
						КонецЕсли;
					КонецЕсли;
					
				Иначе
					Значение = "";
				КонецЕсли;
			
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.Серия;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.Номер;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичн" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = ПустаяДата;
					Иначе
						УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные", Результат[0].ФизическоеЛицо);
						Если УдЛичн = Неопределено Тогда
							Значение = ПустаяДата;
						Иначе
							Значение = УдЛичн.ДатаВыдачи;
						КонецЕсли;
					КонецЕсли;
				Иначе
					Значение = ПустаяДата;
				КонецЕсли;
				
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрПрописки" 
			ИЛИ ИмяПоказателя = "АдрПрописки_XML" Тогда
			
			Если ИмяПоказателя = "АдрПрописки" Тогда
				Значение = ПустойАдрес;
			ИначеЕсли ИмяПоказателя = "АдрПрописки_XML" Тогда
				Значение = Неопределено;
			Иначе	
				Значение = "";
			КонецЕсли;	
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено 
					И Результат.Количество() > 0 
					И Результат[0].ФизическоеЛицо <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						
						Адрес = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдресПрописки", Результат[0].ФизическоеЛицо);

						Если Адрес <> Неопределено Тогда
							Если ИмяПоказателя = "АдрПрописки" Тогда
								Значение = АдресВФормате9Запятых(Адрес, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
							ИначеЕсли ИмяПоказателя = "АдрПрописки_XML" Тогда
								Значение = АдресВФорматеXML(Адрес, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
							КонецЕсли	
						КонецЕсли;
						
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖ" 
			ИЛИ ИмяПоказателя = "АдрМЖ_XML" Тогда
			
			Если ИмяПоказателя = "АдрМЖ" Тогда
				Значение = ПустойАдрес;
			ИначеЕсли ИмяПоказателя = "АдрМЖ_XML" Тогда
				Значение = Неопределено;
			Иначе	
				Значение = "";
			КонецЕсли;	
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено 
					И Результат.Количество() > 0 
					И Результат[0].ФизическоеЛицо <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						
						Адрес = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Адрес <> Неопределено Тогда
							Если ИмяПоказателя = "АдрМЖ" Тогда
								Значение = АдресВФормате9Запятых(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
							ИначеЕсли ИмяПоказателя = "АдрМЖ_XML" Тогда
								Значение = АдресВФорматеXML(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
							КонецЕсли	
						КонецЕсли;
						
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
														
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Индекс"];
							
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
														
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Регион"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["КодРегиона"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Район"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Город"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["НаселенныйПункт"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Улица"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Дом"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Корпус"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖ" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						
						Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателеАдрес", Результат[0].ФизическоеЛицо);

						Если Результат2 <> Неопределено Тогда
							
							РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
							Значение = РоссийскийАдрес["Квартира"];
						
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелСлуж" Тогда
			
			Если ПБОЮЛ Тогда
			
				Результат = ПолучитьСУчетомКэша(Кэш, "ТелефонОрганизации");

				Если Результат <> Неопределено Тогда
					Значение = Результат.Представление;
				Иначе
					Значение = "";
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелДом" Тогда
			
			Если ПБОЮЛ Тогда
				
				Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИндивидуальномПредпринимателе");

				Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
					
					Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						
						Значение = "";
						
					Иначе
						
						Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, ДомашнийТелефонФизЛица);

						Результат2 = Результат[0].ФизическоеЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);

						Если Результат2.Количество() > 0 Тогда
							Значение = Результат2[0].Представление;
						Иначе
							Значение = "";
						КонецЕсли;
						
					КонецЕсли;
					
				Иначе
					
					Значение = "";
					
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
			
		// ******************************************************************Сведения о руководителе организации.
		ИначеЕсли ИмяПоказателя = "ФИОРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["Руководитель"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФамилияРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["Руководитель"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(ДанныеФЛ[0].Фамилия);
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИмяРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["Руководитель"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(ДанныеФЛ[0].Имя);
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОтчествоРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["Руководитель"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(ДанныеФЛ[0].Отчество);
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Значение = ФЛ.ИНН;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = ПустаяДата;
				Иначе
					Значение = ФЛ.ДатаРождения;
				КонецЕсли;
				
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРождРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Значение = ФЛ.МестоРождения;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ПолРук" Тогда

			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = 0;
				Иначе
					Если Результат[0].Руководитель.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						Значение = 2;
					ИначеЕсли Результат[0].Руководитель.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
						Значение = 1;
					Иначе
						Значение = 0;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = 0;
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГраждРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеГражданство", ФЛ);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = Гражданство.Код;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтранаРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеГражданство", ФЛ);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, РабочийТелефонФизЛица);
					Результат2 = ФЛ.КонтактнаяИнформация.НайтиСтроки(Данные);
					Если Результат2.Количество() > 0 Тогда
						Значение = Результат2[0].Представление;
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если Результат[0].Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Результат[0].Руководитель);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ВидДокумента.КодМВД;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ВидУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если Результат[0].Руководитель = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", Результат[0].Руководитель);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
							Значение = "";								
						Иначе
							Значение = УдЛичн.ВидДокумента.Наименование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДолжнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ДолжностьРуководителя = Результат[0]["ДолжностьРуководителя"];
				Если НЕ ЗначениеЗаполнено(ДолжностьРуководителя) Тогда
					Значение = "";
				Иначе
					Значение = ДолжностьРуководителя;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.КемВыдан;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодПодрУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.КодПодразделения;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.Серия;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.Номер;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичнРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].Руководитель;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.ДатаВыдачи;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ"
			ИЛИ ИмяПоказателя = "АдрМЖРукРФ_XML" Тогда
			
			Если ИмяПоказателя = "АдрМЖРукРФ" Тогда
				Значение = ПустойАдрес;
			ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ_XML" Тогда
				Значение = Неопределено;
			Иначе	
				Значение = "";
			КонецЕсли;	
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");

			Если Результат <> Неопределено 
				И Результат.Количество() > 0 
				И Результат[0].Руководитель <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					
					Адрес = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);

					Если Адрес <> Неопределено Тогда
						Если ИмяПоказателя = "АдрМЖРукРФ" Тогда
							Значение = АдресВФормате9Запятых(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
						ИначеЕсли ИмяПоказателя = "АдрМЖРукРФ_XML" Тогда
							Значение = АдресВФорматеXML(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
						КонецЕсли	
					КонецЕсли;
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ИндексМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
								
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Индекс"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Регион"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["КодРегиона"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Район"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖРук" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Город"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖРук" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["НаселенныйПункт"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖРук" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Улица"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Дом"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Корпус"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖРук" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].Руководитель) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОРуководителеАдрес", Результат[0].Руководитель);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Квартира"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		// *******************************************************************Сведения о главном бухгалтере.
		ИначеЕсли ИмяПоказателя = "ФИОБух" ИЛИ ИмяПоказателя = "ФИООтпр" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["ГлавныйБухгалтер"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФамилияБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["ГлавныйБухгалтер"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИмяБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["ГлавныйБухгалтер"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Имя));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
		ИначеЕсли ИмяПоказателя = "ОтчествоБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["ГлавныйБухгалтер"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Значение = ФЛ.ИНН;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = ПустаяДата;
				Иначе
					Значение = ФЛ.ДатаРождения;
				КонецЕсли;
				
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаРождУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");
			
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = ПустаяДата;
				Иначе
					Значение = Результат[0].ГлавныйБухгалтер.ДатаРождения;
				КонецЕсли;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРождБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Значение = ФЛ.МестоРождения;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "МестоРождУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");
			
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Значение = Результат[0].ГлавныйБухгалтер.МестоРождения;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ПолБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = 0;
				Иначе
					Если Результат[0].ГлавныйБухгалтер.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						Значение = 2;
					ИначеЕсли Результат[0].ГлавныйБухгалтер.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
						Значение = 1;
					Иначе
						Значение = 0;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = 0;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ПолУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");
			
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = 0;
				Иначе
					Если Результат[0].ГлавныйБухгалтер.Пол = Перечисления.ПолФизическогоЛица.Женский Тогда
						Значение = 2;
					ИначеЕсли Результат[0].ГлавныйБухгалтер.Пол = Перечисления.ПолФизическогоЛица.Мужской Тогда
						Значение = 1;
					Иначе
						Значение = 0;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = 0;
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ГраждБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереГражданство", ФЛ);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = Гражданство.Код;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ГраждСтранаБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереГражданство", ФЛ);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ГраждУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеГражданство", Результат[0].ФизическоеЛицо);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = Гражданство.Код;
					КонецЕсли;

				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ГраждСтранаУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Гражданство = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеГражданство", Результат[0].ГлавныйБухгалтер);
					Если Гражданство = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = ?(ПустаяСтрока(Гражданство.НаименованиеПолное), Гражданство.Наименование, Гражданство.НаименованиеПолное);
					КонецЕсли;

				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;

		ИначеЕсли ИмяПоказателя = "ТелБух" ИЛИ ИмяПоказателя = "ТелОтпр" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, РабочийТелефонФизЛица);
					Результат2 = ФЛ.КонтактнаяИнформация.НайтиСтроки(Данные);
					Если Результат2.Количество() > 0 Тогда
						Значение = Результат2[0].Представление;
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Результат[0].ГлавныйБухгалтер);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ВидДокумента.КодМВД;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ВидУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если Результат[0].ГлавныйБухгалтер = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", Результат[0].ГлавныйБухгалтер);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
							Значение = "";
						Иначе
							Значение = УдЛичн.ВидДокумента.Наименование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.КемВыдан;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КодПодрУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.КодПодразделения;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.Серия;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.Номер;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичнБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФЛ = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереПаспортныеДанные", ФЛ);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.ДатаВыдачи;
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖБухРФ"
			Или ИмяПоказателя = "АдрМЖБухРФ_XML" Тогда
			
			Если ИмяПоказателя = "АдрМЖБухРФ" Тогда
				Значение = ПустойАдрес;
			ИначеЕсли ИмяПоказателя = "АдрМЖБухРФ_XML" Тогда
				Значение = Неопределено;
			Иначе	
				Значение = "";
			КонецЕсли;	
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");

			Если Результат <> Неопределено 
				И Результат.Количество() > 0 
				И Результат[0].ГлавныйБухгалтер <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					
					Адрес = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);

					Если Адрес <> Неопределено Тогда
						Если ИмяПоказателя = "АдрМЖБухРФ" Тогда
							Значение = АдресВФормате9Запятых(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
						ИначеЕсли ИмяПоказателя = "АдрМЖБухРФ_XML" Тогда
							Значение = АдресВФорматеXML(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
						КонецЕсли	
					КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Индекс"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Регион"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["КодРегиона"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Район"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖБух" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Город"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖБух" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["НаселенныйПункт"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖБух" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Улица"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Дом"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Корпус"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖБух" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтере");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если НЕ ЗначениеЗаполнено(Результат[0].ГлавныйБухгалтер) Тогда
					Значение = "";
				Иначе
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОБухгалтереАдрес", Результат[0].ГлавныйБухгалтер);
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Квартира"];
						
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		// **********************************************Сведения об уполномоченном представителе.
		ИначеЕсли ИмяПоказателя = "ФИОУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					ФЛ = Результат[0].ФизическоеЛицо;
					Если ФЛ = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИННУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					Значение = Результат[0].ФизическоеЛицо.ИНН;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ТелУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					
					Значение = "";
					
				Иначе
					
					Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, РабочийТелефонФизЛица);

					Результат2 = Результат[0].ФизическоеЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);

					Если Результат2.Количество() > 0 Тогда
						Значение = Результат2[0].Представление;
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				
				Значение = "";
				
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
							Значение = "";								
						Иначе
							Значение = УдЛичн.ВидДокумента.КодМВД;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ВидУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Если УдЛичн.ВидДокумента = Справочники.ВидыДокументовФизическихЛиц.ПустаяСсылка() Тогда
							Значение = "";								
						Иначе
							Значение = УдЛичн.ВидДокумента.Наименование;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ОрганВыданУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.КемВыдан;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СерияУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.Серия;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "НомерУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = "";
					Иначе
						Значение = УдЛичн.Номер;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДатаУдЛичнУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = ПустаяДата;
				Иначе
					УдЛичн = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеПаспортныеДанные", Результат[0].ФизическоеЛицо);
					Если УдЛичн = Неопределено Тогда
						Значение = ПустаяДата;
					Иначе
						Значение = УдЛичн.ДатаВыдачи;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = ПустаяДата;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдрМЖУпПредРФ"
			Или ИмяПоказателя = "АдрМЖУпПредРФ_XML" Тогда
			
			Если ИмяПоказателя = "АдрМЖУпПредРФ" Тогда
				Значение = ПустойАдрес;
			ИначеЕсли ИмяПоказателя = "АдрМЖУпПредРФ_XML" Тогда
				Значение = Неопределено;
			Иначе	
				Значение = "";
			КонецЕсли;	
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено 
				И Результат.Количество() > 0 
				И Результат[0].УполномоченныйПредставитель <> Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					
					Адрес = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].УполномоченныйПредставитель);

					Если Адрес <> Неопределено Тогда
						Если ИмяПоказателя = "АдрМЖУпПредРФ" Тогда
							Значение = АдресВФормате9Запятых(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
						ИначеЕсли ИмяПоказателя = "АдрМЖУпПредРФ_XML" Тогда
							Значение = АдресВФорматеXML(Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
						КонецЕсли	
					КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ИндексМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
												
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Индекс"];
						
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "СубъектМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Регион"];
						
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КодСубъектМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
												
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["КодРегиона"];
						
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "РайонМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Район"];
					
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ГородМЖУпПред" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
												
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Город"];
					
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "НПунктМЖУпПред" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
											
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["НаселенныйПункт"];
					
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "УлицаМЖУпПред" Тогда
				
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
												
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Улица"];
					
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "ДомМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");

			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);

					Если Результат2 <> Неопределено Тогда
												
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
				
						Значение = РоссийскийАдрес["Дом"];
					
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
				
		ИначеЕсли ИмяПоказателя = "КорпусМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");
			
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);
					
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
						
						Значение = РоссийскийАдрес["Корпус"];
						
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КвартираМЖУпПред" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителе");
			
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				Если Результат[0].ФизическоеЛицо = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда
					Значение = "";
				Иначе
					
					Результат2 = ПолучитьСУчетомКэша(Кэш, "СведенияОУполномоченномПредставителеАдрес", Результат[0].ФизическоеЛицо);
					
					Если Результат2 <> Неопределено Тогда
						
						РегламентированнаяОтчетностьВызовСервера.СформироватьАдрес(Результат2.ЗначенияПолей, РоссийскийАдрес);
						
						Значение = РоссийскийАдрес["Квартира"];
						
					Иначе
						Значение = "";
					КонецЕсли;
					
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		// прочие сведения
		ИначеЕсли ИмяПоказателя = "ФаксИсп" Тогда
			
			Значение = "";
			
		ИначеЕсли ИмяПоказателя = "ДолжнОтпр" Тогда
			
			Значение = "ГЛАВНЫЙ БУХГАЛТЕР"
			
		ИначеЕсли ИмяПоказателя = "НаимГоловнОрг" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = Организация.ГоловнаяОрганизация.НаименованиеПолное;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "КППГоловнОрг" Тогда
			
			Если Организация.ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка() Тогда
				Значение = "";
			Иначе
				Значение = РегистрацияВНалоговомОрганеГоловнойОрганизации.КПП;
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ФИОИсп" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИсполнителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				ФЛ = Результат[0]["ГлавныйБухгалтер"];
				Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
					Значение = "";
				Иначе
					ФЛ = Результат[0]["ГлавныйБухгалтер"];
					Если НЕ ЗначениеЗаполнено(ФЛ) Тогда
						Значение = "";
					Иначе
						ДанныеФЛ = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо",ФЛ));
						Если ДанныеФЛ.Количество() > 0 Тогда
							Значение = СокрЛП(СокрЛП(ДанныеФЛ[0].Фамилия) + " " + СокрЛП(ДанныеФЛ[0].Имя) + " " + СокрЛП(ДанныеФЛ[0].Отчество));
						Иначе
							Значение = "";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "ДолжнИсп" Тогда
			
			Значение = НСтр("ru = 'Главный бухгалтер'")
			
		ИначеЕсли ИмяПоказателя = "ТелИсп" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИсполнителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФизЛицо = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
					Значение = "";
				Иначе
					Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон, РабочийТелефонФизЛица);
					Результат2 = ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
					Если Результат2.Количество() > 0 Тогда
						Значение = Результат2[0].Представление;
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		ИначеЕсли ИмяПоказателя = "АдресЭлПочтыИсп" Тогда
			
			Результат = ПолучитьСУчетомКэша(Кэш, "СведенияОбИсполнителе");
			Если Результат <> Неопределено И Результат.Количество() > 0 Тогда
				
				ФизЛицо = Результат[0].ГлавныйБухгалтер;
				Если НЕ ЗначениеЗаполнено(ФизЛицо) Тогда
					Значение = "";
				Иначе
					Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
					Результат2 = ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
					Если Результат2.Количество() > 0 Тогда
						Значение = Результат2[0].Представление;
					Иначе
						Значение = "";
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Значение = "";
			КонецЕсли;
			
		Иначе
			
			Значение = "";// Если вернуть строку - больше шансов угадать, так как большинство сведений - строковые.
			
		КонецЕсли;
		
		ОргСведения.Вставить(ИмяПоказателя, Значение);
		
	КонецЦикла;
	
	Возврат ОргСведения;
	
КонецФункции

// Процедура заполняет список используемых регламентированных отчетов.
//
Процедура ЗаполнитьСписокРегламентированныхОтчетов(СписокРегламентированныхОтчетов) Экспорт
	
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетРасчетПоСтраховымВзносам");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчет4ФСС");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетРСВ1");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетРВ3");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчет6НДФЛ");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистикаФормаП4");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистикаПрочиеФормы");
	СписокРегламентированныхОтчетов.Добавить("РегламентированныйОтчетСтатистикаФормаП4НЗ");
	
КонецПроцедуры

// Процедура заполняет структуру показателей.
// Ключ структуры - идентификатор показателя.
// Значение структуры - массив из двух элементов:
// 	- признак автозаполнения показателя,
//	- признак расшифровки показателя.
//
// Параметры:
// 	ПоказателиОтчета - структура показателей отчета,
// 	ИДОтчета         - идентификатор отчета,
//	ИДРедакцииОтчета - идентификатор редакции формы отчета.
//  ПараметрыОтчета  - Структура - структура параметров отчета.
//
Процедура ЗаполнитьПоказателиРегламентированногоОтчета(ПоказателиОтчета, ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета = Неопределено) Экспорт
	
	Если ИДОтчета = "РегламентированныйОтчетРСВ1" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РСВ1_2011Кв1(ПоказателиОтчета);
			КадровыйУчет.ОписаниеПоказателей_РСВ1_2011Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2012Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РСВ1_2012Кв1(ПоказателиОтчета);
			КадровыйУчет.ОписаниеПоказателей_РСВ1_2012Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2013Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РСВ1_2013Кв1(ПоказателиОтчета);
			КадровыйУчет.ОписаниеПоказателей_РСВ1_2013Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2014Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РСВ1_2014Кв1(ПоказателиОтчета);
			КадровыйУчет.ОписаниеПоказателей_РСВ1_2014Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РСВ1_2015Кв1(ПоказателиОтчета);
			КадровыйУчет.ОписаниеПоказателей_РСВ1_2015Кв1(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетРасчетПоСтраховымВзносам" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РСВ_2017Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_РСВ_2017Кв1(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетРВ3" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв4" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РВ3_2011Кв4(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015Кв3" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_РВ3_2015Кв3(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчет4ФСС" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2011Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2011Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2012Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2012Кв3" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2012Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2012Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2013Кв2" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2012Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2013Кв2(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2014Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2014Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2013Кв2(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015Кв1" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2015Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2015Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2016Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2016Кв3" Тогда	
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2016Кв1(ПоказателиОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2016Кв1(ПоказателиОтчета);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2017Кв3" Тогда
			УчетСтраховыхВзносов.ОписаниеПоказателей_4ФСС_2017Кв1(ПоказателиОтчета, ПараметрыОтчета);
			УчетПособийСоциальногоСтрахования.ОписаниеПоказателей_4ФСС_2017Кв1(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2007Кв1" Тогда
			КадровыйУчет.ОписаниеПоказателей_СреднесписочнаяЧисленностьРаботников_2007Кв1(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчет6НДФЛ" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2016Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2017Кв4" Тогда
			УчетНДФЛ.ОписаниеПоказателей_6НДФЛ_2016Кв1(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСтатистикаФормаП4" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2013Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2014Кв1"
			Или ИДРедакцииОтчета = "ФормаОтчета2017Кв1"
			Или ИДРедакцииОтчета = "ФормаОтчета2018Кв1" Тогда
			СтатистикаПерсонала.ОписаниеПоказателей_СтатистикаФормаП4_2013Кв1(ПоказателиОтчета);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСтатистикаФормаП4НЗ" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2015Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2017Кв1"
			Или ИДРедакцииОтчета = "ФормаОтчета2018Кв1" Тогда
			СтатистикаПерсонала.ОписаниеПоказателей_СтатистикаФормаП4НЗ_2015Кв1(ПоказателиОтчета);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура заполняет переданную в виде контейнера структуру данных отчета.
//
Процедура ЗаполнитьРегламентированныйОтчет(ИДОтчета, ИДРедакцииОтчета, ПараметрыОтчета, Контейнер) Экспорт
	
	Если ИДОтчета = "РегламентированныйОтчетРСВ1" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РСВ1_2011Кв1(ПараметрыОтчета, Контейнер);
			КадровыйУчет.ЗначенияПоказателей_РСВ1_2011Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2012Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РСВ1_2012Кв1(ПараметрыОтчета, Контейнер);
			КадровыйУчет.ЗначенияПоказателей_РСВ1_2012Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2013Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РСВ1_2013Кв1(ПараметрыОтчета, Контейнер);
			КадровыйУчет.ЗначенияПоказателей_РСВ1_2013Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2014Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РСВ1_2014Кв1(ПараметрыОтчета, Контейнер);
			КадровыйУчет.ЗначенияПоказателей_РСВ1_2014Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РСВ1_2015Кв1(ПараметрыОтчета, Контейнер);
			КадровыйУчет.ЗначенияПоказателей_РСВ1_2015Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетРасчетПоСтраховымВзносам" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РСВ_2017Кв1(ПараметрыОтчета, Контейнер);
			УчетПособийСоциальногоСтрахования.ЗначенияПоказателей_РСВ_2017Кв1(ПараметрыОтчета, Контейнер);
			ПоместитьВоВременноеХранилище(Новый Структура("Контейнер", Контейнер), ПараметрыОтчета.АдресВоВременномХранилище);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетРВ3" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв4" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РВ3_2011Кв4(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015Кв3" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_РВ3_2015Кв3(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчет4ФСС" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2011Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_4ФСС_2011Кв1(ПараметрыОтчета, Контейнер);
			УчетПособийСоциальногоСтрахования.ЗначенияПоказателей_4ФСС_2011Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2012Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2012Кв3"
			Или ИДРедакцииОтчета = "ФормаОтчета2013Кв2" 
			Или ИДРедакцииОтчета = "ФормаОтчета2014Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_4ФСС_2012Кв1(ПараметрыОтчета, Контейнер);
			УчетПособийСоциальногоСтрахования.ЗначенияПоказателей_4ФСС_2012Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2015Кв1" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_4ФСС_2015Кв1(ПараметрыОтчета, Контейнер);
			УчетПособийСоциальногоСтрахования.ЗначенияПоказателей_4ФСС_2015Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2016Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2016Кв3" Тогда	
			УчетСтраховыхВзносов.ЗначенияПоказателей_4ФСС_2016Кв1(ПараметрыОтчета, Контейнер);
			УчетПособийСоциальногоСтрахования.ЗначенияПоказателей_4ФСС_2016Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2017Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2017Кв3" Тогда
			УчетСтраховыхВзносов.ЗначенияПоказателей_4ФСС_2017Кв1(ПараметрыОтчета, Контейнер);
			УчетПособийСоциальногоСтрахования.ЗначенияПоказателей_4ФСС_2017Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСведенияОСреднесписочнойЧисленностиРаботников" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2007Кв1" Тогда
			КадровыйУчет.ЗначенияПоказателей_СреднесписочнаяЧисленностьРаботников_2007Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчет6НДФЛ" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2016Кв1" Или ИДРедакцииОтчета = "ФормаОтчета2017Кв4" Тогда
			УчетНДФЛ.ЗначенияПоказателей_6НДФЛ_2016Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСтатистикаФормаП4" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2013Кв1"
			Или ИДРедакцииОтчета = "ФормаОтчета2014Кв1" Тогда
			СтатистикаПерсонала.ЗначенияПоказателей_СтатистикаФормаП4_2013Кв1(ПараметрыОтчета, Контейнер);
		ИначеЕсли ИДРедакцииОтчета = "ФормаОтчета2017Кв1"
			Или ИДРедакцииОтчета = "ФормаОтчета2018Кв1" Тогда
			СтатистикаПерсонала.ЗначенияПоказателей_СтатистикаФормаП4_2017Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	ИначеЕсли ИДОтчета = "РегламентированныйОтчетСтатистикаФормаП4НЗ" Тогда
		Если ИДРедакцииОтчета = "ФормаОтчета2015Кв1" 
			Или ИДРедакцииОтчета = "ФормаОтчета2017Кв1"
			Или ИДРедакцииОтчета = "ФормаОтчета2018Кв1" Тогда
			СтатистикаПерсонала.ЗначенияПоказателей_СтатистикаФормаП4НЗ_2015Кв1(ПараметрыОтчета, Контейнер);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Процедура переопределяет свойства объекта, с которыми он будет отображен в форме Отчетность.
// Параметры:
//  СвойстваОбъектов  - ТаблицаЗначений - (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность).
Процедура ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов) Экспорт
	ПерсонифицированныйУчет.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов);
	УчетНДФЛ.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов);
	ПрямыеВыплатыПособийСоциальногоСтрахования.ОпределитьСвойстваОбъектовДляОтображенииВФормеОтчетность(СвойстваОбъектов);
КонецПроцедуры

// Определяет свойства, касающиеся общих свойств объектов конфигураций-потребителей для отображения в форме Отчетность
// и возможности создания новый объектов из формы Отчетность.
//
// Параметры:
//  ТаблицаОписания  - ТаблицаЗначений -  (см. РегламентированнаяОтчетностьПереопределяемый.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности).
//		
Процедура ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания) Экспорт
	ПерсонифицированныйУчет.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);
	УчетНДФЛ.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);
	ПрямыеВыплатыПособийСоциальногоСтрахования.ОпределитьТаблицуОписанияОбъектовРегламентированнойОтчетности(ТаблицаОписания);
КонецПроцедуры

#КонецОбласти

#Область Печать

// Определяет объекты, в которых есть процедура ДобавитьКомандыПечати().
// Подробнее см. УправлениеПечатьюПереопределяемый.
//
// Параметры:
//  СписокОбъектов - Массив - список менеджеров объектов.
//
Процедура ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов) Экспорт
	
	СписокОбъектов.Добавить(Справочники.Организации);
	СписокОбъектов.Добавить(Справочники.Сотрудники);
	СписокОбъектов.Добавить(Справочники.ФизическиеЛица);
	СписокОбъектов.Добавить(Документы.АвансовыйПлатежИностранцаПоНДФЛ);
	СписокОбъектов.Добавить(Документы.АктПроверкиСтраховыхВзносов);
	СписокОбъектов.Добавить(Документы.БольничныйЛист);
	СписокОбъектов.Добавить(Документы.ВедомостьНаВыплатуЗарплатыВБанк);
	СписокОбъектов.Добавить(Документы.ВедомостьНаВыплатуЗарплатыВКассу);
	СписокОбъектов.Добавить(Документы.ВедомостьУплатыАДВ_11);
	СписокОбъектов.Добавить(Документы.ВозвратНДФЛ);
	СписокОбъектов.Добавить(Документы.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников);
	СписокОбъектов.Добавить(Документы.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников);
	СписокОбъектов.Добавить(Документы.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов);
	СписокОбъектов.Добавить(Документы.ЗаявлениеВФССОВозмещенииРасходовНаПогребение);
	СписокОбъектов.Добавить(Документы.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ);
	СписокОбъектов.Добавить(Документы.ЗаявлениеСотрудникаНаВыплатуПособия);
	СписокОбъектов.Добавить(Документы.ИсходящаяСправкаОЗаработкеДляРасчетаПособий);
	СписокОбъектов.Добавить(Документы.НачислениеЗарплаты);
	СписокОбъектов.Добавить(Документы.ОперацияНалоговогоУчетаПоНДФЛ);
	СписокОбъектов.Добавить(Документы.ОперацияУчетаПоСтраховымВзносам);
	СписокОбъектов.Добавить(Документы.ОписьЗаявленийСотрудниковНаВыплатуПособий);
	СписокОбъектов.Добавить(Документы.ОписьОДВ_1);
	СписокОбъектов.Добавить(Документы.ОписьПачекСЗВ_6);
	СписокОбъектов.Добавить(Документы.Отпуск);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовАДВ_1);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовАДВ_2);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовАДВ_3);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовДСВ_1);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовСЗВ_6_1);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовСЗВ_6_3);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовСЗВ_6_4);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовСЗВ_К);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовСПВ_1);
	СписокОбъектов.Добавить(Документы.ПачкаДокументовСПВ_2);
	СписокОбъектов.Добавить(Документы.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ);
	СписокОбъектов.Добавить(Документы.СведенияОЗастрахованныхЛицахСЗВ_М);
	СписокОбъектов.Добавить(Документы.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ);
	СписокОбъектов.Добавить(Документы.ПачкаРазделов6РасчетаРСВ_1);
	СписокОбъектов.Добавить(Документы.ПерерасчетНДФЛ);
	СписокОбъектов.Добавить(Документы.ПерерасчетСтраховыхВзносов);
	СписокОбъектов.Добавить(Документы.ПодтверждениеЗачисленияЗарплаты);
	СписокОбъектов.Добавить(Документы.ПодтверждениеОткрытияЛицевыхСчетовСотрудников);
	СписокОбъектов.Добавить(Документы.ПрекращениеСтандартныхВычетовНДФЛ);
	СписокОбъектов.Добавить(Документы.РеестрДанныхЭЛНЗаполняемыхРаботодателем);
	СписокОбъектов.Добавить(Документы.РеестрДСВ_3);
	СписокОбъектов.Добавить(Документы.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий);
	СписокОбъектов.Добавить(Документы.РеестрСЗВ_6_2);
	СписокОбъектов.Добавить(Документы.СправкаНДФЛ);
	СписокОбъектов.Добавить(Документы.СправкиНДФЛДляПередачиВНалоговыйОрган);
	СписокОбъектов.Добавить(Документы.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ);
	СписокОбъектов.Добавить(Документы.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ);
	СписокОбъектов.Добавить(Документы.ПриемНаРаботу);
	СписокОбъектов.Добавить(Документы.КадровыйПеревод);
	СписокОбъектов.Добавить(Документы.Увольнение);
	
	// Раздел ОбъектыБазовойРеализации
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПодсистемы.ОбъектыБазовойРеализации") Тогда
		МодульОбъектыБазовойРеализации = ОбщегоНазначения.ОбщийМодуль("ЗарплатаКадрыОбъектыБазовойРеализации");
		МодульОбъектыБазовойРеализации.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.УчетДепонированнойЗарплаты") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("УчетДепонированнойЗарплаты");
		Модуль.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РасчетЗарплатыДляНебольшихОрганизаций") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РасчетЗарплатыДляНебольшихОрганизаций");
		Модуль.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОценочныеОбязательстваЗарплатаКадры") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РезервОтпусков");
		Модуль.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.БухучетХозрасчетныхОрганизаций") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("БухучетХозрасчетныхОрганизаций");
		Модуль.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ВнешниеХозяйственныеОперации.ВзаиморасчетыССотрудникамиВХО") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("ВзаиморасчетыССотрудникамиВХО");
		Модуль.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.РегламентированнаяОтчетность") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("РегламентированнаяОтчетностьПриложения");
		Модуль.ПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиОбновленияИнформационнойБазы

Процедура ОбновитьДанныеДляУчетаСтраховыхВзносовВРазрезеНачислений() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НачисленияУдержанияПоСотрудникам.Период,
	|	НачисленияУдержанияПоСотрудникам.Регистратор КАК Регистратор,
	|	НачисленияУдержанияПоСотрудникам.НомерСтроки КАК НомерСтроки,
	|	НачисленияУдержанияПоСотрудникам.Организация,
	|	НачисленияУдержанияПоСотрудникам.ФизическоеЛицо,
	|	НачисленияУдержанияПоСотрудникам.Сотрудник,
	|	НачисленияУдержанияПоСотрудникам.Подразделение,
	|	НачисленияУдержанияПоСотрудникам.НачислениеУдержание,
	|	НачисленияУдержанияПоСотрудникам.Сумма,
	|	НачисленияУдержанияПоСотрудникам.УдалитьОтработаноДней,
	|	НачисленияУдержанияПоСотрудникам.УдалитьОтработаноЧасов,
	|	НачисленияУдержанияПоСотрудникам.УдалитьОплаченоДней,
	|	НачисленияУдержанияПоСотрудникам.УдалитьОплаченоЧасов,
	|	НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты,
	|	НачисленияУдержанияПоСотрудникам.ПериодДействия,
	|	НачисленияУдержанияПоСотрудникам.ДокументОснование,
	|	НачисленияУдержанияПоСотрудникам.Контрагент,
	|	ВЫБОР
	|		КОГДА НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено)
	|			ТОГДА НАЧАЛОПЕРИОДА(НачисленияУдержанияПоСотрудникам.Период, МЕСЯЦ)
	|		ИНАЧЕ НачисленияУдержанияПоСотрудникам.Период
	|	КОНЕЦ КАК ДатаНачала,
	|	НачисленияУдержанияПоСотрудникам.ТерриторияВыполненияРаботВОрганизации
	|ИЗ
	|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	|ГДЕ
	|	НачисленияУдержанияПоСотрудникам.Регистратор В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				НачисленияУдержанияПоСотрудникам.Регистратор
	|			ИЗ
	|				РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
	|			ГДЕ
	|				НачисленияУдержанияПоСотрудникам.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И НачисленияУдержанияПоСотрудникам.ГруппаНачисленияУдержанияВыплаты = ЗНАЧЕНИЕ(Перечисление.ГруппыНачисленияУдержанияВыплаты.Начислено))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		НаборЗаписей = РегистрыНакопления.НачисленияУдержанияПоСотрудникам.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СведенияОДоходахСтраховыеВзносы.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТРегистраторы
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
	|ГДЕ
	|	СведенияОДоходахСтраховыеВзносы.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Начисления.Сотрудник,
	|	МАКСИМУМ(Начисления.Подразделение) КАК Подразделение,
	|	Начисления.Начисление,
	|	Начисления.Ссылка
	|ПОМЕСТИТЬ ВТПодразделения
	|ИЗ
	|	Документ.НачислениеЗарплаты.Начисления КАК Начисления
	|ГДЕ
	|	Начисления.Ссылка В
	|			(ВЫБРАТЬ
	|				Регистраторы.Регистратор
	|			ИЗ
	|				ВТРегистраторы КАК Регистраторы)
	|
	|СГРУППИРОВАТЬ ПО
	|	Начисления.Начисление,
	|	Начисления.Сотрудник,
	|	Начисления.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОДоходахСтраховыеВзносы.Период,
	|	СведенияОДоходахСтраховыеВзносы.Регистратор КАК Регистратор,
	|	СведенияОДоходахСтраховыеВзносы.НомерСтроки КАК НомерСтроки,
	|	СведенияОДоходахСтраховыеВзносы.Организация,
	|	СведенияОДоходахСтраховыеВзносы.ГоловнаяОрганизация,
	|	СведенияОДоходахСтраховыеВзносы.ВидДохода,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяЕНВД,
	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомФармацевта,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуЛетчикам,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиНаДоплатуШахтерам,
	|	СведенияОДоходахСтраховыеВзносы.ЯвляетсяДоходомЧленаЭкипажаСуднаПодФлагомРФ,
	|	СведенияОДоходахСтраховыеВзносы.ОблагаетсяВзносамиЗаЗанятыхНаРаботахСДосрочнойПенсией,
	|	СведенияОДоходахСтраховыеВзносы.ФизическоеЛицо,
	|	СведенияОДоходахСтраховыеВзносы.Сумма,
	|	СведенияОДоходахСтраховыеВзносы.Скидка,
	|	СведенияОДоходахСтраховыеВзносы.Сотрудник,
	|	СведенияОДоходахСтраховыеВзносы.Начисление,
	|	ВЫБОР
	|		КОГДА СведенияОДоходахСтраховыеВзносы.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|			ТОГДА ЕСТЬNULL(Подразделения.Подразделение, ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
	|		ИНАЧЕ СведенияОДоходахСтраховыеВзносы.Подразделение
	|	КОНЕЦ КАК Подразделение,
	|	НАЧАЛОПЕРИОДА(СведенияОДоходахСтраховыеВзносы.Период, МЕСЯЦ) КАК ДатаНачала
	|ИЗ
	|	РегистрНакопления.СведенияОДоходахСтраховыеВзносы КАК СведенияОДоходахСтраховыеВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПодразделения КАК Подразделения
	|		ПО СведенияОДоходахСтраховыеВзносы.Регистратор = Подразделения.Ссылка
	|			И СведенияОДоходахСтраховыеВзносы.Сотрудник = Подразделения.Сотрудник
	|			И СведенияОДоходахСтраховыеВзносы.Начисление = Подразделения.Начисление
	|ГДЕ
	|	СведенияОДоходахСтраховыеВзносы.Регистратор В
	|			(ВЫБРАТЬ
	|				Регистраторы.Регистратор
	|			ИЗ
	|				ВТРегистраторы КАК Регистраторы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Регистратор,
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
		НаборЗаписей = РегистрыНакопления.СведенияОДоходахСтраховыеВзносы.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Выборка.Регистратор);
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		НаборЗаписей.Записать();
	КонецЦикла;

	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.Организация,
	|	НАЧАЛОПЕРИОДА(ИсчисленныеСтраховыеВзносы.Период, МЕСЯЦ) КАК Месяц
	|ПОМЕСТИТЬ ВТВсеРегистраторы
	|ИЗ
	|	РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК ИсчисленныеСтраховыеВзносы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Регистраторы.Регистратор КАК Регистратор,
	|	Регистраторы.Месяц КАК Месяц,
	|	Регистраторы.Организация
	|ПОМЕСТИТЬ ВТРегистраторыКОбработке
	|ИЗ
	|	ВТВсеРегистраторы КАК Регистраторы
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СтраховыеВзносыПоФизическимЛицам КАК СтраховыеВзносыПоФизическимЛицам
	|		ПО Регистраторы.Регистратор = СтраховыеВзносыПоФизическимЛицам.Регистратор
	|ГДЕ
	|	СтраховыеВзносыПоФизическимЛицам.ОблагаетсяЕНВД ЕСТЬ NULL 
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсчисленныеСтраховыеВзносы.Регистратор,
	|	ИсчисленныеСтраховыеВзносы.ФизическоеЛицо,
	|	ИсчисленныеСтраховыеВзносы.Период,
	|	ИсчисленныеСтраховыеВзносы.Организация
	|ПОМЕСТИТЬ ВТФизическиеЛицаКОбработке
	|ИЗ
	|	РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК ИсчисленныеСтраховыеВзносы
	|ГДЕ
	|	ИсчисленныеСтраховыеВзносы.Регистратор В
	|			(ВЫБРАТЬ
	|				ВТРегистраторыКОбработке.Регистратор
	|			ИЗ
	|				ВТРегистраторыКОбработке)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсчисленныеСтраховыеВзносы.Регистратор КАК Регистратор,
	|	НАЧАЛОПЕРИОДА(ИсчисленныеСтраховыеВзносы.Период, МЕСЯЦ) КАК Месяц,
	|	ИсчисленныеСтраховыеВзносы.Организация КАК Организация
	|ИЗ
	|	РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК ИсчисленныеСтраховыеВзносы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТФизическиеЛицаКОбработке КАК ФизическиеЛицаКОбработке
	|		ПО ИсчисленныеСтраховыеВзносы.Период = ФизическиеЛицаКОбработке.Период
	|			И ИсчисленныеСтраховыеВзносы.ФизическоеЛицо = ФизическиеЛицаКОбработке.ФизическоеЛицо
	|			И (НЕ ИсчисленныеСтраховыеВзносы.Регистратор В
	|					(ВЫБРАТЬ
	|						ВТРегистраторыКОбработке.Регистратор
	|					ИЗ
	|						ВТРегистраторыКОбработке))
	|			И ИсчисленныеСтраховыеВзносы.Организация = ФизическиеЛицаКОбработке.Организация
	|ГДЕ
	|	НЕ ФизическиеЛицаКОбработке.Регистратор ЕСТЬ NULL 
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	РегистраторыКОбработке.Регистратор,
	|	РегистраторыКОбработке.Месяц,
	|	РегистраторыКОбработке.Организация
	|ИЗ
	|	ВТРегистраторыКОбработке КАК РегистраторыКОбработке
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Месяц,
	|	Регистратор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Регистратор");
	ТаблицаДвижений.Колонки.Добавить("Организация");
	ТаблицаДвижений.Колонки.Добавить("Месяц",Новый ОписаниеТипов("Дата"));
	ТаблицаДвижений.Колонки.Добавить("ИсчисленныеСтраховыеВзносы", Новый ОписаниеТипов("ТаблицаЗначений"));
	ТаблицаДвижений.Колонки.Добавить("СведенияОДоходахСтраховыеВзносы", Новый ОписаниеТипов("ТаблицаЗначений"));
	Отбор = Новый Структура("Регистратор");
	Пока Выборка.СледующийПоЗначениюПоля("Организация") Цикл
		
		Пока Выборка.СледующийПоЗначениюПоля("Месяц") Цикл
			
			Пока Выборка.СледующийПоЗначениюПоля("Регистратор") Цикл
				
				Набор = РегистрыНакопления.ИсчисленныеСтраховыеВзносы.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
				Набор.Прочитать();
				ИсчисленныеСтраховыеВзносы = Набор.Выгрузить();
				Набор.Очистить();
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
				
				Набор = РегистрыНакопления.СведенияОДоходахСтраховыеВзносы.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
				Набор.Прочитать();
				СведенияОДоходахСтраховыеВзносы = Набор.Выгрузить();
				Набор.Очистить();
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
				
				НоваяСтрока = ТаблицаДвижений.Добавить();
				НоваяСтрока.Регистратор = Выборка.Регистратор;
				НоваяСтрока.ИсчисленныеСтраховыеВзносы = ИсчисленныеСтраховыеВзносы.Скопировать();
				НоваяСтрока.СведенияОДоходахСтраховыеВзносы = СведенияОДоходахСтраховыеВзносы.Скопировать();
				НоваяСтрока.Организация = Выборка.Организация;
				НоваяСтрока.Месяц = Выборка.Месяц;
				
				Набор = РегистрыНакопления.СтраховыеВзносыПоФизическимЛицам.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Выборка.Регистратор);
				Набор.Очистить();
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
				
			КонецЦикла;
			
			Для каждого СтрокаДанных Из ТаблицаДвижений Цикл
			
				Регистратор = СтрокаДанных.Регистратор;
				ПериодРегистрации = СтрокаДанных.Месяц;
				Организация = СтрокаДанных.Организация;
				
				Отбор.Регистратор = Регистратор;
				НайденныеСтроки = ТаблицаДвижений.НайтиСтроки(Отбор);
				
				Набор = РегистрыНакопления.ИсчисленныеСтраховыеВзносы.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Регистратор);
				Набор.Загрузить(НайденныеСтроки[0].ИсчисленныеСтраховыеВзносы);
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
				
				Набор = РегистрыНакопления.СведенияОДоходахСтраховыеВзносы.СоздатьНаборЗаписей();
				Набор.Отбор.Регистратор.Установить(Регистратор);
				Набор.Загрузить(НайденныеСтроки[0].СведенияОДоходахСтраховыеВзносы);
				Набор.ОбменДанными.Загрузка = Истина;
				Набор.Записать();
				
				Запрос = Новый Запрос;
				Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
				Запрос.УстановитьПараметр("Ссылка", Регистратор);
				
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Начисления.ФизическоеЛицо КАК ФизическоеЛицо
				|ПОМЕСТИТЬ ВТФизическиеЛица
				|ИЗ
				|	РегистрНакопления.ИсчисленныеСтраховыеВзносы КАК Начисления
				|ГДЕ
				|	Начисления.Регистратор = &Ссылка";
				Запрос.Выполнить();
				
				Отказ = Ложь;
				УчетСтраховыхВзносов.СформироватьВТРасширенныеСведенияОВзносах(Организация, ПериодРегистрации, Запрос.МенеджерВременныхТаблиц);
				СтраховыеВзносыПоФизическимЛицам = УчетСтраховыхВзносов.СтраховыеВзносыПоФизическимЛицам(Организация, ПериодРегистрации, Регистратор, Запрос.МенеджерВременныхТаблиц);
				
				НаборЗаписей = РегистрыНакопления.СтраховыеВзносыПоФизическимЛицам.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(Регистратор);
				Для каждого СтрокаДанных Из СтраховыеВзносыПоФизическимЛицам Цикл
					НоваяСтрока = НаборЗаписей.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДанных);
					НоваяСтрока.Организация = Организация;
					НоваяСтрока.Период = ПериодРегистрации;
				КонецЦикла;
				НаборЗаписей.ОбменДанными.Загрузка = Истина;
				НаборЗаписей.Записать();
				
			КонецЦикла;
			
			ТаблицаДвижений.Очистить();
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ЭлектронноеВзаимодействие

// См. ЭлектронноеВзаимодействиеПереопределяемый.ПолучитьСоответствиеСправочников.
Процедура ЭлектронноеВзаимодействиеПриОпределенииСоответствияСправочников(СоответствиеСправочников) Экспорт
	
	СоответствиеСправочников.Вставить("Организации", Метаданные.Справочники.Организации.Имя);
	СоответствиеСправочников.Вставить("Контрагенты", Метаданные.Справочники.Контрагенты.Имя);
	СоответствиеСправочников.Вставить("Банки",       Метаданные.Справочники.КлассификаторБанков.Имя);
	СоответствиеСправочников.Вставить("Валюты",      Метаданные.Справочники.Валюты.Имя);
	
КонецПроцедуры

#КонецОбласти

// См. ЗарплатаКадры.ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений.
Процедура ДобавитьКомандуПереходаКОбработкеРедактированиюЗаконодательныхЗначений(Форма, КоманднаяПанельФормы) Экспорт
	
КонецПроцедуры

// Возникает при регистрации классификаторов, обновляемых автоматически.
//
// Параметры:
//   ТаблицаКлассификаторов - ТаблицаЗначений - См. возвращаемое значение функции ЗарплатаКадры.АвтообновляемыеКлассификаторы.
//
Процедура ПриРегистрацииАвтоообновляемыхКлассификаторов(ТаблицаКлассификаторов) Экспорт
	
	СтрокаТаблицы = ТаблицаКлассификаторов.Добавить();
	СтрокаТаблицы.Идентификатор = "MaxMonthlyInsurancePayout";
	СтрокаТаблицы.ПолноеИмя = "РегистрСведений.МаксимальныйРазмерЕжемесячнойСтраховойВыплаты";
	
	СтрокаТаблицы = ТаблицаКлассификаторов.Добавить();
	СтрокаТаблицы.Идентификатор = "MinMonthlyWage";
	СтрокаТаблицы.ПолноеИмя = "РегистрСведений.МинимальнаяОплатаТрудаРФ";
	
	СтрокаТаблицы = ТаблицаКлассификаторов.Добавить();
	СтрокаТаблицы.Идентификатор = "MaxInsurancePaymentBasis";
	СтрокаТаблицы.ПолноеИмя = "РегистрСведений.ПредельнаяВеличинаБазыСтраховыхВзносов";
	
	СтрокаТаблицы = ТаблицаКлассификаторов.Добавить();
	СтрокаТаблицы.Идентификатор = "PITDeductions";
	СтрокаТаблицы.ПолноеИмя = "РегистрСведений.РазмерВычетовНДФЛ";
	
	СтрокаТаблицы = ТаблицаКлассификаторов.Добавить();
	СтрокаТаблицы.Идентификатор = "InsurancePaymentPercentages";
	СтрокаТаблицы.ПолноеИмя = "РегистрСведений.ТарифыСтраховыхВзносов";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьНачальныеЗначения(ИменаОбъектовМетаданных) Экспорт
	
	Если ПустаяСтрока(ИменаОбъектовМетаданных) Тогда
		ОбрабатываемыеИменаОбъектов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("");
	Иначе
		ОбрабатываемыеИменаОбъектов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИменаОбъектовМетаданных,",", Истина, Истина);
	КонецЕсли;
	
	Для каждого ОбрабатываемоеИмя Из ОбрабатываемыеИменаОбъектов Цикл
		
		// Справочники
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ОснованияУвольнения")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ОснованияУвольнения");
			Справочники.ОснованияУвольнения.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ОснованияУвольнения");
			
		КонецЕсли; 
		
		// УчетНДФЛ
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ВидыВычетовНДФЛ")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыВычетовНДФЛ");
			Справочники.ВидыВычетовНДФЛ.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыВычетовНДФЛ");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ВидыДоходовНДФЛ")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыДоходовНДФЛ");
			Справочники.ВидыДоходовНДФЛ.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыДоходовНДФЛ");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.СтатусыНалогоплательщиковПоНДФЛ")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.СтатусыНалогоплательщиковПоНДФЛ");
			Справочники.СтатусыНалогоплательщиковПоНДФЛ.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.СтатусыНалогоплательщиковПоНДФЛ");
			
		КонецЕсли; 
		
		// УчетСтраховыхВзносов
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ВидыДоходовПоСтраховымВзносам")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыДоходовПоСтраховымВзносам");
			Справочники.ВидыДоходовПоСтраховымВзносам.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыДоходовПоСтраховымВзносам");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ВидыТарифовСтраховыхВзносов")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыТарифовСтраховыхВзносов");
			Справочники.ВидыТарифовСтраховыхВзносов.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыТарифовСтраховыхВзносов");
			
		КонецЕсли; 
		
		// ПерсонифицированныйУчет
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ТерриториальныеУсловияПФР")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ТерриториальныеУсловияПФР");
			Справочники.ТерриториальныеУсловияПФР.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ТерриториальныеУсловияПФР");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ОснованияДосрочногоНазначенияПенсии")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ОснованияДосрочногоНазначенияПенсии");
			Справочники.ОснованияДосрочногоНазначенияПенсии.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ОснованияДосрочногоНазначенияПенсии");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК");
			Справочники.ОснованияДосрочногоНазначенияПенсии.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ОснованияДосрочногоНазначенияПенсииДляСЗВК");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК");
			Справочники.ВидыОбщественноПолезнойДеятельностиСЗВК.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ВидыОбщественноПолезнойДеятельностиСЗВК");
			
		КонецЕсли; 
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("Справочник.ПараметрыИсчисляемогоСтраховогоСтажа")  Тогда
			
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ПараметрыИсчисляемогоСтраховогоСтажа");
			Справочники.ПараметрыИсчисляемогоСтраховогоСтажа.НачальноеЗаполнение();
			ПроверитьСправочникНаЗадвоенныеЗначения("Справочник.ПараметрыИсчисляемогоСтраховогоСтажа");
			
		КонецЕсли; 
		
		// Регистры сведений
		
		// УчетНДФЛ
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("РегистрСведений.ВычетыПоДоходамНДФЛ") Тогда
			РегистрыСведений.ВычетыПоДоходамНДФЛ.НачальноеЗаполнение();
		КонецЕсли;
		
		// УчетСтраховыхВзносов
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("РегистрСведений.СтраховыеВзносыСкидкиКДоходам") Тогда
			РегистрыСведений.СтраховыеВзносыСкидкиКДоходам.НачальноеЗаполнение();
		КонецЕсли;
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("РегистрСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией") Тогда
			РегистрыСведений.ТарифыВзносовЗаЗанятыхНаРаботахСДосрочнойПенсией.НачальноеЗаполнение();
		КонецЕсли;
		
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("РегистрСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда") Тогда
			РегистрыСведений.ТарифыВзносовПоРезультатамСпециальнойОценкиУсловийТруда.НачальноеЗаполнение();
		КонецЕсли;
		
		// ПерсонифицированныйУчет
		Если ПустаяСтрока(ОбрабатываемоеИмя) ИЛИ ВРег(ОбрабатываемоеИмя) =  ВРег("РегистрСведений.ДопустимыеСочетанияКодовГруппСтажа") Тогда
			РегистрыСведений.ДопустимыеСочетанияКодовГруппСтажа.НачальноеЗаполнение();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСправочникНаЗадвоенныеЗначения(ПолноеИмяОбъектаМетаданных)
	
	МетаданныеСправочника = Метаданные.НайтиПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	УникальностьКодов = Ложь;
	УникальностьНаименований = Ложь;
	Если МетаданныеСправочника.ДлинаКода > 0 И МетаданныеСправочника.КонтрольУникальности Тогда
		УникальностьКодов = Истина;
	ИначеЕсли МетаданныеСправочника.ДлинаНаименования > 0 Тогда
		УникальностьНаименований = Истина;
	КонецЕсли; 
	
	Если УникальностьКодов ИЛИ УникальностьНаименований Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Справочник.Ссылка) КАК Ссылка,
			|	Справочник.Код КАК КлючУникальности
			|ПОМЕСТИТЬ ВТКоличествоСсылок
			|ИЗ
			|	ПолноеИмяСправочника КАК Справочник
			|
			|СГРУППИРОВАТЬ ПО
			|	Справочник.Код
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	КоличествоСсылок.КлючУникальности
			|ПОМЕСТИТЬ ВТЗадвоенныеКлючи
			|ИЗ
			|	ВТКоличествоСсылок КАК КоличествоСсылок
			|ГДЕ
			|	КоличествоСсылок.Ссылка > 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЗадвоенныеКлючи.КлючУникальности КАК КлючУникальности,
			|	Справочник.Ссылка КАК Ссылка,
			|	Справочник.Предопределенный КАК Предопределенный
			|ИЗ
			|	ВТЗадвоенныеКлючи КАК ЗадвоенныеКлючи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПолноеИмяСправочника КАК Справочник
			|		ПО ЗадвоенныеКлючи.КлючУникальности = Справочник.Код
			|
			|УПОРЯДОЧИТЬ ПО
			|	КлючУникальности,
			|	Предопределенный УБЫВ,
			|	Ссылка";
			
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПолноеИмяСправочника", "Справочник." + МетаданныеСправочника.Имя);
		
		Если УникальностьНаименований Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Справочник.Код", "Справочник.Наименование");
		КонецЕсли; 
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			НайденныеСсылки = НайтиПоСсылкам(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
			
			ТаблицаСсылок = НайденныеСсылки.Скопировать(, "Ссылка");
			ТаблицаСсылок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
			ТаблицаСсылок.ЗаполнитьЗначения(1, "Количество");
			ТаблицаСсылок.Свернуть("Ссылка", "Количество");
			
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.СледующийПоЗначениюПоля("КлючУникальности") Цикл
				
				ОставляемаяСсылка = Неопределено;
				КоличествоСсылок = 0;
				ОставляемаяСсылкаПредопределенная = Ложь;
				
				СписокСсылок = Новый Массив;
				Пока Выборка.Следующий() Цикл
					
					СписокСсылок.Добавить(Выборка.Ссылка);
					ТаблицаСсылок.Найти(Выборка.Ссылка, "Ссылка");
					Если КоличествоСсылок < ТаблицаСсылок.Количество() Тогда
						
						Если Выборка.Предопределенный ИЛИ НЕ ОставляемаяСсылкаПредопределенная Тогда
							ОставляемаяСсылкаПредопределенная = Выборка.Предопределенный;
							ОставляемаяСсылка = Выборка.Ссылка;
							КоличествоСсылок = ТаблицаСсылок.Количество();
						КонецЕсли; 
						
					ИначеЕсли ОставляемаяСсылка = Неопределено Тогда 
						ОставляемаяСсылкаПредопределенная = Выборка.Предопределенный;
						ОставляемаяСсылка = Выборка.Ссылка;
					КонецЕсли; 
					
				КонецЦикла; 
				
				ПарыЗамен = Новый Соответствие;
				Для каждого СсылкаИзСписка Из СписокСсылок Цикл
					
					ОбъектСсылки = СсылкаИзСписка.ПолучитьОбъект();
					
					Если СсылкаИзСписка = ОставляемаяСсылка Тогда
						
						Если ОбъектСсылки.ПометкаУдаления Тогда
							ОбъектСсылки.УстановитьПометкуУдаления(Ложь);
						КонецЕсли; 
						
						Продолжить;
						
					КонецЕсли; 
					
					ОбъектСсылки.ИмяПредопределенныхДанных = "";
					ОбъектСсылки.ПометкаУдаления = Истина;
					ОбъектСсылки.ОбменДанными.Загрузка = Истина;
					ОбъектСсылки.Записать();
					
					ПарыЗамен.Вставить(СсылкаИзСписка, ОставляемаяСсылка);
					
				КонецЦикла;
				
				Если ПарыЗамен.Количество() > 0 Тогда
					
					ПараметрыЗамены = Новый Структура;
					ПараметрыЗамены.Вставить("СпособУдаления", "Пометка");
					ПараметрыЗамены.Вставить("ВключатьБизнесЛогику", Ложь);
					ПараметрыЗамены.Вставить("ЗаменаПарыВТранзакции", Ложь);
					ПараметрыЗамены.Вставить("ПривилегированнаяЗапись", Истина);
					
					ТаблицаРезультата = ОбщегоНазначения.ЗаменитьСсылки(ПарыЗамен, ПараметрыЗамены);
					Для каждого СтрокаРезультата Из ТаблицаРезультата Цикл
						
						СообщитьОбОшибке = Истина;
						Если СтрокаРезультата.ТипОшибки = "ОшибкаЗаписи" Тогда
							ОбъектОшибки = СтрокаРезультата.ОбъектОшибки;
							ОбъектОшибки.ДополнительныеСвойства.Вставить("ОтключитьПроверкуДатыЗапретаИзменения", Истина);
							Попытка
								ОбъектОшибки.Записать();
								СообщитьОбОшибке = Ложь;
							Исключение
								
							КонецПопытки;
						КонецЕсли; 
						
						Если СообщитьОбОшибке Тогда
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаРезультата.ТекстОшибки);
						КонецЕсли; 
						
					КонецЦикла;
					
				КонецЕсли; 
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПроверитьВозможностьСменыГоловнойОрганизации(Организация, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НачисленияУдержанияПоСотрудникам.Организация
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам КАК НачисленияУдержанияПоСотрудникам
		|ГДЕ
		|	НачисленияУдержанияПоСотрудникам.Организация = &Организация";
		
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='По %1 производилось начисление/удержание зарплаты.
				|Что бы изменить головную организацию, необходимо отменить проведение этих документов.'"),
			Организация);
			
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			Организация,
			"ГоловнаяОрганизация",
			"Объект",
			Отказ);
		
	КонецЕсли; 
		
	Если ПолучитьФункциональнуюОпцию("ИспользоватьКадровыйУчет") Тогда
		
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	КадроваяИсторияСотрудников.ГоловнаяОрганизация
			|ИЗ
			|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
			|ГДЕ
			|	КадроваяИсторияСотрудников.Организация = &Организация
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	КадроваяИсторияСотрудников.ГоловнаяОрганизация
			|ИЗ
			|	РегистрСведений.КадроваяИсторияСотрудников КАК КадроваяИсторияСотрудников
			|ГДЕ
			|	КадроваяИсторияСотрудников.ГоловнаяОрганизация = &Организация";
			
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru='В %1 произведен прием на работу сотрудников.
					|Что бы изменить головную организацию, необходимо отменить проведение этих документов.'"),
				Организация);
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,
				Организация,
				"ГоловнаяОрганизация",
				"Объект",
				Отказ);
			
		КонецЕсли; 
			
	КонецЕсли; 	
	
КонецПроцедуры

Функция ОписанияРегистровСодержащихРегистрацииВНалоговомОргане() Экспорт
	
	МассивОписаний = Новый Массив;
	
	ЗарплатаКадры.ДобавитьОписаниеРегистровСодержащихРегистрацииВНалоговомОргане(МассивОписаний,
		"РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ", "ИсследуемыйРегистр.МесяцНалоговогоПериода");
	
	ЗарплатаКадры.ДобавитьОписаниеРегистровСодержащихРегистрацииВНалоговомОргане(МассивОписаний,
		"РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ", "
			|ВЫБОР
			|	КОГДА ИсследуемыйРегистр.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
			|		ТОГДА ИсследуемыйРегистр.МесяцНалоговогоПериода
			|	ИНАЧЕ ВЫБОР
			|		КОГДА ИсследуемыйРегистр.Период > ИсследуемыйРегистр.МесяцНалоговогоПериода
			|			ТОГДА ИсследуемыйРегистр.Период
			|		ИНАЧЕ ИсследуемыйРегистр.МесяцНалоговогоПериода
			|	КОНЕЦ
			|КОНЕЦ");
	
	ЗарплатаКадры.ДобавитьОписаниеРегистровСодержащихРегистрацииВНалоговомОргане(МассивОписаний,
		"РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ", "ИсследуемыйРегистр.МесяцНалоговогоПериода");
	
	ЗарплатаКадры.ДобавитьОписаниеРегистровСодержащихРегистрацииВНалоговомОргане(МассивОписаний,
		"РегистрНакопления.СведенияОДоходахНДФЛ", "ИсследуемыйРегистр.ДатаПолученияДохода");
	
	ЗарплатаКадры.ДобавитьОписаниеРегистровСодержащихРегистрацииВНалоговомОргане(МассивОписаний,
		"РегистрНакопления.ИмущественныеВычетыНДФЛ", "ИсследуемыйРегистр.Период");
	
	Возврат МассивОписаний;
	
КонецФункции

Функция ПолучитьСУчетомКэша(Кэш, Параметр, ФизЛицо = Неопределено)
	Перем ЗначениеПараметра;
	Перем Ставки;
	
	Если Кэш.Свойство(Параметр, ЗначениеПараметра) Тогда
		Возврат ЗначениеПараметра;
	КонецЕсли;
	
	Если Параметр = "ЮрАдресОрганизации" ИЛИ Параметр = "ФактАдресОрганизации" Тогда
		
		ЭлементАдрес = ?(Параметр = "ЮрАдресОрганизации",Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации , Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);

		Результат = Неопределено;
		
		Для Каждого Элемент Из Кэш.Организация.КонтактнаяИнформация Цикл
			
			Если Элемент.Вид.Наименование = ЭлементАдрес.Наименование Тогда
				
				Результат = Элемент;
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателе" Тогда
		Если Кэш.Организация.Метаданные().Реквизиты.Найти("ИндивидуальныйПредприниматель") <> Неопределено Тогда
			Результат = Новый Массив;
			Результат.Добавить(Новый Структура("ФизическоеЛицо", Кэш.Организация.ИндивидуальныйПредприниматель));
		КонецЕсли;
	ИначеЕсли Параметр = "СведенияОРуководителе" 
		ИЛИ Параметр = "СведенияОБухгалтере"
		ИЛИ Параметр = "СведенияОбИсполнителе" Тогда
		
		ОтветственныеЛицаОрганизации = ЗарплатаКадры.ОтветственныеЛицаОрганизации(Кэш.Организация.Ссылка, "Руководитель,ДолжностьРуководителя,ГлавныйБухгалтер", Кэш.ДатаЗначения);
		Результат = Новый Массив;
		Результат.Добавить(ОтветственныеЛицаОрганизации);
		
	ИначеЕсли Параметр = "ТелефонОрганизации" Тогда
		
		ПоляИсточникаДанных = "КонтактнаяИнформация, Вид";
		ИсточникиДанных = Новый Массив;
		
		ИсточникиДанных.Добавить(
			Новый Структура(ПоляИсточникаДанных,
			Кэш.Организация.КонтактнаяИнформация,
			Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации));
			
		Если Кэш.ПБОЮЛ Тогда
				
			ТелефоныФизлица = Новый Массив;	
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонРабочийФизическиеЛица") Тогда
				ТелефоныФизлица.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица)
			КонецЕсли;
			Если РегламентированнаяОтчетностьКлиентСервер.СвойствоОпределено(Справочники.ВидыКонтактнойИнформации, "ТелефонДомашнийФизическиеЛица") Тогда
				ТелефоныФизлица.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица)
			КонецЕсли;
			
			Для Каждого ТелефонФизлица Из ТелефоныФизлица Цикл 
				ИсточникиДанных.Добавить(
					Новый Структура(ПоляИсточникаДанных,
					Кэш.Организация.ИндивидуальныйПредприниматель.КонтактнаяИнформация,
					ТелефонФизлица));
				КонецЦикла
				
		КонецЕсли;
		
		Результат = Неопределено;
		
		ОтборКонтактов = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Телефон);
		Для Каждого ИсточникДанных Из ИсточникиДанных Цикл
			ОтборКонтактов.Вид = ИсточникДанных.Вид;
			Контакты = ИсточникДанных.КонтактнаяИнформация.НайтиСтроки(ОтборКонтактов);
			Если Контакты.Количество() > 0 Тогда
				Результат = Контакты[0];
				Прервать;
			КонецЕсли;
		КонецЦикла
		
	ИначеЕсли Параметр = "УчетнаяПолитикаНалоговыйУчет" Тогда
		Результат = РегистрыСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(Кэш.ДатаЗначения, Новый Структура("Организация", Кэш.Организация.Ссылка));
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОРуководителеПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОБухгалтереПаспортныеДанные" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеПаспортныеДанные" Тогда
		
		Результат = РегламентированнаяОтчетность.ПолучитьДокФизЛица(ФизЛицо, Кэш.ДатаЗначения);
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеАдрес" 
		ИЛИ Параметр = "СведенияОРуководителеАдрес" 
		ИЛИ Параметр = "СведенияОБухгалтереАдрес" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеАдрес" Тогда
		
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица);
		Результат = ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
		
		Если Результат.Количество() > 0 Тогда
			Результат = Результат[0];
		Иначе
			Результат = Неопределено;
		КонецЕсли;
				
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеАдресПрописки" Тогда
		
		Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица);
		Результат = ФизЛицо.КонтактнаяИнформация.НайтиСтроки(Данные);
		Если Результат.Количество() > 0 Тогда
			Результат = Результат[0];
		Иначе
			Результат = Неопределено;
		КонецЕсли;
		
	ИначеЕсли Параметр = "СведенияОбИндивидуальномПредпринимателеГражданство" 
		ИЛИ Параметр = "СведенияОРуководителеГражданство" 
		ИЛИ Параметр = "СведенияОБухгалтереГражданство" 
		ИЛИ Параметр = "СведенияОУполномоченномПредставителеГражданство" Тогда
		
		Результат = ПолучитьГражданство(ФизЛицо, Кэш.ДатаЗначения);
	КонецЕсли;
				
	Кэш.Вставить(Параметр, Результат);
	Возврат Результат;
	
КонецФункции

Функция АдресВФормате9Запятых(Запись, ВидАдреса)
	
	СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(Запись.ЗначенияПолей, ВидАдреса);
	
	АдресБезКодаСтраны = СокрЛП(СтруктураАдреса.Индекс) + "," + СокрЛП(СтруктураАдреса.Регион) + "," + СокрЛП(СтруктураАдреса.Район) + ","
		+ СокрЛП(СтруктураАдреса.Город) + "," + СокрЛП(СтруктураАдреса.НаселенныйПункт) + "," + СокрЛП(СтруктураАдреса.Улица) + ","
		+ СокрЛП(СтруктураАдреса.Дом) + "," + СокрЛП(СтруктураАдреса.Корпус) + "," + СокрЛП(СтруктураАдреса.Квартира);
	
	Если АдресБезКодаСтраны = ",,,,,,,," Тогда
		Возврат ",,,,,,,,,";
	Иначе
		Возврат "643," + АдресБезКодаСтраны;
	КонецЕсли;
	
КонецФункции

Функция АдресВФорматеXML(Запись, ВидАдреса)
	Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Запись.ЗначенияПолей, Запись.Представление, ВидАдреса);
КонецФункции

Функция АдресВXML(КонтактнаяИнформация, ВидАдреса)
	
	Данные = Новый Структура("Тип, Вид", Перечисления.ТипыКонтактнойИнформации.Адрес, ВидАдреса);
	
	Результат = КонтактнаяИнформация.НайтиСтроки(Данные);
	
	Если Результат.Количество() > 0 Тогда
		Возврат УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(Результат[0].ЗначенияПолей, Результат[0].Представление, ВидАдреса);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьГражданство(ФизЛицо, ДатаЗначения) 
	
	Гражд = РегистрыСведений.ГражданствоФизическихЛиц.СрезПоследних(ДатаЗначения, Новый Структура("ФизическоеЛицо", ФизЛицо));

	Если Гражд.Количество() > 0 Тогда
		Возврат Гражд[0].Страна;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция возвращает имя справочника обособленных подразделений,
// используемого для автоматического заполнения статистической отчетности.
//
// Пример:
//  Возврат "ПодразделенияОрганизаций";
//
Функция ИмяСправочникаОбособленныхПодразделений() Экспорт
	Возврат "ПодразделенияОрганизаций";
КонецФункции

// Функция возвращает имя реквизита справочника подразделений, который
// определяет, является ли подразделение обособленным (в трактовке Росстата).
// Используется для автоматического заполнения статистической отчетности.
//
// Тип реквизита - Булево.
// Если значение реквизита равно Истина - подразделение является обособленным.
// Если значение реквизита равно Ложь - подразделение не является обособленным.
//
// Пример:
//  Возврат "ИмеетНомерТерриториальногоОрганаРосстата";
//
Функция ИмяРеквизитаПризнакаОбособленногоПодразделения() Экспорт
	Возврат "ОбособленноеПодразделение";
КонецФункции

// См. ЗарплатаКадры.ЗарегистрироватьОплатуВедомостей.
Процедура ЗарегистрироватьОплатуВедомостей(ПлатежныйДокумент, Организация, Ведомости, ФизическиеЛица = Неопределено, ДатаОперации = Неопределено, Отказ = Ложь) Экспорт
	
	Если Отказ Тогда
		Возврат
	КонецЕсли;
	
	Если Ведомости.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Если ФизическиеЛица <> Неопределено И ФизическиеЛица.Количество() = 0 Тогда
		Возврат
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОперации) Тогда
		ДатаОперации = ПлатежныйДокумент.Дата
	КонецЕсли;	
	
	ПолученныеВедомости = Новый Массив;  // ведомости из внешнего учета зарплаты
	ВнутренниеВедомости =  Новый Массив; // ведомости на выплату начисленной зарплаты 
	
	МетаданныеВедомостьНаВыплатуЗарплаты = Метаданные.Документы.Найти("ВедомостьНаВыплатуЗарплаты");
	Если МетаданныеВедомостьНаВыплатуЗарплаты = Неопределено Тогда
		// транспортных ведомостей нет, все ведомости выплачивают начисленную зарплату
		ВнутренниеВедомости = Ведомости
	Иначе	
		ТипВедомостьНаВыплатуЗарплаты = Тип("ДокументСсылка." + МетаданныеВедомостьНаВыплатуЗарплаты.Имя);
		Для Каждого Ведомость Из Ведомости Цикл
			Если ТипЗнч(Ведомость) = ТипВедомостьНаВыплатуЗарплаты Тогда
				ПолученныеВедомости.Добавить(Ведомость)
			Иначе
				ВнутренниеВедомости.Добавить(Ведомость)
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	// Для ведомостей, полученных из внешнего учета, регистрируем только факт выдачи денег работнику.
	Если ПолученныеВедомости.Количество() > 0 Тогда
		ВзаиморасчетыССотрудниками.ЗарегистрироватьОплатуВедомостей(ПлатежныйДокумент, Организация, ПолученныеВедомости, ФизическиеЛица, Неопределено, Отказ);
	КонецЕсли;	
	
	Если ВнутренниеВедомости.Количество() = 0 Тогда
		Возврат
	КонецЕсли;	
		
	// Ведомости на выплату начисленной зарплаты регистрируем во всех необходимых учетах.
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Ведомости",		ВнутренниеВедомости);
	
	// Данные ведомостей 	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗарплатаКВыплате.Регистратор КАК Ведомость,
	|	НАЧАЛОПЕРИОДА(ЗарплатаКВыплате.Регистратор.ПериодРегистрации, МЕСЯЦ) КАК ПериодРегистрации,
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплате.Регистратор.СпособВыплаты.ХарактерВыплаты = ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.Зарплата)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОкончательныйРасчет,
	|	ЗарплатаКВыплате.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ЗарплатаКВыплате.ДокументОснование КАК ДокументОснование,
	|	ЗарплатаКВыплате.СтатьяФинансирования КАК СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов КАК СтатьяРасходов,
	|	СУММА(ЗарплатаКВыплате.СуммаКВыплате) КАК СуммаВыплаты
	|ПОМЕСТИТЬ ВТДанныеВедомостей
	|ИЗ
	|	РегистрНакопления.ЗарплатаКВыплате КАК ЗарплатаКВыплате
	|ГДЕ
	|	ЗарплатаКВыплате.Организация = &Организация
	|	И ЗарплатаКВыплате.Регистратор В(&Ведомости)
	|	И &ФизическиеЛица
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗарплатаКВыплате.Регистратор,
	|	НАЧАЛОПЕРИОДА(ЗарплатаКВыплате.Регистратор.ПериодРегистрации, МЕСЯЦ),
	|	ВЫБОР
	|		КОГДА ЗарплатаКВыплате.Регистратор.СпособВыплаты.ХарактерВыплаты = ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.Зарплата)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЗарплатаКВыплате.ФизическоеЛицо,
	|	ЗарплатаКВыплате.ДокументОснование,
	|	ЗарплатаКВыплате.СтатьяФинансирования,
	|	ЗарплатаКВыплате.СтатьяРасходов";
	
	Если ЗначениеЗаполнено(ФизическиеЛица) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ФизическиеЛица", "ЗарплатаКВыплате.ФизическоеЛицо В(&ФизическиеЛица)");
		Запрос.УстановитьПараметр("ФизическиеЛица",	ФизическиеЛица);
	Иначе
		Запрос.УстановитьПараметр("ФизическиеЛица",	Истина);
	КонецЕсли;	
	
	Запрос.Выполнить();
	
	// Регистрация оплаты
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ведомости.Ведомость,
	|	Ведомости.ФизическоеЛицо
	|ИЗ
	|	ВТДанныеВедомостей КАК Ведомости";

	ОплатаВедомостей = Запрос.Выполнить();
	Если ОплатаВедомостей.Пустой() Тогда
		Возврат
	КонецЕсли;	
	ВзаиморасчетыССотрудниками.ЗарегистрироватьОплатуВедомостейДокументом(ПлатежныйДокумент, Отказ, ОплатаВедомостей.Выгрузить());
	
	// Регистрация в бухгалтерских взаиморасчетах
	Если НЕ Отказ Тогда
		ВзаиморасчетыССотрудниками.ЗарегистрироватьОплатуВедомостейВБухгалтерскихВзаиморасчетах(ПлатежныйДокумент, Организация, ВнутренниеВедомости, ФизическиеЛица, ДатаОперации, Отказ);
	КонецЕсли;
	
	// Регистрация удержанного НДФЛ
	Если НЕ Отказ Тогда
		
		// Итоговый характеры выплаты
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(Ведомости.ОкончательныйРасчет) КАК ОкончательныйРасчет
		|ИЗ
		|	ВТДанныеВедомостей КАК Ведомости";
		ОкончательныйРасчет = Запрос.Выполнить().Выгрузить()[0].ОкончательныйРасчет;
		
		// Итоговый период регистрации
		// Это максимальный период регистрации из ведомостей под расчет,
		// а если ведомостей под расчет нет, то просто максимальный из имеющихся.
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	МАКСИМУМ(Ведомости.ПериодРегистрации) КАК ПериодРегистрации
		|ИЗ
		|	ВТДанныеВедомостей КАК Ведомости
		|
		|ГДЕ
		|	&УсловиеНаОкончательныйРасчет";
		Если ОкончательныйРасчет Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаОкончательныйРасчет", "Ведомости.ОкончательныйРасчет = ИСТИНА") 
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеНаОкончательныйРасчет", "ИСТИНА") 
		КонецЕсли;	
		ПериодРегистрации = Запрос.Выполнить().Выгрузить()[0].ПериодРегистрации;
		
		// определение выплат в разрезе физлиц, документов и источников
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ведомости.ФизическоеЛицо КАК ФизическоеЛицо,
		|	Ведомости.ДокументОснование КАК ДокументОснование,
		|	Ведомости.СтатьяФинансирования КАК СтатьяФинансирования,
		|	Ведомости.СтатьяРасходов КАК СтатьяРасходов,
		|	СУММА(Ведомости.СуммаВыплаты) КАК СуммаВыплаты
		|ПОМЕСТИТЬ ВТВыплаты
		|ИЗ
		|	ВТДанныеВедомостей КАК Ведомости
		|
		|СГРУППИРОВАТЬ ПО
		|	Ведомости.ФизическоеЛицо,
		|	Ведомости.ДокументОснование,
		|	Ведомости.СтатьяФинансирования,
		|	Ведомости.СтатьяРасходов";
		Запрос.Выполнить();
		
		// дополняем выплаты их состоянием
		ОписательВТ = 
			ВзаиморасчетыССотрудниками.ОписательВременныхТаблицДляСоздатьВТСостояниеВыплат(
				Запрос.МенеджерВременныхТаблиц, "ВТВыплаты");
		ВзаиморасчетыССотрудниками.СоздатьВТСостояниеВыплат(
			ОписательВТ, Истина, 
			Организация, ПериодРегистрации, 
			ВнутренниеВедомости,
			"ВТСписокСотрудников");
			
		// учет фактической даты получения доходов НДФЛ
		УчетФактическиПолученныхДоходов.ЗарегистрироватьНовуюДатуПолученияДохода(
			ПлатежныйДокумент.Ссылка, 
			ПлатежныйДокумент.Движения, 
			Запрос.МенеджерВременныхТаблиц, 
			ДатаОперации, 
			ДатаОперации, 
			Отказ, 
			Истина);
		
		// регистрация удержания НДФЛ 
		УчетНДФЛ.РассчитатьИЗарегистрироватьУдержанныеНалоги(
			ПлатежныйДокумент.Ссылка, 
			ПлатежныйДокумент.Движения, 
			Отказ, 
			Организация,
			ДатаОперации, 
			Запрос.МенеджерВременныхТаблиц, 
			Ложь, 
			ПериодРегистрации,
			ОкончательныйРасчет);
			
	КонецЕсли;
	
КонецПроцедуры

// Получает код ОКПО обособленного подразделения
// 
// Параметры:
// Подразделение - СправочникСсылка.ПодразделенияОрганизаций
// КодОКПО       - Строка(14) - код ОКПО обособленного подразделения.
Процедура ПолучитьКодОКПОПодразделения(Знач Подразделение, КодОКПО) Экспорт 

КонецПроцедуры

// Получает код органа ФСГС обособленного подразделения
// 
// Параметры:
// Подразделение - СправочникСсылка.ПодразделенияОрганизаций
// КодФСГС       - Строка(5) - код органа ФСГС для подразделения (например, "23-45").
//
Процедура ПолучитьКодОрганаФСГСПодразделения(Подразделение, КодФСГС) Экспорт 

КонецПроцедуры

// Дополнительные настройки списка команд печати.
//
// Параметры:
//  НастройкиСписка - Структура - модификаторы списка команд печати.
//   * МенеджерКомандПечати     - МенеджерОбъекта - менеджер объекта, в котором формируется список команд печати;
//   * АвтоматическоеЗаполнение - Булево - заполнять команды печати из объектов, входящих в состав журнала.
//                                         Значение по умолчанию: Истина.
//
Процедура ПриПолученииНастроекСпискаКомандПечати(НастройкиСписка) Экспорт
	
	Если НастройкиСписка.МенеджерКомандПечати = ЖурналыДокументов.НачислениеЗарплаты Тогда
		НастройкиСписка.АвтоматическоеЗаполнение = Ложь;
	КонецЕсли;
	
КонецПроцедуры

//  Функция возвращает таблицу с состоянием сотрудников на указанную дату
// Параметры:
//  Сотрудники  - Массив, сотрудники,
//				по которым требуется получить сведения
//  Период     - дата, месяц, на конец которого требуется получить сведения.
//
// Возвращаемое значение:
//  ТаблицаЗначений с колонками "Сотрудник", "Уволен"
//  содержится информация о сотруднике и его статусе в текущем месяце.
//
Функция СостоянияСотрудниковДляРасчетаОценочныхОбязательствОтпусков(Сотрудники, Период) Экспорт
	
	КадровыеДанные =  КадровыйУчет.КадровыеДанныеСотрудников(Истина, Сотрудники, "ДатаУвольнения");
	КадровыеДанные.Колонки.Добавить("Уволен", Новый ОписаниеТипов("Булево"));
	Для каждого СтрокаТЗ Из КадровыеДанные Цикл
		СтрокаТЗ.Уволен = (СтрокаТЗ.ДатаУвольнения >= Период);
	КонецЦикла;
	Возврат КадровыеДанные;
	
КонецФункции

Процедура ОтменитьЗаявлениеНаВычеты(Регистратор, Сотрудник) Экспорт
	
	Если ТипЗнч(Регистратор) = Тип("ДокументСсылка.Увольнение") Тогда
		
		Заявление = Регистратор.ПолучитьОбъект();
		Заявление.ПрименятьВычетыПослеУвольнения = Истина;
		Заявление.Записать(РежимЗаписиДокумента.Проведение);
		
	Иначе
		
		Заявление = Регистратор.ПолучитьОбъект();
		Заявление.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	КонецЕсли;
	
КонецПроцедуры

Функция РегистраторыПереносаДанных() Экспорт
	Возврат Новый Массив;
КонецФункции

#КонецОбласти
