////////////////////////////////////////////////////////////////////////////////
// Подсистема "Синхронизация данных"
// Серверные процедуры, обслуживающие правила регистрации объектов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Обработчик регистрации изменений для начальной выгрузки данных.
// Используется для переопределения стандартной обработки регистрации изменений.
// При стандартной обработке будут зарегистрированы изменения всех данных из состава плана обмена.
// Если для плана обмена предусмотрены фильтры ограничения миграции данных,
// то использование этого обработчика позволит повысить производительность начальной выгрузки данных.
// В обработчике следует реализовать регистрацию изменений с учетом фильтров ограничения миграции данных.
// Если для плана обмена используются ограничения миграции по дате или по дате и организациям,
// то можно воспользоваться универсальной процедурой
// ОбменДаннымиСервер.ЗарегистрироватьДанныеПоДатеНачалаВыгрузкиИОрганизациям.
// Обработчик используется только для универсального обмена данными с использованием правил обмена
// и для универсального обмена данными без правил обмена и не используется для обменов в РИБ.
// Использование обработчика позволяет повысить производительность
// начальной выгрузки данных в среднем в 2-4 раза.
//
// Параметры:
//
// Получатель - ПланОбменаСсылка - Узел плана обмена, в который требуется выгрузить данные.
//
// СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки
//                                 события.
//  Если в теле процедуры-обработчика установить данному параметру значение Ложь, стандартная обработка события
//  производиться не будет.
//  Отказ от стандартной обработки не отменяет действие.
//  Значение по умолчанию - Истина.
//
Процедура ОбработкаРегистрацииНачальнойВыгрузкиДанных(Знач Получатель, СтандартнаяОбработка, Отбор) Экспорт
	ОбменДаннымиЗарплатаКадрыРасширенный.ОбработкаРегистрацииНачальнойВыгрузкиДанных(Получатель, СтандартнаяОбработка, Отбор);
КонецПроцедуры

// Заменяет текст запроса регистрации изменений объекта для получения списка узлов-получателей по организации.
//
// Параметры:
//  ИмяПланаОбмена - Строка - Имя метаданных плана обмена
//  Отказ - Булево - флаг отказа от выполнения правил регистрации.
//      Отказ от выполнения правил означает, что объект и присоединенные файлы не будет зарегистрированы на узлах плана обмена,
//      для которого создано это правило.
//  ТекстЗапроса - Строка - текст запроса, который будет использован для определения узлов-получателей.
//  ПараметрыЗапроса - Структура - содержит значения свойств текущей версии объекта,
//      которые используются в качестве параметров в запросе для определения узлов-получателей.
//  ИспользоватьКэш - Булево - параметр определяет включение платформенного механизма повторно используемых значений
//      при определении узлов-получателей. Если передаваемые запросу значения в структуре ПараметрыЗапроса содержат
//      недопустимые типы данных для платформенного механизма кэширования, то флаг следует сбросить. Значение по
//      умолчанию - Истина.
//  Выгрузка - (только чтение) - Булево - параметр определяет контекст выполнения правила регистрации.
//      Истина - правило регистрации выполняется в контексте выгрузки объекта.
//      Ложь - правило регистрации выполняется в контексте перед записью объекта
//  Организации - Ссылка или массив ссылок на организации, по которым нужно получить список узлов-получателей.
//
Процедура ОграничитьРегистрациюОбъектаОтборомПоОрганизациямИПодразделениям(ИмяПланаОбмена, Отказ, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, Организации = Неопределено, Подразделения = Неопределено) Экспорт
	ОбменДаннымиЗарплатаКадрыРасширенный.ОграничитьРегистрациюОбъектаОтборомПоОрганизациямИПодразделениям(ИмяПланаОбмена, Отказ, ТекстЗапроса, ПараметрыЗапроса, ИспользоватьКэш, Выгрузка, Организации, Подразделения);
КонецПроцедуры

// Возвращает структуру ограничения регистрации независимого регистра сведений
//
// Возвращаемое значение:
//		Структура
//			* Организации - Строка, Массив - имена полей организации в наборе сведений
//			* Подразделения - Строка, Массив - имена полей подразделения в наборе сведений
//			* ФизическиеЛица - Строка, Массив - имена полей физического лица в наборе сведений
//			* Сотрудники - Строка, Массив - имена полей сотрудника в наборе сведений
//			* ДатыПолученияДанных - Строка, Массив - имена полей даты получения кадровых сведений.
//
Функция ИменаПолейОграниченияРегистрацииРегистраСведений() Экспорт
	Возврат ОбменДаннымиЗарплатаКадрыРасширенный.ИменаПолейОграниченияРегистрацииРегистраСведений();
КонецФункции

// Заполняет массивы организаций, подразделений, физических лиц и сотрудников из переданного набора сведений.
//
// Параметры:
//		ОграниченияРегистрации - Структура - см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации
//		НаборСведений - Набор, для которого получаем ограничения регистрации
//		ИменаПолей - Структура - см. ОбменДаннымиЗарплатаКадры.ИменаПолейОграниченияРегистрацииРегистраСведений.
//
Процедура ЗаполнитьОграниченияРегистрацииРегистраСведений(ОграниченияРегистрации, НаборСведений, ИменаПолей) Экспорт
	ОбменДаннымиЗарплатаКадрыРасширенный.ЗаполнитьОграниченияРегистрацииРегистраСведений(ОграниченияРегистрации, НаборСведений, ИменаПолей);
КонецПроцедуры

// Ограничивает изменение документов, если не все данные в документе доступны пользователю в подчиненном узле
// Вызывается в обработчике "ПриЧтенииНаСервере" всех документов, учавствующих в обмене.
//
// Параметры:
//		Форма - форма документа
//		Источник - Открываемый документ-объект.
//
Процедура ПриЧтенииНаСервереДокумента(Форма, Источник) Экспорт
	ОбменДаннымиЗарплатаКадрыРасширенный.ПриЧтенииНаСервереДокумента(Форма, Источник);
КонецПроцедуры

#КонецОбласти