
#Область СлужебныйПрограммныйИнтерфейс

Функция ИменаНедоступныхДляИзмененияЭлементовФормыРеестраСведенийНеобходимыхДляНазначенияПособий() Экспорт
	
	ИменаЭлементовНедоступныхДляИзменения = Новый Массив;
	ИменаЭлементовНедоступныхДляИзменения.Добавить("СтраницаЕдиновременноеПриРождении");
	ИменаЭлементовНедоступныхДляИзменения.Добавить("СтраницаЕжемесячноеПособиеПоУходуЗаРебенком");
	ИменаЭлементовНедоступныхДляИзменения.Добавить("СтраницаПособияВставшимНаУчетВРанниеСроки");
	ИменаЭлементовНедоступныхДляИзменения.Добавить("СтраницаОсновное");	
	ИменаЭлементовНедоступныхДляИзменения.Добавить("СтраницаОсвобождениеОтРаботы");
	ИменаЭлементовНедоступныхДляИзменения.Добавить("СтраницаОсобыеПричины");
	ИменаЭлементовНедоступныхДляИзменения.Добавить("ГруппаУсловияИсчисления");
	ИменаЭлементовНедоступныхДляИзменения.Добавить("ГруппаОплатаЗаСчетФСС");
	
	Возврат ИменаЭлементовНедоступныхДляИзменения;
	
КонецФункции

#КонецОбласти
