#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В Разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// 
// Для рабочего стола вместо Метаданных необходимо добавлять
// ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.Кадры);
	Разделы.Добавить(Метаданные.Подсистемы.Зарплата);
	Разделы.Добавить(Метаданные.Подсистемы.ВыплатыПеречисления);
	Разделы.Добавить(Метаданные.Подсистемы.НалогиИВзносы);
	Разделы.Добавить(Метаданные.Подсистемы.Отчетность);
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
// В Разделы необходимо добавить метаданные тех разделов, 
// в которых размещены команды вызова.
// 
// Для рабочего стола вместо Метаданных необходимо добавлять
// ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы (Массив) из (ОбъектМетаданных).
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.Кадры);
	Разделы.Добавить(Метаданные.Подсистемы.Зарплата);
	Разделы.Добавить(Метаданные.Подсистемы.ВыплатыПеречисления);
	Разделы.Добавить(Метаданные.Подсистемы.НалогиИВзносы);
	Разделы.Добавить(Метаданные.Подсистемы.Отчетность);
	
КонецПроцедуры

#КонецОбласти
