#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МассивСотрудников = Сотрудники.Выгрузить(, "Сотрудник").ВыгрузитьКолонку("Сотрудник");
	
	СтруктураИменТаблиц = МедицинскоеСтрахованиеФормы.СтруктураИменТаблиц();
	СтруктураИменТаблиц.ИмяТаблицыСотрудники = "Сотрудники";
	СтруктураИменТаблиц.ИмяТаблицыПрограммыСтрахованияСотрудников = "ПрограммыСтрахованияСотрудников";
	СтруктураИменТаблиц.ИмяТаблицыРасширенийПрограммСтрахованияСотрудников = "РасширенияПрограммСтрахованияСотрудников";
	
	Для каждого ЗначениеСтруктуры Из СтруктураИменТаблиц Цикл
		Если ЗначениеСтруктуры.Значение = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		СтрокиДляУдаления = Новый Массив;
		Для Каждого СтрокаТаблицы Из ЭтотОбъект[ЗначениеСтруктуры.Значение] Цикл
			Если МассивСотрудников.Найти(СтрокаТаблицы.Сотрудник) = Неопределено Тогда
				СтрокиДляУдаления.Добавить(СтрокаТаблицы);
			КонецЕсли;
		КонецЦикла;
		Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
			ЭтотОбъект[ЗначениеСтруктуры.Значение].Удалить(СтрокаДляУдаления);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДанныеДокумента = Новый МенеджерВременныхТаблиц;
	
	СоздатьВТДанныеДокументов(ДанныеДокумента);
	СформироватьДвиженияОткрепленияОтПрограммСтрахования(Движения, ДанныеДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("Сотрудники", "Сотрудник"));
	
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизацииИСотрудникам(ЭтотОбъект, Организация, МассивПараметров, Дата);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьВТДанныеДокументов(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ОткреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОткреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	ЛОЖЬ КАК Действует,
	|	ОткреплениеСотрудники.ДатаОткрепления КАК Период,
	|	ОткреплениеСотрудники.ДатаОткрепления КАК ДействуетДо,
	|	ОткреплениеПрограммыСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
	|ПОМЕСТИТЬ ВТСуммыСтраховыхПремийПрограммСтрахования
	|ИЗ
	|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.ПрограммыСтрахованияСотрудников КАК ОткреплениеПрограммыСтрахованияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеСотрудники
	|		ПО ОткреплениеПрограммыСтрахованияСотрудников.Ссылка = ОткреплениеСотрудники.Ссылка
	|			И ОткреплениеПрограммыСтрахованияСотрудников.Сотрудник = ОткреплениеСотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
	|		ПО ОткреплениеПрограммыСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПрограммыМедицинскогоСтрахования КАК ПрограммыМедицинскогоСтрахования
	|		ПО ОткреплениеПрограммыСтрахованияСотрудников.ПрограммаСтрахования = ПрограммыМедицинскогоСтрахования.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ОткреплениеСотрудники.Сотрудник.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования КАК РасширениеПрограммСтрахования,
	|	ЛОЖЬ КАК Действует,
	|	ОткреплениеСотрудники.ДатаОткрепления КАК Период,
	|	ОткреплениеСотрудники.ДатаОткрепления КАК ДействуетДо,
	|	ОткреплениеРасширенияПрограммСтрахованияСотрудников.СтраховаяПремия КАК СтраховаяПремия
	|ПОМЕСТИТЬ ВТСуммыСтраховыхПремийРасширенийПрограммСтрахования
	|ИЗ
	|	Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.РасширенияПрограммСтрахованияСотрудников КАК ОткреплениеРасширенияПрограммСтрахованияСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования.Сотрудники КАК ОткреплениеСотрудники
	|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ОткреплениеСотрудники.Ссылка
	|			И ОткреплениеРасширенияПрограммСтрахованияСотрудников.Сотрудник = ОткреплениеСотрудники.Сотрудник
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОткреплениеОтПрограммМедицинскогоСтрахования КАК ТаблицаДокумента
	|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.Ссылка = ТаблицаДокумента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РасширенияПрограммМедицинскогоСтрахования КАК РасширенияПрограммМедицинскогоСтрахования
	|		ПО ОткреплениеРасширенияПрограммСтрахованияСотрудников.РасширениеСтрахования = РасширенияПрограммМедицинскогоСтрахования.Ссылка
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Регистратор";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СформироватьДвиженияОткрепленияОтПрограммСтрахования(Движения, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммыСтраховыхПремийПрограммСтрахования.Период КАК Период,
	|	СуммыСтраховыхПремийПрограммСтрахования.Организация КАК Организация,
	|	СуммыСтраховыхПремийПрограммСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыСтраховыхПремийПрограммСтрахования.ПрограммаСтрахования КАК ПрограммаСтрахования,
	|	СуммыСтраховыхПремийПрограммСтрахования.Действует КАК Действует,
	|	СуммыСтраховыхПремийПрограммСтрахования.ДействуетДо КАК ДействуетДо,
	|	СуммыСтраховыхПремийПрограммСтрахования.СтраховаяПремия КАК СтраховаяПремия
	|ИЗ
	|	ВТСуммыСтраховыхПремийПрограммСтрахования КАК СуммыСтраховыхПремийПрограммСтрахования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.ПрограммыМедицинскогоСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.ПрограммыМедицинскогоСтрахованияСотрудников.Записывать = Истина;
	КонецЦикла;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Период КАК Период,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Организация КАК Организация,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ФизическоеЛицо КАК ФизическоеЛицо,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.РасширениеПрограммСтрахования КАК РасширениеПрограммСтрахования,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.Действует КАК Действует,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.ДействуетДо КАК ДействуетДо,
	|	СуммыСтраховыхПремийРасширенийПрограммСтрахования.СтраховаяПремия КАК СтраховаяПремия
	|ИЗ
	|	ВТСуммыСтраховыхПремийРасширенийПрограммСтрахования КАК СуммыСтраховыхПремийРасширенийПрограммСтрахования";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Движения.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		Движения.РасширенияПрограммМедицинскогоСтрахованияСотрудников.Записывать = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
