#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции
	
Процедура Перезаписать(ЭлементРубрикатора, ПоставщикРубрики, СсылкаНаЭлементКурса, ВесВопроса) Экспорт
	
	Рубрикатор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭлементРубрикатора, "Владелец");
	
	НаборЗаписей = РегистрыСведений.ТемыЭлементовЭлектронныхКурсов.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Рубрикатор.Установить(Рубрикатор);
	НаборЗаписей.Отбор.ЭлементРубрикатора.Установить(ЭлементРубрикатора);
	НаборЗаписей.Отбор.Поставщик.Установить(ПоставщикРубрики);
	НаборЗаписей.Отбор.СсылкаНаЭлементКурса.Установить(СсылкаНаЭлементКурса);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Рубрикатор = Рубрикатор;
	НоваяЗапись.ЭлементРубрикатора = ЭлементРубрикатора;
	НоваяЗапись.Поставщик = ПоставщикРубрики;
	НоваяЗапись.СсылкаНаЭлементКурса = СсылкаНаЭлементКурса;
	
	НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();
	НоваяЗапись.ВесВопроса = ВесВопроса;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли