#Область ПрограммныйИнтерфейс

// Возвращает данные об изученном электронном курсе.
//
// Параметры:
//   ИзучениеЭлектронногоКурса - ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
// Возвращаемое значение:
//  Структура - см. ИзучениеЭлектронныхКурсовСлужебный.ДанныеОбИзученииЭлектронногоКурса.
//
Функция ДанныеОбИзученииЭлектронногоКурса(ИзучениеЭлектронногоКурса) Экспорт
	Возврат Документы.ИзучениеЭлектронногоКурса.ДанныеОбИзучении(ИзучениеЭлектронногоКурса);	
КонецФункции

// Возвращает прогресс изучения.
//
// Параметры:
//   ИзучениеЭлектронногоКурса - ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
// Возвращаемое значение:
//  Число - прогресс от 0 до 100.
//
Функция ПрогрессИзучения(ИзучениеЭлектронногоКурса) Экспорт	
	Возврат Документы.ИзучениеЭлектронногоКурса.ПрогрессИзучения(ИзучениеЭлектронногоКурса);	
КонецФункции

// Возвращает результат изучения в стобалльной шкале.
//
// Параметры:
//   ИзучениеЭлектронногоКурса - ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
// Возвращаемое значение:
//  Число - Результат от 0 до 100.
//
Функция РезультатИзучения(ИзучениеЭлектронногоКурса) Экспорт	
	Возврат Документы.ИзучениеЭлектронногоКурса.РезультатИзучения(ИзучениеЭлектронногоКурса);	
КонецФункции

// Возвращает документ изучения электронного курса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - Электронный курс.
//   Контекст - ОпределяемыйТип.КонтекстЭлектронногоОбучения - Контекст изучения.
//   Учащийся - ОпределяемыйТип.УчащийсяЭлектронногоОбучения - Учащийся изучения.
//
// Возвращаемое значение:
//  ДокументСсылка.ИзучениеЭлектронногоКурса - документ изучения.
//
Функция НайтиИзучениеПоКонтексту(ЭлектронныйКурс, Контекст, Учащийся) Экспорт
	Возврат Документы.ИзучениеЭлектронногоКурса.НайтиПоКонтексту(ЭлектронныйКурс, Контекст, Учащийся);
КонецФункции

#КонецОбласти
