////////////////////////////////////////////////////////////////////////////////
// Подсистема "Адаптация и увольнение".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ТекстПредставленияСпискаВидовСобытий(Знач СписокСобытий,  ЗначениеПоУмолчанию = "", ТолькоДляОтмеченных = Ложь) Экспорт
	
	Если ТолькоДляОтмеченных Тогда
		
		ОтмеченныеЗначения = Новый СписокЗначений;
		
		Для Каждого Элемент Из СписокСобытий Цикл
			
			Если Элемент.Пометка Тогда
				ОтмеченныеЗначения.Добавить(Элемент.Значение);
			КонецЕсли;
			
		КонецЦикла;
		
		СписокСобытий = ОтмеченныеЗначения;
		
	КонецЕсли;
	
	ТекстПредставления = ?(ЗначениеЗаполнено(ЗначениеПоУмолчанию), ЗначениеПоУмолчанию, НСтр("ru = 'При любом событии'"));
	КолВоЗначений = СписокСобытий.Количество();
	
	Если КолВоЗначений = 1 Тогда
		ТекстПредставления = СтрШаблон(НСтр("ru = '%1'"), СписокСобытий[0].Значение);
	ИначеЕсли КолВоЗначений > 1 Тогда
		ТекстПредставления = СтрШаблон(НСтр("ru = '%1 и еще %2'"), СписокСобытий[0].Значение, КолВоЗначений - 1);
	КонецЕсли;
	
	Возврат ТекстПредставления;
	
КонецФункции

Функция НазначениеДляОрганизации() Экспорт
	
	Возврат НСтр("ru = 'Для организации'");
	
КонецФункции

Функция НазначениеДляПозиции() Экспорт
	
	Возврат НСтр("ru = 'Для позиции'");
	
КонецФункции

Функция НазначениеДляДолжности() Экспорт
	
	Возврат НСтр("ru = 'Для должности'");
	
КонецФункции

Функция НазначениеДляПодразделения() Экспорт
	
	Возврат НСтр("ru = 'Для подразделения'");
	
КонецФункции

Функция НазначениеДляПодразделенияИДолжности() Экспорт
	
	Возврат НСтр("ru = 'Для должности и подразделения'");
	
КонецФункции

#КонецОбласти
