#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ
	
Процедура НачальноеЗаполнение() Экспорт 	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ИСТИНА КАК ЗначениеИстина
	               |ИЗ
	               |	Справочник.ВидыПредоставляемыхСотрудникамСправок КАК ВидыПредоставляемыхСотрудникамСправок
	               |ГДЕ
	               |	НЕ ВидыПредоставляемыхСотрудникамСправок.Предопределенный";
				   
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'С места работы'");
	ВидСправки.Записать();
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'О доходах'");
	ВидСправки.Записать();
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'О начисленных страховых взносах'");
	ВидСправки.Записать();
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'О неиспользовании (частичном использовании) дополнительных выходных дней по уходу за детьми-инвалидами'");
	ВидСправки.Записать();
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'О неполучении единовременного пособия при рождении ребенка'");
	ВидСправки.Записать();
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'О неполучении ежемесячного пособия по уходу за ребенком до 1.5 лет'");
	ВидСправки.Записать();
	
	ВидСправки = Справочники.ВидыПредоставляемыхСотрудникамСправок.СоздатьЭлемент();
	ВидСправки.Наименование = НСтр("ru = 'О неполучении пособия по нетрудоспособности'");
	ВидСправки.Записать();
	
КонецПроцедуры	
	
#КонецОбласти

#КонецОбласти
	
#КонецЕсли