
#Область ПрограммныйИнтерфейс

// Заполняет фактические значения автоматически рассчитываемых целевых показателей.
//
// Параметры:
//  Месяц - Дата - месяц, за который запрашиваются значения показателей.
//
//  ЦелевыеПоказателиСотрудников - Соответствие - показатели сотрудников, значения которых можно переопределить:
//            * Ключ - сотрудник компании.
//            * Значение - соответствие, у которого:
//						Ключ - целевой показатель.
//						Значение - значение целевого показателя, по умолчанию - Неопределено.
//
Процедура ПрочитатьЗначенияАвтоматическиЗаполняемыхЦелевыхПоказателей(Месяц, ЦелевыеПоказателиСотрудников) Экспорт 
	
	
	
КонецПроцедуры

#КонецОбласти
