////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с рабочим календарем.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Сохраняет переданный массив записей календаря.
//
// Параметры:
//  ЗаписиКалендаря		 - Массив	 - сохраняемые записи календаря.
//  НастройкиОтображения - Структура - настройки отображения планировщика.
//
// Возвращаемое значение:
//  Структура - со свойствами:
//    * СсылкиИзмененныхЗаписейКалендаря - Массив - ссылки на записи календаря.
//    * НовыеИсключенияПовторения - Массив - массив структур.
//    * ОбновитьПринудительно - Булево.
//    * ДанныеПланировщика - Структура - описание см. РаботаСРабочимКалендарем.НовыеДанныеПланировщика.
//
Функция СохранитьЗаписиКалендаря(Знач ЗаписиКалендаря, Знач НастройкиОтображения) Экспорт
	
	Возврат РаботаСРабочимКалендарем.СохранитьЗаписиКалендаря(ЗаписиКалендаря, НастройкиОтображения);
	
КонецФункции

// Создает запись календаря.
//
// Параметры:
//  ЗаписьКалендаря		 - Структура - структура со свойствами:
//    * ДатаНачала		 - Дата - дата начала записи.
//    * ДатаОкончания	 - Дата - дата окончания записи.
//    * Описание		 - Строка - описание новой записи.
//    * Цвет			 - ПеречислениеСсылка.ЦветаРабочегоКалендаря - цвет для отражения в календаре.
//    * Пользователь	 - Дата - пользователь, для которого создается запись.
//  НастройкиОтображения - Структура - настройки отображения планировщика.
//
// Возвращаемое значение:
//  Структура - со свойствами:
//    * НовыйЭлемент - СправочникСсылка.ЗаписиРабочегоКалендаря - новая запись.
//    * Напоминание - Структура - (см. НапоминанияПользователяКлиентСервер.ОписаниеНапоминания).
//    * ДанныеПланировщика - Структура - (см. РаботаСРабочимКалендарем.НовыеДанныеПланировщика).
//
Функция СоздатьЗаписьКалендаря(Знач ЗаписьКалендаря, Знач ЗначениеКопирования, Знач НастройкиОтображения) Экспорт
	
	Возврат РаботаСРабочимКалендарем.СоздатьЗаписьКалендаря(ЗаписьКалендаря, ЗначениеКопирования, НастройкиОтображения);
	
КонецФункции

// Процедура отображает события пользователя в календарь на указанный период.
//
// Параметры:
//  Планировщик			 - Планировщик	 - планировщик.
//  НастройкиОтображения - Структура	 - настройки отображения планировщика.
//
Процедура ОтобразитьКалендарь(Планировщик, НастройкиОтображения) Экспорт
	
	РаботаСРабочимКалендарем.ОтобразитьКалендарь(Планировщик, НастройкиОтображения);
	
КонецПроцедуры

// Устанавливает пометку удаления записи и оповещает другие формы.
//
// Параметры:
//  Запись			 - СправочникСсылка.ЗаписиРабочегоКалендаря - обрабатываемая запись.
//  ПометкаУдаления	 - Булево - новое значение пометки.
//
// Возвращаемое значение:
//  Булево - Истина, если действие выполнено успешно.
//
Функция УстановитьПометкуУдаления(Запись, ПометкаУдаления) Экспорт
	
	Возврат РаботаСРабочимКалендарем.УстановитьПометкуУдаления(Запись, ПометкаУдаления);
	
КонецФункции

// Устанавливает пометки удаления записей и возвращает факт изменения пометки удаления.
//
// Параметры:
//  Записи					 - Массив - обрабатываемые записи рабочего календаря.
//  ПовторяющиесяСобытия	 - Структура - структура со свойствами:
//    * ЗаписьКалендаря - СправочникСсылка.ЗаписиРабочегоКалендаря - повторяющееся событие.
//    * ДатаИсключения - Дата - дата исключения.
//  ПометкаУдаления			 - Булево - новое значение пометки.
//
// Возвращаемое значение:
//  Булево - Истина, если действие выполнено успешно.
//
Функция УстановитьПометкиУдаления(Записи, ПовторяющиесяСобытия, ПометкаУдаления) Экспорт
	
	Возврат РаботаСРабочимКалендарем.УстановитьПометкиУдаления(Записи, ПовторяющиесяСобытия, ПометкаУдаления);
	
КонецФункции

// Устанавливает повторение события в соответствии с настройками повторения.
//
// Параметры:
//  ЗаписьКалендаря		 - СправочникСсылка.ЗаписиРабочегоКалендаря	 - событие, запись рабочего календаря.
//  НастройкиПовторения	 - Структура	 - настройки повторения.
//
Процедура УстановитьПовторение(ЗаписьКалендаря, НастройкиПовторения) Экспорт
	
	РаботаСРабочимКалендарем.УстановитьПовторение(ЗаписьКалендаря, НастройкиПовторения);
	
КонецПроцедуры

// Формирует HTML представление события.
//
// Параметры:
//  Событие		 - СправочникСсылка	 - событие.
//  ДатаСобытия	 - Дата	 - дата события.
// 
// Возвращаемое значение:
//  Строка - HTML представление события.
//
Функция СформироватьHTMLПредставление(Событие, ДатаСобытия) Экспорт
	
	Возврат РаботаСРабочимКалендарем.СформироватьHTMLПредставление(Событие, ДатаСобытия);
	
КонецФункции

// Устанавливает цвет, которым будут отображаться события в календаре пользователя.
//
// Параметры:
//  ЗаписиКалендаря					 - Массив									 - записи рабочего календаря.
//  Цвет							 - ПеречислениеСсылка.ЦветаРабочегоКалендаря - цвет.
//  СоздаватьИсключенияПовторения	 - Булево									 - признак того что для повторяющегося события будет цвет установлен для одного элемента.
//
// Возвращаемое значение:
//  Массив - ссылки на записи календаря с обновленным цветом.
//
Функция УстановитьЦветЗаписейКалендаря(Знач ЗаписиКалендаря, Знач Цвет, Знач СоздаватьИсключенияПовторения) Экспорт
	
	Возврат РаботаСРабочимКалендарем.УстановитьЦветЗаписейКалендаря(ЗаписиКалендаря, Цвет, СоздаватьИсключенияПовторения);
	
КонецФункции

// Изменяет доступность массива времен.
//
// Параметры:
//  МассивВремен - Массив - времена, доступность которых изменяется.
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияЗанятости - установленное состояние занятости.
//
Функция ИзменитьДоступностьВремен(МассивВремен) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ИзменитьДоступностьВремен(МассивВремен);
	
КонецФункции

// Проверяет, заняты ли пользователи в указанное время.
//
// Параметры:
//  МассивПользователей	 - Массив	 - пользователи, для которых выполняется проверка.
//  ДатаНачала			 - Дата		 - дата начала проверки.
//  ДатаОкончания		 - Дата		 - дата окончания проверки.
//  ИсключенияЗанятости	 - Массив	 - исключения занятости.
//
// Возвращаемое значение:
//  Структура - со свойствами:
//    * ОбщаяЗанятость - ПеречислениеСсылка.СостоянияЗанятости - обобщенная занятость.
//    * ПользователиОтсутствуют - Массив - отключенные напоминания пользователя.
//    * ПользователиЗанятые - Массив - отключенные напоминания пользователя.
//    * ПользователиПодВопросом - Массив - отключенные напоминания пользователя.
//
Функция ПроверитьДоступностьПользователей(МассивПользователей, ДатаНачала, ДатаОкончания, ИсключенияЗанятости) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ПроверитьДоступностьПользователей(МассивПользователей, ДатаНачала, ДатаОкончания, ИсключенияЗанятости);
	
КонецФункции

// Переносит элементы планировщика на указанную дату.
//
// Параметры:
//  ЗаписиКалендаря		 - Массив	 - переносимые записи календаря.
//  ДатаПереноса		 - Дата		 - новая дата.
//  НастройкиОтображения - Структура - настройки отображения календаря.
//
// Возвращаемое значение:
//  Структура - со свойствами:
//    * СсылкиИзмененныхЗаписейКалендаря - Массив - ссылки на записи календаря.
//    * НовыеИсключенияПовторения - Массив - массив структур.
//    * ОбновитьПринудительно - Булево.
//    * ДанныеПланировщика - Структура - описание см. РаботаСРабочимКалендарем.НовыеДанныеПланировщика.
//
Функция ПеренестиЭлементыПланировщикаНаДату(ЗаписиКалендаря, ДатаПереноса, НастройкиОтображения = Неопределено) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ПеренестиЭлементыПланировщикаНаДату(ЗаписиКалендаря, ДатаПереноса, НастройкиОтображения);
	
КонецФункции

// Возвращает представление предмета.
//
// Параметры:
//  Предмет - ЛюбаяСсылка - предмет, на основании которого создана запись календаря.
//
// Возвращаемое значение:
//  Строка.
//
Функция ПолучитьПредставлениеПредмета(Предмет) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ПолучитьПредставлениеПредмета(Предмет);
	
КонецФункции

// Заполняет список рабочих дней в соответствии с графиком пользователям. Заполняется год
// соответствующий дате заполнения и смежные с ним года. После заполнения год включается в список 
// заполненных. Если дата заполнения присутствует в списке, то заполнение рабочих не производится.
//
// Параметры:
//  РабочиеДни - СписокЗначений - список дней, среди которых рабочие выделены пометкой.
//  ЗаполненныеГода - СписокЗначений - список лет, для которых заполнены рабочие дни.
//  ДатаЗаполнения - Дата - дата, на которую хотим заполнить рабочие дни.
//
Процедура ЗаполнитьРабочиеДни(РабочиеДни, ЗаполненныеГода, ДатаЗаполнения) Экспорт
	
	РаботаСРабочимКалендарем.ЗаполнитьРабочиеДни(РабочиеДни, ЗаполненныеГода, ДатаЗаполнения);
	
КонецПроцедуры

// Получает данные планировщика, при необходимости сохраняя измененную настройку.
//
// Параметры:
//  НастройкиОтображения - Структура - настройки отображения планировщика.
//  ИзмененнаяНастройка	 - Строка	 - имя измененной настройки.
//
// Возвращаемое значение:
//  Структура - описание см. РаботаСРабочимКалендарем.НовыеДанныеПланировщика.
//
Функция ПолучитьДанныеПланировщика(Знач НастройкиОтображения, Знач ИзмененнаяНастройка) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ПолучитьДанныеПланировщика(НастройкиОтображения, ИзмененнаяНастройка);
	
КонецФункции

// Получает данные планировщика, необходимые для обновления данных о записях календаря.
//
// Параметры:
//  НастройкиОтображения - Структура - настройки отображения планировщика.
//  ЗаписиКалендаря		 - Массив - записи календаря, которые необходимо обновить.
//
// Возвращаемое значение:
//  Структура - описание см. РаботаСРабочимКалендарем.НовыеДанныеПланировщика.
//
Функция ОбновитьДанныеПланировщика(Знач НастройкиОтображения, Знач ЗаписиКалендаря = Неопределено) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ОбновитьДанныеПланировщика(НастройкиОтображения, ЗаписиКалендаря);
	
КонецФункции

// Определяет право изменения календаря пользователя.
//
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - пользователь, чьи права проверяем.
//  ПользовательКалендаря - СправочникСсылка.Пользователи - пользователь, права на чей календарь проверяем.
//
// Возвращаемое значение:
//  Булево - доступно изменение календаря.
//
Функция ДоступноИзменениеКалендаря(Пользователь, ПользовательКалендаря) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ДоступноИзменениеКалендаря(Пользователь, ПользовательКалендаря);
	
КонецФункции

// Отмечает записи календаря как отработанные.
//
// Параметры:
//  ЗаписиКалендаря - СправочникСсылка.ЗаписиРабочегоКалендаря - отработанные записи календаря.
//
// Возвращаемое значение:
//  Структура - со свойствами:
//    * СсылкиИзмененныхЗаписейКалендаря - Массив - ссылки на записи календаря.
//    * ОтключенныеНапоминания - Массив - отключенные напоминания пользователя.
//
Функция ОтработатьВыделенныеЗаписиКалендаря(Знач ЗаписиКалендаря) Экспорт
	
	Возврат РаботаСРабочимКалендарем.ОтработатьВыделенныеЗаписиКалендаря(ЗаписиКалендаря);
	
КонецФункции

#КонецОбласти
