#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Вакансия", Вакансия);
	Параметры.Свойство("ФизическоеЛицо", ФизическоеЛицо);
	Параметры.Свойство("ХарактеристикаПерсонала", ХарактеристикаПерсонала);
	Параметры.Свойство("ЗначениеХарактеристики", ЗначениеХарактеристики);
	
	ОбновитьОтчетНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтчетНаСервере()
	
	ТабличныйДокументРасшифровки = ЭлектронноеИнтервью.ТабличныйДокументРасшифровкиХарактеристикПоОтветам(Вакансия, ФизическоеЛицо, ХарактеристикаПерсонала, ЗначениеХарактеристики);
	ТаблицаОтчета = Новый ТабличныйДокумент;
	ТаблицаОтчета.Вывести(ТабличныйДокументРасшифровки); 	
	
КонецПроцедуры

#КонецОбласти

