#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	УчетСтраховыхВзносов.СформироватьВозмещениеРасходовПоСоциальномуСтрахованию(Движения, Отказ, Организация, ДанныеДляПроведения());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизации(ЭтотОбъект, Организация);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	РасчетыСФондами = Новый ТаблицаЗначений;
	РасчетыСФондами.Колонки.Добавить("Период");
	РасчетыСФондами.Колонки.Добавить("ВидОбязательногоСтрахованияСотрудников");
	РасчетыСФондами.Колонки.Добавить("ЭтоСтраховыеВзносы");
	РасчетыСФондами.Колонки.Добавить("Сумма");

	ДанныеДокумента = РасчетыСФондами.Добавить();
	ДанныеДокумента.Период = Дата;
	ДанныеДокумента.ВидОбязательногоСтрахованияСотрудников = ВидСтрахования;
	ДанныеДокумента.ЭтоСтраховыеВзносы = Истина;
	ДанныеДокумента.Сумма = СуммаВозмещения;
	
	Возврат РасчетыСФондами;
	
КонецФункции

#КонецОбласти

#КонецЕсли