#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("УпрощенныйРежим") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;

		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.Стандартные;
		Элемент.Представление = НСтр("ru = 'Стандартные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.Исходные;
		Элемент.Представление = НСтр("ru = 'Исходные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.УвеличиватьСтандартные;
		Элемент.Представление = НСтр("ru = 'Увеличивать стандартные'");
		
		Элемент = ДанныеВыбора.Добавить();
		Элемент.Значение = Перечисления.ВариантыЗагрузкиКартинокДокументовЭлектронныхКурсов.РасширятьСтандартные;
		Элемент.Представление = НСтр("ru = 'Расширять стандартные'");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


