#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ВзаиморасчетыПоПрочимДоходам.ВедомостьОбработкаЗаполнения(ЭтотОбъект, ДанныеЗаполнения, СтандартнаяОбработка);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ВзаиморасчетыПоПрочимДоходам.ВедомостьОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты)	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ВзаиморасчетыПоПрочимДоходам.ВедомостьПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи); 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВзаиморасчетыПоПрочимДоходам.ВедомостьОбработкаПроведения(ЭтотОбъект, Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый Структура("Состав", "ФизическоеЛицо"));
	
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииПоОрганизацииИСотрудникам(ЭтотОбъект, Организация, МассивПараметров, ПериодРегистрации);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПроцедурыИФункцииЗаполненияДокумента

Функция МожноЗаполнитьВыплаты() Экспорт
	Возврат ВзаиморасчетыПоПрочимДоходам.ВедомостьМожноЗаполнитьВыплаты(ЭтотОбъект)
КонецФункции

Процедура ЗаполнитьВыплаты() Экспорт
	ВзаиморасчетыПоПрочимДоходам.ВедомостьЗаполнитьВыплаты(ЭтотОбъект);
КонецПроцедуры

Процедура ДополнитьВыплату(ФизическиеЛица) Экспорт
	ВзаиморасчетыПоПрочимДоходам.ВедомостьДополнитьВыплаты(ЭтотОбъект, ФизическиеЛица);
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьПоТаблицеВыплат(ТаблицаВыплат) Экспорт
	ДополнитьТаблицуВыплатБанковскимиСчетамиФизическихЛиц(ТаблицаВыплат);
	ВзаиморасчетыПоПрочимДоходам.ВедомостьЗаполнитьПоТаблицеВыплат(ЭтотОбъект, ТаблицаВыплат);
КонецПроцедуры

Процедура ДополнитьТаблицуВыплатБанковскимиСчетамиФизическихЛиц(ТаблицаВыплат)
	
	МетаданныеРеквизита = Метаданные().ТабличныеЧасти.Состав.Реквизиты.БанковскийСчет;
	ТаблицаВыплат.Колонки.Добавить(МетаданныеРеквизита.Имя, МетаданныеРеквизита.Тип);
	
	БанковскиеСчетаФизическихЛиц = 
		Документы.ВедомостьПрочихДоходовПеречислением.БанковскиеСчетаФизическихЛиц(ТаблицаВыплат.ВыгрузитьКолонку("ФизическоеЛицо"), Банк);
		
	Для Каждого СтрокаВыплаты Из ТаблицаВыплат Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаВыплаты.БанковскийСчет) Тогда
		
			БанковскийСчет = БанковскиеСчетаФизическихЛиц[СтрокаВыплаты.ФизическоеЛицо];
			Если БанковскийСчет = Неопределено Тогда
				СтрокаВыплаты.БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.ПустаяСсылка();
			Иначе	
				СтрокаВыплаты.БанковскийСчет = БанковскийСчет;
			КонецЕсли	
		КонецЕсли	
	КонецЦикла
	
КонецПроцедуры


Процедура ДополнитьПоТаблицеВыплат(ТаблицаВыплат) Экспорт
	ДополнитьТаблицуВыплатБанковскимиСчетамиФизическихЛиц(ТаблицаВыплат);
	ВзаиморасчетыПоПрочимДоходам.ВедомостьДополнитьПоТаблицеВыплат(ЭтотОбъект, ТаблицаВыплат)
КонецПроцедуры

Процедура ОчиститьСостав() Экспорт
	
	Состав.Очистить();
	Выплаты.Очистить();
	НДФЛ.Очистить();
	Основания.Очистить();
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли