#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции
	
Функция КодТемы(Тема) Экспорт
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Облако Тогда
		Возврат "cloud";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Пляж Тогда
		Возврат "beach";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Аквамарин Тогда
		Возврат "aquamarine";
	КонецЕсли;
	
	Если Тема = Перечисления.ТемыОформленияЭлектронныхКурсов.Лето Тогда
		Возврат "summer";
	КонецЕсли;	
	
	Возврат "cloud";
	
КонецФункции

#КонецОбласти

#КонецЕсли
