#Область СлужебныеПроцедурыИФункции

Функция ИмяФормыНастройкиРасчетаРезервовОтпусков() Экспорт

	Возврат "ОбщаяФорма.ОрганизацияНастройкиРасчетаРезервовОтпусков";

КонецФункции

Процедура СправкаПоОтпускам(Форма, МассивСотрудников) Экспорт
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.НачислениеОценочныхОбязательствПоОтпускам",
		"ПФ_MXL_СправкаПоОтпускамСотрудника",
		МассивСотрудников,
		Форма,
		Новый Структура("ПериодРегистрации", Форма.Объект.ПериодРегистрации));
	
КонецПроцедуры

#КонецОбласти
