#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	Если ДополнительныеСвойства.Свойство("ОграниченияРегистрации") Тогда
		// Ограничения регистрации уже были получены
		Возврат ДополнительныеСвойства.ОграниченияРегистрации;
	КонецЕсли;
	
	ДокументыНабора = ЭтотОбъект.Выгрузить().ВыгрузитьКолонку("Документ");
	СоответствиеОрганизаций = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ДокументыНабора, "Организация");
	МассивОрганизаций = Новый Массив;
	Для каждого ЭлементСоответствия Из СоответствиеОрганизаций Цикл
		Если МассивОрганизаций.Найти(ЭлементСоответствия.Значение) = Неопределено Тогда
			МассивОрганизаций.Добавить(ЭлементСоответствия.Значение);
		КонецЕсли;
	КонецЦикла;
	
	ОграниченияРегистрации = ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации();
	ОграниченияРегистрации.Организации = МассивОрганизаций;
	
	Возврат ОграниченияРегистрации;
	
КонецФункции

#КонецОбласти 

#КонецЕсли
