
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции


Процедура ВыключитьНастройки() Экспорт

	НаборЗаписей = РегистрыСведений.НастройкиВзаиморасчетовПоПрочимДоходам.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.ДополнительныеСвойства.Вставить("НеВыполнятьПроверкуВозможностиВыключенияНастроек");
		НаборЗаписей[0].ИспользоватьВзаиморасчетыПоПрочимДоходам = Ложь;
		НаборЗаписей[0].ИспользоватьВедомостиДляВыплатыПрочихДоходов = Ложь;
		НаборЗаписей.Записать();
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
