#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область БлокФункцийПервоначальногоЗаполненияИОбновленияИБ

// Процедура создает элементы справочника в зависимости от настроек.
//
Процедура СоздатьРешенияАттестационныхКомиссийПоНастройкам() Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.КадровыйРезерв") Тогда
		Модуль = ОбщегоНазначения.ОбщийМодуль("КадровыйРезерв");
		Модуль.СоздатьРешениеАттестационныхКомиссийРекомендуетсяВКадровыйРезерв();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция ОписаниеРешения() Экспорт
	
	Возврат Новый Структура("
	|Наименование,
	|РешениеКомиссии,
	|ПредопределенныйЭлемент,
	|ИмяПредопределенныхДанных");
	
КонецФункции

Функция НовоеРешение(ОписаниеРешения) Экспорт
	
	РешениеОбъект = Неопределено;
	
	Если ОписаниеРешения.ПредопределенныйЭлемент Тогда 
		РешениеСсылка = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.РешенияАттестационныхКомиссий." + ОписаниеРешения.ИмяПредопределенныхДанных);
		Если РешениеСсылка <> Неопределено Тогда 
			РешениеОбъект = РешениеСсылка.ПолучитьОбъект();
			Возврат РешениеОбъект;
		КонецЕсли;
	КонецЕсли;
	
	Если РешениеОбъект = Неопределено Тогда 
		РешениеОбъект = Справочники.РешенияАттестационныхКомиссий.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РешениеОбъект, ОписаниеРешения);
	РешениеОбъект.Записать();
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	Возврат РешениеОбъект;
	
КонецФункции

#КонецОбласти

#КонецЕсли
