
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Элементы.Список.Обновить();
	Элементы.Список.ТекущаяСтрока = ВыбранноеЗначение;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИзБиблиотеки(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипВопроса") И ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно
			И ЭлементОтбора.Использование = Истина Тогда
			
			ДополнительныеПараметры.Вставить("ОтборТипВопроса", ЭлементОтбора.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	ОткрытьФорму("Справочник.ВопросыДляСобеседования.Форма.БиблиотекаВопросовДляСобеседования", ДополнительныеПараметры, ЭтотОбъект);	
	
КонецПроцедуры

#КонецОбласти
