#Область СлужебныеПроцедурыИФункции

Процедура ПриПолученииМестаВыплатыВедомостиВКассу(Ведомость, МестоВыплаты, СтандартнаяОбработка = Истина) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУправленческуюЗарплату") Тогда 
		Возврат;
	КонецЕсли;
	
	УправленческаяОрганизация = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.УправленческаяОрганизация");
	Если ЗначениеЗаполнено(УправленческаяОрганизация) И Ведомость.Организация = УправленческаяОрганизация Тогда
		
		МестоВыплаты.Вид		= Перечисления.ВидыМестВыплатыЗарплаты.ПустаяСсылка();
		МестоВыплаты.Значение	= Справочники.Кассы.ПустаяСсылка();
		
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли	
	
КонецПроцедуры

#КонецОбласти

