
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Владелец") Тогда
		
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияХарактеристикПерсонала.Ссылка,
			|	ЗначенияХарактеристикПерсонала.Представление
			|ИЗ
			|	Справочник.ЗначенияХарактеристикПерсонала КАК ЗначенияХарактеристикПерсонала
			|ГДЕ
			|	ЗначенияХарактеристикПерсонала.Владелец = &Владелец
			|	И НЕ ЗначенияХарактеристикПерсонала.ПометкаУдаления
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗначенияХарактеристикПерсонала.РеквизитДопУпорядочивания";
		
		Запрос.УстановитьПараметр("Владелец", Параметры.Отбор.Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла;
		
	КонецЕсли; 

КонецПроцедуры

#КонецОбласти
