#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Количество() > 0 Тогда
		
		Запись = ЭтотОбъект[0];
		
		Если ДополнительныеСвойства.Свойство("ИспользоватьПубликацииМероприятийОбученияРазвития") Тогда
			Запись.ИспользоватьПубликацииМероприятийОбученияРазвития = ДополнительныеСвойства.ИспользоватьПубликацииМероприятийОбученияРазвития;
		Иначе
			Запись.ИспользоватьПубликацииМероприятийОбученияРазвития = Запись.ИспользоватьОбучениеРазвитиеСотрудников 
				И ПолучитьФункциональнуюОпцию("ИспользоватьСамообслуживаниеСотрудников");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ОбучениеРазвитие.СоздатьОтключитьУдержаниеПоУченическомуДоговору(Новый Соответствие);
	СамообслуживаниеСотрудников.ПриУстановкеНастройкиИспользоватьПубликацииМероприятийОбученияРазвития(
		Количество() > 0 И ЭтотОбъект[0].ИспользоватьПубликацииМероприятийОбученияРазвития);
	
	ОбучениеРазвитие.УстановитьПараметрыНабораСвойствСправочников();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли