
#Область СлужебныеПроцедурыИФункции

Процедура КвартальнаяОтчетностьПФРВыполнитьНазначеннуюКоманду(Форма, Команда) Экспорт
	Если Команда.Имя = "НеобходимыеКорректировкиСтажа" Тогда
		ОткрытьФормуСпискаНеобходимыКорректировокСтажа(Форма, Форма.Организация);	
	КонецЕсли;		
КонецПроцедуры	

Процедура ОткрытьФормуСпискаНеобходимыКорректировокСтажа(Владелец, Организация)
	ПараметрыОткрытия = Новый Структура("Организация", Организация);
	
	ОткрытьФорму("Обработка.ПодготовкаКвартальнойОтчетностиВПФР.Форма.НеобходимыеКорректировкиСтажа", ПараметрыОткрытия, Владелец);
	
КонецПроцедуры	

Процедура ПодобратьФизическихЛиц(ЭлементФормы, Организация, АдресСпискаПодобранныхСотрудников, МножественныйВыбор) Экспорт 
	
	КадровыйУчетКлиент.ПодобратьФизическихЛицОрганизации(ЭлементФормы, Организация, АдресСпискаПодобранныхСотрудников);
	
КонецПроцедуры

#КонецОбласти
