#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;

	Если ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеСоответствияДолжности Тогда
		Если ЭтоВнешняяАттестация Тогда
			ЭтоВнешняяАттестация = Ложь;
		КонецЕсли;
		Если ИсключаемыеСпециальности.Количество() > 0 Тогда
			ИсключаемыеСпециальности.Очистить();
		КонецЕсли;
	ИначеЕсли ТипАттестации = Перечисления.ТипыАттестацииСотрудников.ПодтверждениеКвалификацииПоСпециальности Тогда
		Если ИсключаемыеДолжности.Количество() > 0 Тогда
			ИсключаемыеДолжности.Очистить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	АттестацииСотрудников.УстановитьНеобходимостьВыбораВидаАттестации();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли