#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура УстановитьОбязательныеРеквизиты(Объект) Экспорт
			
	Если ЗначениеЗаполнено(Объект.Презентация) Тогда
		Объект.ТипНавигации = Перечисления.ТипыНавигацииСтраницЭлектронногоКурса.Слайды;
	КонецЕсли;	
	
КонецПроцедуры

Функция ЕдинственныйЭлемент(Теория, ВключатьЗависимые = Ложь) Экспорт
	
	Возврат Справочники.СтраницыЭлементовЭлектронныхКурсов.ЭлементЕдинственнойСтраницы(Теория, ВключатьЗависимые = Ложь);
	
КонецФункции

#КонецОбласти

#КонецЕсли
