////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиСобытийФормы

Процедура ПриЧтенииНаСервере(Форма) Экспорт
	ВзаиморасчетыССотрудникамиВХОФормыВнутренний.ПриПолученииДанныхНаСервере(Форма);
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма) Экспорт
	ВзаиморасчетыССотрудникамиВХОФормыВнутренний.ПриПолученииДанныхНаСервере(Форма);
КонецПроцедуры

#КонецОбласти

Процедура ВыполнениеКомандыНаСервере(Форма) Экспорт
	ВзаиморасчетыССотрудникамиВХОФормыВнутренний.ВыполнениеКомандыНаСервере(Форма);
КонецПроцедуры

#КонецОбласти

