////////////////////////////////////////////////////////////////////////////////
//
//   Подсистема персонифицированного учета - вызов серверных функций с клиента.
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция КомплектСодержащийРСВ_1(РСВ_1) Экспорт
	Возврат Справочники.КомплектыОтчетностиПерсучета.КомплектСодержащийРСВ_1(РСВ_1);
КонецФункции	
	
Функция ОписаниеАктивногоКомплектаПериода(Организация, ОтчетныйПериод) Экспорт
	Возврат Справочники.КомплектыОтчетностиПерсучета.ОписаниеАктивногоКомплектаПериода(Организация, ОтчетныйПериод, Ложь);	
КонецФункции

Функция КатегорииЗастрахованныхЛицОрганизации(Организация, ОтчетныйПериод, КорректирующиеСведения = Ложь) Экспорт
	Возврат ПерсонифицированныйУчет.КатегорииЗастрахованныхЛицОрганизации(Организация, ОтчетныйПериод, ,КорректирующиеСведения);	
КонецФункции

Функция ПолучитьДанныеФайла(Ссылка, УникальныйИдентификатор) Экспорт	
	Возврат ЗарплатаКадры.ПолучитьДанныеФайла(Ссылка, УникальныйИдентификатор);	
КонецФункции

#КонецОбласти
