#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() > 0 Тогда
		
		Настройки = ЭтотОбъект[0];
		Если Настройки.ИспользоватьАдаптациюУвольнение И Не ПолучитьФункциональнуюОпцию("ИспользоватьБизнесПроцессыИЗадачи") Тогда
			
			УстановитьПривилегированныйРежим(Истина);
			Константы.ИспользоватьБизнесПроцессыИЗадачи.Установить(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
	АдаптацияУвольнение.УстановитьПараметрыНабораСвойствМероприятияАдаптацииУвольнения();
	АдаптацияУвольнение.УстановитьПараметрыНабораСвойствДокументовАдаптацииУвольнения();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
