
#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПанелиВычеты() Экспорт
	
	ОписаниеПанели = УчетНДФЛКлиентСерверБазовый.ОписаниеПанелиВычеты();
	
	ОписаниеПанели.Вставить("РеквизитФормыСТекущимиДанными", "");
	
	Возврат ОписаниеПанели;
	
КонецФункции

Функция ОписаниеТабличнойЧастиНДФЛ() Экспорт
	
	ОписаниеТабличнойЧасти = УчетНДФЛКлиентСерверБазовый.ОписаниеТабличнойЧастиНДФЛ();
	
	ОписаниеТабличнойЧасти.Вставить("ИспользуетсяФиксРасчет", Ложь);
		
	Возврат ОписаниеТабличнойЧасти;
	
КонецФункции

Функция НДФЛТекущиеДанные(Форма, ОписаниеПанелиВычеты) Экспорт
	
	Если ПустаяСтрока(ОписаниеПанелиВычеты.РеквизитФормыСТекущимиДанными) Тогда
		ТекущиеДанные = УчетНДФЛКлиентСерверБазовый.НДФЛТекущиеДанные(Форма, ОписаниеПанелиВычеты);
	Иначе
		ТекущиеДанные = ОбщегоНазначенияКлиентСервер.ПолучитьРеквизитФормыПоПути(
			Форма, ОписаниеПанелиВычеты.РеквизитФормыСТекущимиДанными);
	КонецЕсли;
	
	Возврат ТекущиеДанные;
	
КонецФункции

Процедура УдалитьДанныеНДФЛФизическоголица(Объект, ФизическоеЛицо) Экспорт
	
	СтрокиНДФЛ = Объект.НДФЛ.НайтиСтроки(Новый Структура("ФизическоеЛицо", ФизическоеЛицо));
	Для каждого СтрокаНДФЛ Из СтрокиНДФЛ Цикл
		
		СтрокиВычетов = Объект.ПримененныеВычетыНаДетейИИмущественные.НайтиСтроки(
			Новый Структура("ИдентификаторСтрокиНДФЛ", СтрокаНДФЛ.ИдентификаторСтрокиНДФЛ));
			
		Для каждого СтрокаВычетов Из СтрокиВычетов Цикл
			Объект.ПримененныеВычетыНаДетейИИмущественные.Удалить(СтрокаВычетов);
		КонецЦикла;
		
		Объект.НДФЛ.Удалить(СтрокаНДФЛ);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыНДФЛ() Экспорт
	
	Описание = РасчетЗарплатыРасширенныйКлиентСервер.ОписаниеТаблицыРасчета();
	ЗаполнитьЗначенияСвойств(Описание, УчетНДФЛКлиентСерверБазовый.ФормаПодробнееОРасчетеНДФЛОписаниеТаблицыНДФЛ());
	
	Возврат Описание;
	
КонецФункции

#КонецОбласти
