#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение
//
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	Справочник.ПричиныОткрытияВакансий КАК ПричиныОткрытияВакансий");
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Причины = Новый Массив;
	Причины.Добавить(НСтр("ru = 'Увольнение'"));
	Причины.Добавить(НСтр("ru = 'Новая позиция'"));
	Причины.Добавить(НСтр("ru = 'Отпуск по уходу за ребенком'"));
	Причины.Добавить(НСтр("ru = 'Внутренний перевод'"));
	
	Индекс = 1;
	Для Каждого Причина Из Причины Цикл
		НовыйЭлемент = Справочники.ПричиныОткрытияВакансий.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Причина;
		НовыйЭлемент.РеквизитДопУпорядочивания = Индекс;
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		Индекс = Индекс + 1;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли