////////////////////////////////////////////////////////////////////////////////
// Обмен данными через универсальный формат Enterprise Data.
// Переопределяемые серверные процедуры и функции.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Вызывается перед записью настройки синхронизации данных через универсальный формат.
// Используется для обновления настроек использования обмена с конфигураций
//	"1С:ERP Управление предприятием 2".
//
// Параметры:
//    ОбменНастроен - Булево - признак того, что существует настроенная синхронизация с
//                             конфигурацией "1С:ERP Управление предприятием 2".
//
Процедура ОбновитьНастройкиИспользованияОбменаУправлениеПредприятием2(ОбменНастроен) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ОрганизационнаяСтруктура") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("ОрганизационнаяСтруктура");
		Модуль.ОбновитьНастройкиСтруктурыПредприятияПриИспользованииОбменаУП2(ОбменНастроен);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

// Добавляет в список Обработчики процедуры-обработчики обновления,
// необходимые данной подсистеме.
//
// Параметры:
//   Обработчики - ТаблицаЗначений - см. описание функции НоваяТаблицаОбработчиковОбновления
//                                   общего модуля ОбновлениеИнформационнойБазы.
// 
Процедура ЗарегистрироватьОбработчикиОбновления(Обработчики) Экспорт
	
КонецПроцедуры


#КонецОбласти