
#Область ПрограммныйИнтерфейс

// Позволяет потребителю изменить описание источника данных для построения запроса
// по уплате страховых взносов.
//
// Параметры:
//	ОписаниеИсточникаДанных - структура (см. УчетСтраховыхВзносов.ОписаниеИсточникаДанныхУплатаВзносов).
Процедура ИзменитьОписаниеИсточникаДанныхУплатаВзносов(ОписаниеИсточникаДанных) Экспорт
	
КонецПроцедуры	

// Позволяет потребителю изменить состав доступных тарифов страховых взносов.
//
// Параметры:
//		ДоступныеТарифы - Массив ссылок на элементы справочника ВидыТарифовСтраховыхВзносов.
//
Процедура ПриПолученииДоступныхТарифовСтраховыхВзносов(ДоступныеТарифы) Экспорт
	
КонецПроцедуры

#КонецОбласти
