#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроводитсяПовторно Тогда
		СтруктураПериода = Новый Структура("КоличествоРаз, КоличествоПериодов, Периодичность", КоличествоРаз, КоличествоПериодов, Периодичность);
		ПредставлениеПериода = ОхранаТруда.ПредставлениеПериодаПоСтруктуре(СтруктураПериода);
	Иначе
		ПредставлениеПериода = "Однократно";
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
