
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Справочники.РегламентированныеОтчеты.УстановитьСнятьПометкуНаУдаление();
	РегистрыСведений.СкрытыеРегламентированныеОтчеты.СкрытьВосстановитьОтчеты();
	УстановитьПривилегированныйРежим(Ложь);
	
	ОхранаТруда.УстановитьПараметрыНабораСвойствВидыПроисшествийПоследствияНесчастногоСлучая();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли