////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПослеВыгрузкиДокументовВФайл(МассивДокументов, ПолучаемыеФайлы, Форма) Экспорт
	
	Если МассивДокументов.Количество() > 0 Тогда
		
		ОповеститьОбИзменении(ТипЗнч(МассивДокументов[0]));
		
		Если Форма.ПолучитьФункциональнуюОпциюФормы("АвтоматическиОграничиватьИспользованиеДокументов") 
			И ПолучаемыеФайлы.Количество() > 0 Тогда
			ОграничениеИспользованияДокументовКлиент.ОповеститьОбОграниченииДокументов(МассивДокументов);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти



