
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура ВключитьИспользованиеМоегоОбученияРазвития(Параметры = Неопределено) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьОбучениеРазвитиеСотрудников") 
		И Не ПолучитьФункциональнуюОпцию("ИспользоватьЭлектронноеОбучение") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиСамообслуживанияСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0
		Или Не НаборЗаписей[0].ИспользоватьСамообслуживаниеСотрудников Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей[0].ИспользоватьМоеОбучениеРазвитие = Истина;
	
	ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли


