#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьСамообслуживаниеСотрудников = (Количество() > 0 И ЭтотОбъект[0].ИспользоватьСамообслуживаниеСотрудников);
	РегистрыСведений.НастройкиОбученияРазвития.УстановитьНастройкуИспользоватьПубликацииМероприятийОбученияРазвития(ИспользоватьСамообслуживаниеСотрудников);
	СамообслуживаниеСотрудников.УстановитьПараметрыНабораСвойствСправочников();
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли