#Область СлужебныйПрограммныйИнтерфейс

Процедура ПодготовитьСведенияОПериодахСреднегоЗаработкаФСС(Источник, Отказ, Замещение) Экспорт
		
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоВременныйНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	УчетСреднегоЗаработкаСобытия.СобратьДанныеДляРегистрацииПерерасчетов(Источник);
	
КонецПроцедуры

Процедура ПроверитьНеобходимостьПерерасчетаСреднегоЗаработкаФСС(Источник, Отказ, Замещение) Экспорт
		
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("ЭтоВременныйНаборЗаписей") Тогда
		Возврат;
	КонецЕсли;
	
	УчетСреднегоЗаработкаСобытия.ПроверитьНеобходимостьРегистрацииПерерасчетов(Источник, "ФСС");
	
КонецПроцедуры

#КонецОбласти
