#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
			
	Для Каждого ЗаписьНабора Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(ЗаписьНабора.ДействуетДо) Тогда
			ЗаписьНабора.ДействуетДо = КонецМесяца(ЗаписьНабора.ДействуетДо);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЗаписьНабора.ДействуетДо) Тогда
			ЗаписьНабора.ПринятПоДолгосрочномуДоговоруПоОкончании = Не ЗаписьНабора.ПринятПоДолгосрочномуДоговору;
		Иначе
			ЗаписьНабора.ПринятПоДолгосрочномуДоговоруПоОкончании = Ложь;
		КонецЕсли;			
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает структуру параметров для ограничения регистрации объекта при обмене
// Вызывается ПередЗаписью объекта.
//
// Возвращаемое значение:
//	ОграниченияРегистрации - Структура - Описание см. ОбменДаннымиЗарплатаКадры.ОграниченияРегистрации.
//
Функция ОграниченияРегистрации() Экспорт
	
	ИменаПолей = ОбменДаннымиЗарплатаКадры.ИменаПолейОграниченияРегистрацииРегистраСведений();
	ИменаПолей.Организации = "ГоловнаяОрганизация";
	ИменаПолей.ФизическиеЛица = "ФизическоеЛицо";
	
	Возврат ОбменДаннымиЗарплатаКадры.ОграниченияРегистрацииРегистраСведений(ЭтотОбъект, ИменаПолей);
	
КонецФункции

#КонецОбласти 

#КонецЕсли