////////////////////////////////////////////////////////////////////////////////
// Модуль для работы с рабочим календарем.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при подготовке таблицы занятости. Позволяет дополнить таблицу по данным произвольных источников.
//
// Параметры:
//	ТаблицаЗанятости - ТаблицаЗначений - таблица с колонками:
//		* Пользователь - СправочникСсылка.Пользователь - Пользователь, чья занятость определена.
//		* ДатаНачала - Дата - дата начала состояния занятости.
//		* ДатаОкончания - Дата - дата окончания состояния занятости.
//		* Занят - ПеречислениеСсылка.СостоянияЗанятости - состояние в заданном периоде.
//	ПараметрыЗанятости - Структура - со свойствами:
//		* Пользователи - Массив - массив пользователей, чья занятость определяется.
//		* ДатаНачала - Дата - дата начала проверки занятости.
//		* ДатаОкончания - Дата - дата окончания проверки занятости.
//		* ИсключенияЗанятости - Массив - исключаемые записи рабочего календаря.
//
Процедура ПриПолученииТаблицыЗанятостиПользователей(ТаблицаЗанятости, ПараметрыЗанятости) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриПолученииТаблицыЗанятостиПользователей(ТаблицаЗанятости, ПараметрыЗанятости);
	
КонецПроцедуры

// Позволяет переопределить признак необходимости проверки отсутствий.
//
// Параметры:
//	ПредупреждатьОбОтсутствии - Булево - переопределяемый признак.
//
Процедура ПриОпределенииНеобходимостиПредупреждатьОбОтсутствии(ПредупреждатьОбОтсутствии) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриОпределенииНеобходимостиПредупреждатьОбОтсутствии(ПредупреждатьОбОтсутствии);
	
КонецПроцедуры

// Позволяет уточнить право на изменение заданной записи рабочего календаря.
//
// Параметры:
//	ЗаписьКалендаря	- СправочникСсылка.ЗаписиРабочегоКалендаря - рассматриваемая запись рабочего календаря.
//	ЕстьПраво		- Булево - переопределяемый признак.
//
Процедура ПриОпределенииПраваИзмененияЗаписиРабочегоКалендаря(ЗаписьКалендаря, ЕстьПраво) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриОпределенииПраваИзмененияЗаписиРабочегоКалендаря(ЗаписьКалендаря, ЕстьПраво);
	
КонецПроцедуры

// Позволяет выполнить требуемые действия при необходимости создания напоминания по записи календаря.
//
// Параметры:
//	ЗаписьКалендаря - СправочникСсылка.Пользователи - пользователь, чье право устанавливается.
//	Напоминание - Неопределено, Структура - переопределяемое значение.
// 											описание см. НапоминанияПользователяКлиентСервер.ОписаниеНапоминания.
//
Процедура ПриПодключенииНапоминанияАвтоматически(ЗаписьКалендаря, Напоминание) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриПодключенииНапоминанияАвтоматически(ЗаписьКалендаря, Напоминание);
	
КонецПроцедуры

// Позволяет уточнить право на изменение записей рабочего календаря.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователи - пользователь, чье право устанавливается.
//	ЕстьПраво - Булево - переопределяемый признак.
//
Процедура ПриОпределенииПраваИзмененияКалендаря(Пользователь, ЕстьПраво) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриОпределенииПраваИзмененияКалендаря(Пользователь, ЕстьПраво);
	
КонецПроцедуры

// Позволяет уточнить свойства элемента планировщика.
//
// Параметры:
//	ЭлементПланировщика - ЭлементПланировщика - подготавливаемый элемент планировщика.
//	ЗаписьКалендаря - СправочникСсылка.ЗаписиРабочегоКалендаря - основание элемента.
//
Процедура ПриПолученииСтруктурыЭлементаПланировщика(ЭлементПланировщика, ЗаписьКалендаря) Экспорт
	
КонецПроцедуры

// Позволяет переопределить HTML представление для события, отличного от записи рабочего календаря.
//
// Параметры:
//	Событие	- ЛюбаяСсылка - ссылка на объект, который может выступать в качестве события вместо записи рабочего календаря.
//	ДатаСобытия - Дата - дата события, для которого формируется представление.
//	ПредставлениеHTML - Строка - переопределяемый признак.
//
Процедура ПриФормированииHTMLПредставленияСобытия(Событие, ДатаСобытия, ПредставлениеHTML) Экспорт
	
КонецПроцедуры

// Позволяет переопределить представление предмета записи рабочего календаря.
//
// Параметры:
//	Предмет	- ЛюбаяСсылка - ссылка на объект, который может выступать предметом записи рабочего календаря.
//	ПредставлениеПредмета - Строка - переопределяемый признак.
//
Процедура ПриПолученииПредставленияПредмета(Предмет, ПредставлениеПредмета) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриПолученииПредставленияПредмета(Предмет, ПредставлениеПредмета);
	
КонецПроцедуры

// Позволяет дополнить состав свойств записываемого предмета записи рабочего календаря.
//
// Параметры:
//	ПредметОбъект - ЛюбойОбъект - объект, который может выступать предметом записи рабочего календаря.
//
Процедура ПередЗаписьПредметаКалендаря(ПредметОбъект) Экспорт
	
КонецПроцедуры

// Позволяет переопределить признак заданности графика работы пользователя.
//
// Параметры:
//	Пользователь - СправочникСсылка.Пользователь - пользователь, для которого определяется наличие графика работы.
//	ПроверяемаяДата - Дата - дата, на которую проверяется заполненность графика.
//	ГрафикЗадан - Булево - переопределяемый признак.
//
Процедура ПриОпределенииЗаданностиГрафикаРаботыПользователя(Пользователь, Знач ПроверяемаяДата, ГрафикЗадан) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриОпределенииЗаданностиГрафикаРаботыПользователя(Пользователь, ПроверяемаяДата, ГрафикЗадан);
	
КонецПроцедуры

// Позволяет дополнить список рабочих дней текущего пользователя.
//
// Параметры:
//  РабочиеДни - СписокЗначений - Список дней, среди которых рабочие выделены пометкой.
//	ЗаполняемыеГода - Массив - массив лет, подлежащих заполнению.
//	ДатаЗаполнения - Дата - дата получения данных о рабочих днях.
//
Процедура ПриЗаполненииРабочихДнейПользователя(РабочиеДни, Знач ЗаполняемыеГода, Знач ДатаЗаполнения) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриЗаполненииРабочихДнейПользователя(РабочиеДни, ЗаполняемыеГода, ДатаЗаполнения);
	
КонецПроцедуры

// Позволяет заполнить набор записей регистра сведений ДоступноеВремяПользователя для текущего пользователя.
//
// Параметры:
//	НастройкиДоступногоВремени - РегистрСведений.ДоступноеВремяПользователя.НаборЗаписей - заполняемый набор.
//
Процедура ПриЗаполненииДоступногоВремениПользователя(НастройкиДоступногоВремени) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриЗаполненииДоступногоВремениПользователя(НастройкиДоступногоВремени);
	
КонецПроцедуры

// Позволяет отфильтровать таблицу событий пользователя.
//
// Параметры:
//	ТаблицаСобытий - ТаблицаЗначений - описание см. РаботаСРабочимКалендарем.ПолучитьТаблицуСобытий.
//	БезЗаписейОбОтсутствии - Булево - признак необходимости исключения записей об отсутствии.
//
Процедура ПриПолученииТаблицыСобытийПользователя(ТаблицаСобытий, Знач БезЗаписейОбОтсутствии) Экспорт
	
КонецПроцедуры

// Позволяет задать соответствующее состояние занятости по данным записи рабочего календаря.
//
Процедура ПриПолученииСостоянияЗанятости(СостояниеЗаписиРабочегоКалендаря, Связанная, Предмет, СостоянияЗанятости) Экспорт
	
КонецПроцедуры

// Позволяет переопределить получение навигационной ссылки по данным о записи рабочего календаря.
//
// Параметры:
//	ЗаписьКалендаря - СправочникСсылка.ЗаписиРабочегоКалендаря - анализируемая запись рабочего календаря.
//	НавигационнаяСсылка - Строка - навигационная ссылка, которая будет сохранена в истории работы пользователя.
//
Процедура ПриОпределенииНавигационнойСсылкиДляИстории(ЗаписьКалендаря, НавигационнаяСсылка) Экспорт

КонецПроцедуры

// Позволяет заполнить реквизиты создаваемой или обновляемой записи рабочего календаря по данным предмета.
//
// Параметры:
//	Предмет - ЛюбаяСсылка - ссылка на объект, который может выступать предметом записи рабочего календаря.
//	ЗаписьКалендаря - СправочникОбъект.ЗаписиРабочегоКалендаря - создаваемая запись рабочего календаря.
//
Процедура ПриЗаполненииЗаписиРабочегоКалендаряПоПредмету(Предмет, ЗаписьКалендаря) Экспорт
	
	РаботаСРабочимКалендаремБЗК.ПриЗаполненииЗаписиРабочегоКалендаряПоПредмету(Предмет, ЗаписьКалендаря);
	
КонецПроцедуры

// Позволяет уточнить реквизиты создаваемой записи рабочего календаря.
//
// Параметры:
//	ЗаписьКалендаря - СправочникОбъект.ЗаписиРабочегоКалендаря - создаваемая запись рабочего календаря.
//
Процедура ПриЗаполненииНовойЗаписиРабочегоКалендаря(ЗаписьКалендаря) Экспорт
	
КонецПроцедуры

// Позволяет выполнить необходимые действия во время события ПриЗаписи записи рабочего календаря.
//
// Параметры:
//	ЗаписьКалендаря - СправочникОбъект.ЗаписиРабочегоКалендаря - создаваемая запись рабочего календаря.
//	Отказ - Булево - признак отказа от записи.
//
Процедура ПриЗаписиЗаписиРабочегоКалендаря(ЗаписьКалендаря, Отказ) Экспорт
	
КонецПроцедуры

// Позволяет переопределить открытие формы записи рабочего календаря.
// В ДополнительнойИнформации передан Предмет.
//
Процедура ПриОбработкеПолученияФормыЗаписиРабочегоКалендаря(ВидФормы, Параметры, ВыбраннаяФорма, ДопИнформация, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

// Позволяет вывести область РеквизитыМероприятия макета календаря, предварительно заполнив ее параметры.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент - выводимый табличный документ.
//	Область - ОбластьЯчеекТабличногоДокумента - выводимая область.
//	Реквизиты - Структура - реквизиты записи календаря.
//
Процедура ПриВыводеОбластиРеквизитыМероприятия(ТабличныйДокумент, Область, Реквизиты) Экспорт
	
КонецПроцедуры

#КонецОбласти

