#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет первоначальное заполнение
//
Процедура НачальноеЗаполнение() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.НастройкиПодбораПерсонала КАК НастройкиПодбораПерсонала
	|ГДЕ
	|	НастройкиПодбораПерсонала.ИспользоватьПодборПерсонала
	|	И НЕ НастройкиПодбораПерсонала.ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах");
	
	Если Запрос.Выполнить().Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НастройкиПодбораПерсонала.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей[0].ИспользоватьОценкуЭффективностиИсточниковИнформацииОКандидатах = Истина;
		НаборЗаписей.Записать();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли