#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует событие из переданного текста.
//
// Параметры:
//  Текст - Строка - обрабатываемый текст.
//  ДатаТекста - Дата - дата, к которой относится текст.
// 
// Возвращаемое значение:
//  Структура - событие в тексте.
//   * Тип - Строка - тип найденного в тексте события.
//   * Дата - Строка - дата события.
//   * Время - Строка - время события.
//   * Начало - Дата - дата начала события.
//   * Конец - Дата - дата окончания события.
//   * Место - Строка - место проведения события.
//   * Email - Строка - email для связи.
//   * Текст - Строка - часть текста, соответствующая событию.
//
Функция Событие(Текст, ДатаТекста = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Обработка = Обработки.АнализТекста.Создать();
	Обработка.ИсходныйТекст = Текст;
	Обработка.ДатаИсходногоТекста = ДатаТекста;
	Событие = Обработка.Событие();
	
	Возврат Событие;
	
КонецФункции

#КонецОбласти

#КонецЕсли


