#Область ПрограммныйИнтерфейс

Функция ОшибкиСервер() Экспорт
	
	ПараметрыОтправки = ДлительнаяОтправкаКлиентСервер.ЗначенияПараметровДлительнойОтправки();
	Возврат ПараметрыОтправки["Ошибки"];
	
КонецФункции

Процедура ИзменитьПараметрыДлительнойОтправкиСервер(КлючПараметра, НовоеЗначение) Экспорт
	
	ДлительнаяОтправкаКлиентСервер.ИзменитьПараметрыДлительнойОтправки(КлючПараметра, НовоеЗначение);
	
КонецПроцедуры

Процедура ОчиститьПараметрыДлительнойОтправкиСервер() Экспорт

	ДлительнаяОтправкаКлиентСервер.ОчиститьПараметрыДлительнойОтправки();

КонецПроцедуры

Функция ПолучитьОшибкиПоследнегоОбмена() Экспорт
	
	Возврат ХранилищеОбщихНастроек.Загрузить("ДокументооборотСКонтролирующимиОрганами_ОшибкиПоследнегоОбмена");

КонецФункции

Процедура СохранитьОшибкиПоследнегоОбмена(СведенияПоОшибкам) Экспорт
	
	ХранилищеОбщихНастроек.Сохранить("ДокументооборотСКонтролирующимиОрганами_ОшибкиПоследнегоОбмена",, СведенияПоОшибкам);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти