#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	// Статистика по тестам курсов
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыТестированийЭлектронныхКурсов");
	НастройкиВарианта.Описание = НСтр("ru = 'Сводные результаты тестирований в электронных курсах.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьЭлектронноеОбучение");
	
	// Статистика по вопросам тестов
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыОтветовНаВопросыТестов");
	НастройкиВарианта.Описание = НСтр("ru = 'Сводная статистика по каждому вопросу тестов электронных курсов.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьЭлектронноеОбучение");
	
	// Результаты тестирований учащихся
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыТестированийПользователей");
	НастройкиВарианта.Описание = НСтр("ru = 'Информация о результатах тестов учащихся по электронным курсам.'");
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьЭлектронноеОбучение");
	
	// Рейтинг учащихся
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РейтингПользователей");
	НастройкиВарианта.Описание = НСтр("ru = 'Учащиеся с лучшими результатами электронных тестов.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьЭлектронноеОбучение");
	
	// Результаты тестирований по годам
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыТестированийПоГодам");
	НастройкиВарианта.Описание = НСтр("ru = 'Сводная статистика электронных тестов по годам.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьЭлектронноеОбучение");
	
	// Результаты тестирований по месяцам
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "РезультатыТестированийПоМесяцам");
	НастройкиВарианта.Описание = НСтр("ru = 'Сводная статистика электронных тестов по месяцам.'");
	НастройкиВарианта.ВидимостьПоУмолчанию = Ложь;	
	НастройкиВарианта.ФункциональныеОпции.Добавить("ИспользоватьЭлектронноеОбучение");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли