
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	АдаптацияУвольнениеВызовСервера.ОбработкаПолученияДанныхВыбораПеречисленияВидыСобытийАдаптацииУвольнения(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ДоступныеВидыСобытий(ВидМероприятия = НеОпределено) Экспорт
	
	Если Не ЗначениеЗаполнено(ВидМероприятия) Тогда
		ВидыСобытий = СобытияАдаптации();
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ВидыСобытий, СобытияУвольнения(), Истина);
	ИначеЕсли ВидМероприятия = Перечисления.ВидыМероприятийАдаптацииУвольнения.Адаптация Тогда
		ВидыСобытий = СобытияАдаптации();
	Иначе
		ВидыСобытий = СобытияУвольнения();
	КонецЕсли;
	
	Возврат ВидыСобытий;
	
КонецФункции

Функция СобытияАдаптации() Экспорт
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(ВозвратИзОтпускаПоУходуЗаРебенком);
	ВидыСобытий.Добавить(ВосстановлениеВДолжности);
	ВидыСобытий.Добавить(Прием);
	ВидыСобытий.Добавить(Перемещение);
	
	Возврат ВидыСобытий;
	
КонецФункции

Функция СобытияУвольнения() Экспорт
	
	ВидыСобытий = Новый Массив;
	ВидыСобытий.Добавить(Перемещение);
	ВидыСобытий.Добавить(ОтпускПоУходуЗаРебенком);
	ВидыСобытий.Добавить(Увольнение);
	
	Возврат ВидыСобытий;
	
КонецФункции

#КонецОбласти

#КонецЕсли