
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
// ОбщийМодуль.ПодключениеСервисовСопровожденияГлобальный.
//
// Глобальные процедуры и функции подключения тестовых периодов.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Проверка обработки запросов на подключение тестовых периодов.
//
Процедура ПодключениеТестовыхПериодов_ПроверитьСостояниеЗапроса() Экспорт
	
	ПодключениеСервисовСопровожденияКлиент.ПроверитьСостояниеЗапроса();
	
КонецПроцедуры

#КонецОбласти
