#Область СлужебныеПроцедурыИФункции

Функция ТипыВладельцевЭлектронныхДокументов() Экспорт
	ТипыВладельцевЭлектронныхДокументов = Новый Массив;
	
	ТипыВладельцевЭлектронныхДокументов.Добавить(Тип("ДокументОбъект.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников"));
	ТипыВладельцевЭлектронныхДокументов.Добавить(Тип("ДокументОбъект.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников"));
	ТипыВладельцевЭлектронныхДокументов.Добавить(Тип("ДокументОбъект.ВедомостьНаВыплатуЗарплатыВБанк"));
	ТипыВладельцевЭлектронныхДокументов.Добавить(Тип("ДокументОбъект.ПлатежноеПоручение"));
	
	Возврат ТипыВладельцевЭлектронныхДокументов
КонецФункции

#КонецОбласти
