
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстОбщегоЗапроса(ИсточникДанных) Экспорт
	
	Возврат ЗарплатаКадрыОбщиеНаборыДанныхРасширенный.ПолучитьТекстОбщегоЗапроса(ИсточникДанных);
	
КонецФункции

Функция ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров) Экспорт
	
	Возврат ЗарплатаКадрыОбщиеНаборыДанныхРасширенный.ПолучитьЗапросПоПредставлению(ТекстЗапроса, СоответствиеПараметров);
	
КонецФункции

Процедура ПриПолученииСвойствРегистра(ИмяРегистра, СтруктураОписанияРегистра) Экспорт
	ЗарплатаКадрыОбщиеНаборыДанныхРасширенный.ПриПолученииСвойствРегистра(ИмяРегистра, СтруктураОписанияРегистра);	
КонецПроцедуры

Функция ЗапросВТПредставленияОтработанноеВремя(ИмяВТНачисленияИУдержания, НачалоПериода, ОкончаниеПериода, ИмяВТОтработанноеВремя) Экспорт
	
	Возврат ЗарплатаКадрыОбщиеНаборыДанныхРасширенный.ЗапросВТПредставленияОтработанноеВремя(ИмяВТНачисленияИУдержания, НачалоПериода, ОкончаниеПериода, ИмяВТОтработанноеВремя);
	
КонецФункции

Функция ЗапросПредставленияКадровыеДанныеСотрудниковАнализНачисленийИУдержаний(ТекстИсходногоЗапроса) Экспорт
	
	Возврат ЗарплатаКадрыОбщиеНаборыДанныхРасширенный.ЗапросПредставленияКадровыеДанныеСотрудниковАнализНачисленийИУдержаний(ТекстИсходногоЗапроса);
	
КонецФункции

Функция ЗапросПредставленияПодразделенияСортировкиСотрудников() Экспорт
	
	Возврат ЗарплатаКадрыОбщиеНаборыДанныхРасширенный.ЗапросПредставленияПодразделенияСортировкиСотрудников();
	
КонецФункции

#КонецОбласти
