
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("МассивСтруктурПрограмм") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = Параметры.Страхователь;
	ЭтоСотрудник = Параметры.ЭтоСотрудник;
	ДатаНачалаСтрахования = Параметры.ДатаНачалаСтрахования;
	ДатаОкончанияСтрахования = Параметры.ДатаОкончанияСтрахования;
	ДатаНачала = Параметры.ДатаНачала;
	ДатаОкончания = Параметры.ДатаОкончания;
	ДатаРождения = Параметры.ДатаРождения;
	СтраховаяКомпания = Параметры.СтраховаяКомпания;
	
	Для Каждого СтруктураПрограммы Из Параметры.МассивСтруктурПрограмм Цикл
		НоваяСтрока = ПрограммыСтрахования.Добавить();
		НоваяСтрока.ПрограммаСтрахования = СтруктураПрограммы.ПрограммаСтрахования;
		НоваяСтрока.СтраховаяПремия = СтруктураПрограммы.СтраховаяПремия;
	КонецЦикла;
	
	Для Каждого СтрокаШкалы Из Параметры.ШкалаВозрастов Цикл
		НоваяСтрока = ШкалаВозрастов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаШкалы);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСотрудники

&НаКлиенте
Процедура ПрограммыСтрахованияПрограммаСтрахованияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ПрограммыСтрахования.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.СтраховаяПремия = СтраховаяПремия(ТекущиеДанные.ПрограммаСтрахования);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	МассивСтруктурПрограмм = Новый Массив;
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтруктураПрограммы = Новый Структура("ПрограммаСтрахования, СтраховаяПремия", СтрокаТаблицы.ПрограммаСтрахования, СтрокаТаблицы.СтраховаяПремия);
		МассивСтруктурПрограмм.Добавить(СтруктураПрограммы);
	КонецЦикла;
	
	Закрыть(МассивСтруктурПрограмм);
	
КонецПроцедуры

&НаКлиенте
Процедура Пересчитать(Команда)
	
	Для Каждого СтрокаТаблицы Из ПрограммыСтрахования Цикл
		СтрокаТаблицы.СтраховаяПремия = СтраховаяПремия(СтрокаТаблицы.ПрограммаСтрахования);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СтраховаяПремия(ПрограммаСтрахования)
	
	ДатыСтрахования = Новый Структура;
	ДатыСтрахования.Вставить("ДатаНачала", ДатаНачала);
	ДатыСтрахования.Вставить("ДатаОкончания", ДатаОкончания);
	ДатыСтрахования.Вставить("ДатаНачалаСтрахования", ДатаНачалаСтрахования);
	ДатыСтрахования.Вставить("ДатаОкончанияСтрахования", ДатаОкончанияСтрахования);
	
	Возврат МедицинскоеСтрахование.СтраховаяПремия(ПрограммаСтрахования, ДатыСтрахования, ДатаРождения, ШкалаВозрастов, ЭтоСотрудник);
	
КонецФункции

#КонецОбласти
