#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.УдалитьИсторияИспользованияПодразделений.ДополнитьНаборИспользованиемВИерархии(ЭтотОбъект);
	РегистрыСведений.УдалитьИсторияИспользованияПодразделений.СохранитьИзменениеИспользованияПодразделений(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли