#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Печать заявления о выплате пособия.
	ПравоЧтенияПлановыхНачислений = КадровыйУчет.ПравоНаРазделУчета("Чтение", "ПлановыеНачисления");
	Если ПравоЧтенияПлановыхНачислений Тогда
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "ЗарплатаКадрыКлиент.ВыполнитьКомандуПечати";
		КомандаПечати.Идентификатор = "ЗаявлениеСотрудникаНаВыплатуПособия";
		КомандаПечати.Представление = НСтр("ru = 'Заявления о выплате пособия (оплате отпуска)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КонецЕсли;
	
	ПрямыеВыплатыПособийСоциальногоСтрахования.ДобавитьКомандыПечатиЗаявленияСотрудникаНаВыплатуПособия(КомандыПечати);
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивСсылок – Массив – ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати – Структура – дополнительные настройки печати;
//  КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
//  ОбъектыПечати – СписокЗначений – значение – ссылка на объект;
//                                            представление – имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода – Структура – дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивСсылок, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеСотрудникаНаВыплатуПособия") Тогда
		ТабличныйДокумент = ТабличныйДокументЗаявленияСотрудниковНаВыплатуПособия(МассивСсылок, ОбъектыПечати);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЗаявлениеСотрудникаНаВыплатуПособия",
			Нстр("ru = 'Заявление сотрудника на выплату пособия'"),
			ТабличныйДокумент);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает описание состава документа
//
// Возвращаемое значение:
//  Структура - см. ЗарплатаКадрыСоставДокументов.НовоеОписаниеСоставаДокумента.
Функция ОписаниеСоставаДокумента() Экспорт
	
	МетаданныеДокумента = Метаданные.Документы.ЗаявлениеСотрудникаНаВыплатуПособия;
	Возврат ЗарплатаКадрыСоставДокументов.ОписаниеСоставаДокументаПоМетаданнымФизическоеЛицоВШапке(МетаданныеДокумента);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ТабличныйДокументЗаявленияСотрудниковНаВыплатуПособия

Функция ТабличныйДокументЗаявленияСотрудниковНаВыплатуПособия(МассивСсылок, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ЗаявлениеСотрудникаНаВыплатуПособия";
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ДанныеДляПечатиЗаявлений = ДанныеДляПечатиЗаявлений(МассивСсылок);
	
	ДатаФорм2017 = ПрямыеВыплатыПособийСоциальногоСтрахования.ДатаВступленияВСилуФорм2017Года();
	Для каждого Заявление Из ДанныеДляПечатиЗаявлений Цикл
		ИмяМакета = ?(Заявление.Дата < ДатаФорм2017, "ПФ_MXL_ЗаявлениеВФССОВыплатеПособия_2012", "ПФ_MXL_ЗаявлениеВФССОВыплатеПособия_2017");
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявлениеСотрудникаНаВыплатуПособия." + ИмяМакета);
		
		Если ИмяМакета = "ПФ_MXL_ЗаявлениеВФССОВыплатеПособия_2012" Тогда
			ЗаполнитьДанныеЗаявленияВМакете_2012(Макет, Заявление);
		Иначе
			ЗаполнитьДанныеЗаявленияВМакете_2017(Макет, Заявление);
		КонецЕсли;
		
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		НачалоТекущегоФрагмента = ТабличныйДокумент.ВысотаТаблицы + 1;
		ТабличныйДокумент.Вывести(Макет);
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НачалоТекущегоФрагмента, ОбъектыПечати, Заявление.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
КонецФункции

#Область ДанныеДляПечатиЗаявлений

Функция ДанныеДляПечатиЗаявлений(ПечатаемыеЗаявления)
	Таблица = РезультатЗапросаДанныхДляПечатиЗаявлений(ПечатаемыеЗаявления).Выгрузить();
	
	// Проверка прав.
	ПравоЧтенияСреднегоЗаработка = КадровыйУчет.ПравоНаРазделУчета("Чтение", "НачисленнаяЗарплата");
	Если Не ПравоЧтенияСреднегоЗаработка Тогда
		ВидПособиеПоУходуЗаРебенком = ПредопределенноеЗначение("Перечисление.ПособияНазначаемыеФСС.ЕжемесячноеПособиеПоУходуЗаРебенком");
		Найденные = Таблица.НайтиСтроки(Новый Структура("ВидПособия", ВидПособиеПоУходуЗаРебенком));
		Для Каждого СтрокаТаблицы Из Найденные Цикл
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: Недостаточно прав для печати заявления, содержащего средний заработок сотрудника.'"),
				Строка(СтрокаТаблицы.Ссылка));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, СтрокаТаблицы.Ссылка);
			Таблица.Удалить(СтрокаТаблицы);
		КонецЦикла;
	КонецЕсли;
	
	// Перевод строковых данных в верхний регистр.
	ТипСтрока = Тип("Строка");
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		Для Каждого Колонка Из Таблица.Колонки Цикл
			Значение = СтрокаТаблицы[Колонка.Имя];
			Если ТипЗнч(Значение) = ТипСтрока И Не ЭтоСтрокаXML(Значение) Тогда
				СтрокаТаблицы[Колонка.Имя] = ВРег(Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат Таблица;
КонецФункции

Функция РезультатЗапросаДанныхДляПечатиЗаявлений(ПечатаемыеЗаявления)
	
	Запрос = Новый Запрос();
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Заявление.Ссылка КАК Ссылка,
	|	Заявление.Дата КАК Дата,
	|	Заявление.ВидПособия КАК ВидПособия,
	|	Заявление.Перерасчет КАК Перерасчет,
	|	Заявление.НаименованиеТерриториальногоОрганаФСС КАК НаименованиеТерриториальногоОрганаФСС,
	|	Заявление.ФамилияЗаявителя КАК ФамилияЗаявителя,
	|	Заявление.ИмяЗаявителя КАК ИмяЗаявителя,
	|	Заявление.ОтчествоЗаявителя КАК ОтчествоЗаявителя,
	|	Заявление.ФамилияПолучателя КАК ФамилияПолучателя,
	|	Заявление.ИмяПолучателя КАК ИмяПолучателя,
	|	Заявление.ОтчествоПолучателя КАК ОтчествоПолучателя,
	|	Заявление.СпособВыплатыПособия КАК СпособВыплатыПособия,
	|	Заявление.НаименованиеБанка КАК НаименованиеБанка,
	|	Заявление.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	|	Заявление.БИКБанка КАК БИКБанка,
	|	Заявление.ДатаРожденияПолучателя КАК ДатаРождения,
	|	Заявление.СерияДокументаУдостоверяющегоЛичностьПолучателя КАК УдостоверениеЛичностиСерия,
	|	Заявление.НомерДокументаУдостоверяющегоЛичностьПолучателя КАК УдостоверениеЛичностиНомер,
	|	Заявление.ДатаВыдачиДокументаУдостоверяющегоЛичностьПолучателя КАК УдостоверениеЛичностиДата,
	|	Заявление.КемВыданДокументУдостоверяющийЛичностьПолучателя КАК УдостоверениеЛичностиКемВыдан,
	|	Заявление.ДатаДействияДокументаУдостоверяющегоЛичностьПолучателя КАК УдостоверениеЛичностиСрокДействия,
	|	Заявление.СерияДокументаНаПроживание КАК СерияДокументаНаПроживание,
	|	Заявление.НомерДокументаНаПроживание КАК НомерДокументаНаПроживание,
	|	Заявление.ДатаВыдачиДокументаНаПроживание КАК ДатаВыдачиДокументаНаПроживание,
	|	Заявление.АдресПолучателяРегистрации КАК АдресРегистрации,
	|	Заявление.АдресПолучателяФактический КАК АдресПроживания,
	|	Заявление.ТелефонПолучателя КАК Телефон,
	|	Заявление.ДатаСправкиОПостановкеНаУчетВРанниеСрокиБеременности КАК ДатаСправкиБеременной,
	|	Заявление.НомерСправкиОПостановкеНаУчетВРанниеСрокиБеременности КАК НомерСправкиБеременной,
	|	Заявление.ДатаЛисткаНетрудоспособности КАК ДатаВыдачиБольничного,
	|	Заявление.НомерЛисткаНетрудоспособности КАК НомерБольничного,
	|	Заявление.НомерИногоДокументаПодтверждающегоРождение КАК НомерИногоПодтвержденияРождения,
	|	Заявление.ДатаИногоДокументаПодтверждающегоРождение КАК ДатаИногоПодтвержденияРождения,
	|	Заявление.ФормаСправкиОРожденииРебенка КАК ВидСправкиОРожденииРебенка,
	|	Заявление.ДатаСправкиОРожденииРебенка КАК ДатаСправкиОРождении,
	|	Заявление.НомерСправкиОРожденииРебенка КАК НомерСправкиОРождении,
	|	Заявление.ДатаРешенияОбУсыновлении КАК ДатаРешенияОбУсыновлении,
	|	Заявление.НомерРешенияОбУсыновлении КАК НомерРешенияОбУсыновлении,
	|	Заявление.ДатаДоговораОПередачеРебенкаВПриемнуюСемью КАК ДатаДоговораОПередачеНаВоспитание,
	|	Заявление.НомерДоговораОПередачеРебенкаВПриемнуюСемью КАК НомерДоговораОПередачеНаВоспитание,
	|	Заявление.Дата КАК ДатаПодачиЗаявления,
	|	Заявление.НаличиеОдногоИзДокументовНаПредыдущихДетей КАК НаличиеДокументаОРожденииПредыдущегоРебенка,
	|	Заявление.НаличиеСвидетельстваОСмертиПредыдущихДетей КАК НаличиеДокументаОСмертиПредыдущегоРебенка,
	|	Заявление.СправкаОНеполученииПособия КАК СправкаОНеполученииПособия,
	|	Заявление.ДатаСправкиОНеполученииПособияОтОтца КАК ДатаСправкиОтОтца,
	|	Заявление.НомерСправкиОНеполученииПособияОтОтца КАК НомерСправкиОтОтца,
	|	Заявление.ДатаСправкиОНеполученииПособияОтМатери КАК ДатаСправкиОтМатери,
	|	Заявление.НомерСправкиОНеполученииПособияОтМатери КАК НомерСправкиОтМатери,
	|	Заявление.ДатаСправкиОНеполученииПособияПоДругимМестамРаботы КАК ДатаСправкиПоДругимМестамРаботы,
	|	Заявление.НомерСправкиОНеполученииПособияПоДругимМестамРаботы КАК НомерСправкиПоДругимМестамРаботы,
	|	Заявление.ДатаСвидетельстваОРождении КАК ДатаСвидетельстваОРождении,
	|	Заявление.СерияСвидетельстваОРождении КАК СерияСвидетельстваОРождении,
	|	Заявление.НомерСвидетельстваОРождении КАК НомерСвидетельстваОРождении,
	|	Заявление.ДатаРешенияОбОпеке КАК ДатаРешенияОбОпеке,
	|	Заявление.НомерРешенияОбОпеке КАК НомерРешенияОбОпеке,
	|	Заявление.ДатаПриказаОПредоставленииОтпускаПоУходуЗаРебенком КАК ДатаПриказаНаОтпускПоУходуЗаРебенком,
	|	Заявление.ДатаНачалаОтпускаПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенкомДатаНачало,
	|	Заявление.ДатаОкончанияОтпускаПоУходуЗаРебенком КАК ОтпускПоУходуЗаРебенкомДатаОкончание,
	|	Заявление.НомерПриказаОПредоставленииОтпускаПоУходуЗаРебенком КАК НомерПриказаНаОтпускПоУходуЗаРебенком,
	|	ВЫБОР
	|		КОГДА Заявление.ОтношениеКОсобойЗоне = ЗНАЧЕНИЕ(Перечисление.ОтношениеКОсобойЗоне.Проживает)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПроживаниеВЗоне,
	|	ВЫБОР
	|		КОГДА Заявление.ОтношениеКОсобойЗоне = ЗНАЧЕНИЕ(Перечисление.ОтношениеКОсобойЗоне.Работает)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РаботаВЗоне,
	|	ВЫБОР
	|		КОГДА Заявление.ВидОсобойЗоныПроживанияРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыОсобойЗоныПроживанияРаботы.ЗонаСПравомНаОтселение)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВЗонеСПравомНаОтселение,
	|	ВЫБОР
	|		КОГДА Заявление.ВидОсобойЗоныПроживанияРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыОсобойЗоныПроживанияРаботы.ЗонаОтселения)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВЗонеОтселения,
	|	ВЫБОР
	|		КОГДА Заявление.ВидОсобойЗоныПроживанияРаботы = ЗНАЧЕНИЕ(Перечисление.ВидыОсобойЗоныПроживанияРаботы.ЗонаСЛьготнымСоциальноЭкономическимСтатусом)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ВЗонеСЛьготнымСтатусом,
	|	Заявление.НаименованиеОрганизации КАК НаименованиеОрганизации,
	|	Заявление.ТипЗанятостиРаботника КАК ВидЗанятостиСотрудника,
	|	Заявление.СНИЛСПолучателя КАК СНИЛССотрудника,
	|	Заявление.ИННПолучателя КАК ИННСотрудника,
	|	Заявление.ЗамененыКалендарныеГодыРасчетаСреднегоЗаработка КАК ЗаявлениеРаботникаОЗаменеКалендарныхГодов,
	|	Заявление.ПервыйЗамененныйГод КАК ПервыйЗамененныйГод,
	|	Заявление.ПервыйРасчетныйГод КАК ПервыйРасчетныйГод,
	|	Заявление.ВторойЗамененныйГод КАК ВторойЗамененныйГод,
	|	Заявление.ВторойРасчетныйГод КАК ВторойРасчетныйГод,
	|	Заявление.ПервыйЗамененныйГод <> Заявление.ПервыйРасчетныйГод КАК ПервыйГодЗаменен,
	|	Заявление.ВторойЗамененныйГод <> Заявление.ВторойРасчетныйГод КАК ВторойГодЗаменен,
	|	Заявление.ЗаработокПервыйГодРасчета КАК ЗаработокПервыйГодРасчета,
	|	Заявление.ЗаработокВторойГодРасчета КАК ЗаработокВторойГодРасчета,
	|	Заявление.СчитатьПоПравилам2010Года КАК ЗаявлениеПоМатеринству2010,
	|	Заявление.ДатаНачалаРасчетногоПериода КАК ЗаявлениеПоМатеринству2010ДатаНачало,
	|	Заявление.ДатаОкончанияРасчетногоПериода КАК ЗаявлениеПоМатеринству2010ДатаОкончание,
	|	Заявление.ЧислоКалендарныхДнейРасчетногоПериода КАК ЧислоКалендарныхДней,
	|	Заявление.НеполноеРабочееВремя КАК НеполноеРабочееВремя,
	|	Заявление.РазмерСтавки КАК ДоляВремени,
	|	Заявление.ДолжностнойОклад КАК ТарифнаяСтавкаОклад,
	|	Заявление.ЗаработокПервыйГодРасчета + Заявление.ЗаработокВторойГодРасчета КАК СреднийЗаработок,
	|	Заявление.ПериодПростоя1ДатаНачала КАК ПериодПростояДатаНачало,
	|	Заявление.ПериодПростоя1ДатаОкончания КАК ПериодПростояДатаОкончание,
	|	Заявление.ПериодПростоя1СреднийЗаработок КАК СреднедневнойЗаработокНаПериодПростоя,
	|	Заявление.НеоплачиваемыйПериод1ДатаНачала КАК ПособияНеНазначаютсяДатаНачало,
	|	Заявление.НеоплачиваемыйПериод2ДатаНачала КАК ПособияНеНазначаютсяДатаОкончание,
	|	Заявление.ФИОУполномоченного КАК ФИОРуководителя,
	|	Заявление.ДолжностьУполномоченного КАК ДолжностьРуководителя,
	|	Заявление.ТелефонУполномоченного КАК ТелефонСоставителя,
	|	Заявление.НомерКартыМИР КАК НомерКартыМИР,
	|	ВидДокументаУдостоверениеЛичности.КодМВД КАК КодУдостоверенияЛичности,
	|	ВидДокументаДокументНаПроживание.КодМВД КАК КодДокументаНаПроживание,
	|	ЕСТЬNULL(БольничныйЛист.Хеш, """") <> """" КАК ЭтоЭЛН
	|ИЗ
	|	Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК Заявление
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовФизическихЛиц КАК ВидДокументаУдостоверениеЛичности
	|		ПО Заявление.ВидДокументаУдостоверяющегоЛичностьПолучателя = ВидДокументаУдостоверениеЛичности.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыДокументовФизическихЛиц КАК ВидДокументаДокументНаПроживание
	|		ПО Заявление.ВидДокументаНаПроживание = ВидДокументаДокументНаПроживание.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.БольничныйЛист КАК БольничныйЛист
	|		ПО Заявление.ДокументОснование = БольничныйЛист.Ссылка
	|ГДЕ
	|	Заявление.Ссылка В(&ПечатаемыеЗаявления)";
	
	Запрос.УстановитьПараметр("ПечатаемыеЗаявления", ПечатаемыеЗаявления);
	
	Возврат Запрос.Выполнить();

КонецФункции 

Функция ЭтоСтрокаXML(Строка)
	Возврат СтрНачинаетсяС(Строка, "<");
КонецФункции

#КонецОбласти

Процедура ЗаполнитьДанныеЗаявленияВМакете_2012(Макет, Заявление)
	
	ЗаполнитьВМакетеНаименованиеФСС(Макет, Заявление);
	
	ЗаполнитьВМакетеФИОЗаявителя(Макет, Заявление);
	
	ЗаполнитьВМакетеВидПособия_2012(Макет, Заявление);
	
	Если ПособиеВыплачиваетсяЧерезБанк(Заявление) Тогда
		ЗаполнитьВМакетеВыплатуЧерезБанк(Макет, Заявление);
	Иначе 
		ЗаполнитьВМакетеВыплатуЧерезПочту_2012(Макет, Заявление);
	КонецЕсли; 
	
	ЗаполнитьВМакетеФИОПолучателя(Макет, Заявление);
	
	ЗаполнитьВМакетеДатуРожденияПолучателя(Макет, Заявление);
	
	ЗаполнитьВМакетеУдостоверениеЛичности_2012(Макет, Заявление);
	
	ЗаполнитьВМакетеРазрешениеНаПроживание(Макет, Заявление);
	
	ЗаполнитьВМакетеСведенияОМестеЖительства_2012(Макет, Заявление);
	
	ЗаполнитьВМакетеТелефонПолучателя(Макет, Заявление);
	
	Если ЭтоПособиеПоВременнойНетрудоспособности(Заявление.ВидПособия)
		Или ЭтоПособиеПоНесчастномуСлучаю(Заявление.ВидПособия)
		Или ЭтоПособиеПоБеременностиИРодам(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеРеквизитыЛН(Макет, Заявление);
	КонецЕсли;
	
	Если ЭтоПособиеВставшимНаУчетВРанниеСроки(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеРеквизитыСправкиОПостановкеНаУчетВРанниеСрокиБеременности(Макет, Заявление);
	КонецЕсли;
	
	Если ЭтоЕдиновременноеПособиеПриРожденииРебенка(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеОбластьЕдиновременногоПособияПриРожденииРебенка_2012(Макет, Заявление);
	КонецЕсли;
	
	Если ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеОбластьЕжемесячноеПособиеПоУходуЗаРебенком_2012(Макет, Заявление);
	КонецЕсли;
	
	ЗаполнитьВМакетеДатуПодачиЗаявления(Макет, Заявление);
	
	ЗаполнитьВМакетеНаименованиеРаботодателя(Макет, Заявление, 26);
	
	ЗаполнитьВМакетеВидЗанятостиСотрудника(Макет, Заявление);
	
	ЗаполнитьВМакетеСНИЛССотрудника(Макет, Заявление);
	
	ЗаполнитьВМакетеИННСотрудника(Макет, Заявление);
	
	Если ПредоставленоЗаявлениеОЗаменеКалендарныхГодов(Заявление) Тогда 
		ЗаполнитьВМакетеДанныеОЗаменеКалендарныхГодов(Макет, Заявление);
	КонецЕсли;
	
	Если Заявление.НеполноеРабочееВремя Тогда
		Макет.Параметры.НеполноеРабочееВремя = Истина;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ДоляВремени, "ЧЦ=3; ЧДЦ=0; ЧС=-2; ЧН=' '; ЧВН="), Макет, "Ставка_", 3);
	КонецЕсли;
	
	ЗарплатаКадры.ВывестиСуммуВРубляхКопейкахВЯчейки(Заявление.ТарифнаяСтавкаОклад, Макет, "ТарифнаяСтавкаОклад_", 9);
	
	Если ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(Заявление.ВидПособия) Тогда
		ЗарплатаКадры.ВывестиСуммуВРубляхКопейкахВЯчейки(Заявление.СреднийЗаработок, Макет, "СреднийЗаработок_", 10);
	КонецЕсли;
	
	ЗаполнитьВМакетеДанныеОПериодеПростоя(Макет, Заявление, 8);
	
	ЗаполнитьВМакетеПериодЗаКоторыйПособиеНеНазначается(Макет, Заявление);
	
	ЗаполнитьВМакетеДанныеРуководителяОрганизации(Макет, Заявление);
	
	ЗаполнитьВМакетеТелефонСоставителя(Макет, Заявление);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеЗаявленияВМакете_2017(Макет, Заявление)
	
	ЗаполнитьВМакетеНаименованиеФСС(Макет, Заявление);
	
	ЗаполнитьВМакетеФИОЗаявителя(Макет, Заявление);
	
	ЗаполнитьВМакетеВидПособия_2017(Макет, Заявление);
	
	Если ПособиеВыплачиваетсяЧерезБанк(Заявление) Тогда
		ЗаполнитьВМакетеВыплатуЧерезБанк(Макет, Заявление);
	Иначе
		ЗаполнитьВМакетеВыплатуЧерезПочту_2017(Макет, Заявление);
	КонецЕсли;
	
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерКартыМИР, Макет, "НомерКартыМИР_", 19);
	
	ЗаполнитьВМакетеФИОПолучателя(Макет, Заявление);
	
	ЗаполнитьВМакетеДатуРожденияПолучателя(Макет, Заявление);
	
	ЗаполнитьВМакетеУдостоверениеЛичности_2017(Макет, Заявление);
	
	ЗаполнитьВМакетеРазрешениеНаПроживание(Макет, Заявление);
	
	ЗаполнитьВМакетеСведенияОМестеЖительства_2017(Макет, Заявление);
	
	ЗаполнитьВМакетеТелефонПолучателя(Макет, Заявление);
	
	Если ЭтоПособиеПоВременнойНетрудоспособности(Заявление.ВидПособия)
		Или ЭтоПособиеПоНесчастномуСлучаю(Заявление.ВидПособия)
		Или ЭтоПособиеПоБеременностиИРодам(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеРеквизитыЛН(Макет, Заявление);
	КонецЕсли;
	
	Если ЭтоПособиеВставшимНаУчетВРанниеСроки(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеРеквизитыСправкиОПостановкеНаУчетВРанниеСрокиБеременности(Макет, Заявление);
	КонецЕсли;
	
	Если ЭтоЕдиновременноеПособиеПриРожденииРебенка(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеОбластьЕдиновременногоПособияПриРожденииРебенка_2017(Макет, Заявление);
	КонецЕсли;
	
	Если ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(Заявление.ВидПособия) Тогда
		ЗаполнитьВМакетеОбластьЕжемесячноеПособиеПоУходуЗаРебенком_2017(Макет, Заявление);
	КонецЕсли;
	
	ЗаполнитьВМакетеДатуПодачиЗаявления(Макет, Заявление);
	
	ЗаполнитьВМакетеНаименованиеРаботодателя(Макет, Заявление, 40);
	
	ЗаполнитьВМакетеВидЗанятостиСотрудника(Макет, Заявление);
	
	ЗаполнитьВМакетеСНИЛССотрудника(Макет, Заявление);
	
	ЗаполнитьВМакетеИННСотрудника(Макет, Заявление);
	
	Если ПредоставленоЗаявлениеОЗаменеКалендарныхГодов(Заявление) Тогда
		ЗаполнитьВМакетеДанныеОЗаменеКалендарныхГодов(Макет, Заявление);
	КонецЕсли;
	
	Если Заявление.НеполноеРабочееВремя Тогда
		Макет.Параметры.НеполноеРабочееВремя = Истина;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ДоляВремени, "ЧЦ=4; ЧДЦ=0; ЧС=-3; ЧН=' '; ЧВН="), Макет, "Ставка_", 4);
	КонецЕсли;
	
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ЧислоКалендарныхДней, Макет, "ЧислоКалендарныхДней_", 3);
	
	Если ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(Заявление.ВидПособия) Тогда
		ЗарплатаКадры.ВывестиСуммуВРубляхКопейкахВЯчейки(Заявление.СреднийЗаработок, Макет, "СреднийЗаработок_", 11);
		Если ЗначениеЗаполнено(Заявление.ПервыйРасчетныйГод) Тогда
			Макет.Параметры.ПервыйГодРасчета = Заявление.ПервыйРасчетныйГод - 2000;
			ЗарплатаКадры.ВывестиСуммуВРубляхКопейкахВЯчейки(Заявление.ЗаработокПервыйГодРасчета, Макет, "ЗаработокЗаПервыйГод_", 11);
		КонецЕсли;
		Если ЗначениеЗаполнено(Заявление.ВторойРасчетныйГод) Тогда
			Макет.Параметры.ВторойГодРасчета = Заявление.ВторойРасчетныйГод - 2000;
			ЗарплатаКадры.ВывестиСуммуВРубляхКопейкахВЯчейки(Заявление.ЗаработокВторойГодРасчета, Макет, "ЗаработокЗаВторойГод_", 11);
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьВМакетеДанныеОПериодеПростоя(Макет, Заявление, 11);
	
	ЗаполнитьВМакетеПериодЗаКоторыйПособиеНеНазначается(Макет, Заявление);
	
	ЗаполнитьВМакетеДанныеРуководителяОрганизации(Макет, Заявление);
	
	ЗаполнитьВМакетеТелефонСоставителя(Макет, Заявление);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеНаименованиеФСС(Макет, Заявление)
	
	ДлиныСтрок = Новый Массив();
	ДлиныСтрок.Добавить(27);
	НаименованиеТерриториальногоОрганаФСС = ЗарплатаКадры.РазбитьСтрокуНаПодСтроки(Заявление.НаименованиеТерриториальногоОрганаФСС, ДлиныСтрок);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(НаименованиеТерриториальногоОрганаФСС, Макет, "Наименование_ФСС_", 135);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеФИОЗаявителя(Макет, Заявление)
	
	ФамилияЗаявителя = Заявление.ФамилияЗаявителя;
	ИмяЗаявителя = Заявление.ИмяЗаявителя;
	ОтчествоЗаявителя = Заявление.ОтчествоЗаявителя;	
	
	КоличествоСловФамилии = 0;
	КоличествоСловИмени = 0;
		
	Если ЗначениеЗаполнено(Заявление.ФамилияЗаявителя) Тогда
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Заявление.ФамилияЗаявителя), " ");
		КоличествоСловФамилии = МассивПодстрок.Количество();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Заявление.ИмяЗаявителя) Тогда
		МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СокрЛП(Заявление.ИмяЗаявителя), " ");
		КоличествоСловИмени = МассивПодстрок.Количество();
	КонецЕсли;
		
	ФИО = Заявление.ФамилияЗаявителя + " " + Заявление.ИмяЗаявителя + " " + Заявление.ОтчествоЗаявителя;
	ФИОВРодительномПадеже = "";
	ФизическиеЛицаЗарплатаКадры.Просклонять(ФИО, 2, ФИОВРодительномПадеже);
	
	Если ЗначениеЗаполнено(ФИОВРодительномПадеже) Тогда

		Если КоличествоСловФамилии = 1 
			И КоличествоСловИмени = 1 Тогда    		
			
			МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ФИОВРодительномПадеже, " ");
			ФамилияЗаявителя = МассивПодстрок[0];
			ИмяЗаявителя = МассивПодстрок[1];
			ОтчествоЗаявителя = "";
			Для Индекс = 2 По МассивПодстрок.Количество() - 1 Цикл
				ОтчествоЗаявителя = ОтчествоЗаявителя + ?(ЗначениеЗаполнено(ОтчествоЗаявителя), " ", "") + МассивПодстрок[Индекс];
			КонецЦикла;
			
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ФамилияЗаявителя, 	Макет, "ФИО_Заявителя_", 27);
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ИмяЗаявителя, 		Макет, "ФИО_Заявителя_", 27, 28);
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ОтчествоЗаявителя, 	Макет, "ФИО_Заявителя_", 27, 55);
			
		Иначе
			
			ДлиныСтрок = Новый Массив();
			ДлиныСтрок.Добавить(27);
			ФИОВФорматеЗаявления = ЗарплатаКадры.РазбитьСтрокуНаПодСтроки(ФИОВРодительномПадеже, ДлиныСтрок);
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ФИОВФорматеЗаявления, Макет, "ФИО_Заявителя_", 81);
					
		КонецЕсли;

	Иначе
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ФамилияЗаявителя, 	Макет, "ФИО_Заявителя_", 27);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ИмяЗаявителя, 		Макет, "ФИО_Заявителя_", 27, 28);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ОтчествоЗаявителя, 	Макет, "ФИО_Заявителя_", 27, 55);
		   		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеВидПособия_2012(Макет, Заявление)
	
	Если ЭтоПособиеПоВременнойНетрудоспособности(Заявление.ВидПособия) Тогда
		Макет.Области["Нетрудоспособность"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоПособиеПоБеременностиИРодам(Заявление.ВидПособия) Тогда
		Макет.Области["БеременностьРоды"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоПособиеВставшимНаУчетВРанниеСроки(Заявление.ВидПособия) Тогда
		Макет.Области["ПриПостановкеНаУчетВРанниеСрокиБеременности"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоЕдиновременноеПособиеПриРожденииРебенка(Заявление.ВидПособия) Тогда
		Макет.Области["ПриРожденииРебенка"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(Заявление.ВидПособия) Тогда
		Макет.Области["ПоУходуЗаРебенкомДоПолутораЛет"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоПособиеПоНесчастномуСлучаю(Заявление.ВидПособия) Тогда
		Макет.Параметры.НетрудоспособностьНесчастныйСлучай = Истина;
	КонецЕсли;
	
	Если ЭтоОтпускСверхЕжегодногоНаПериодЛечения(Заявление.ВидПособия) Тогда
		Макет.Области["ДополнительныйОтпускПослеНесчастныхСлучаев"].Текст = "v";
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеВидПособия_2017(Макет, Заявление)
	
	Если Заявление.Перерасчет Тогда
		Макет.Области["Перерасчет"].Текст = "v";
	Иначе
		Макет.Области["Назначение"].Текст = "v";
	КонецЕсли;
	
	Макет.Параметры.ЭтоЭЛН = Заявление.ЭтоЭЛН;
	
	Если ЭтоПособиеПоВременнойНетрудоспособности(Заявление.ВидПособия) Тогда
		Макет.Области["Нетрудоспособность"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоПособиеПоБеременностиИРодам(Заявление.ВидПособия) Тогда
		Макет.Области["БеременностьРоды"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоПособиеВставшимНаУчетВРанниеСроки(Заявление.ВидПособия) Тогда
		Макет.Области["ПриПостановкеНаУчетВРанниеСрокиБеременности"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоЕдиновременноеПособиеПриРожденииРебенка(Заявление.ВидПособия) Тогда
		Макет.Области["ПриРожденииРебенка"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(Заявление.ВидПособия) Тогда
		Макет.Области["ПоУходуЗаРебенкомДоПолутораЛет"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоПособиеПоНесчастномуСлучаю(Заявление.ВидПособия) Тогда
		Макет.Области["НетрудоспособностьНесчастныйСлучай"].Текст = "v";
	КонецЕсли;
	
	Если ЭтоОтпускСверхЕжегодногоНаПериодЛечения(Заявление.ВидПособия) Тогда
		Макет.Области["ДополнительныйОтпускПослеНесчастныхСлучаев"].Текст = "v";
	КонецЕсли;
	
КонецПроцедуры

#Область СпособВыплатыПособия

Функция ПособиеВыплачиваетсяЧерезБанк(Заявление)
	Возврат Заявление.СпособВыплатыПособия = Перечисления.СпособыВыплатыПособия.ЧерезБанк;	
КонецФункции

Процедура ЗаполнитьВМакетеВыплатуЧерезБанк(Макет, Заявление)
	
	Макет.Области["ВыплатаЧерезБанк"].Текст = "v";	
	
	ДлиныСтрок = Новый Массив();
	ДлиныСтрок.Добавить(39);
	НаименованиеБанка = ЗарплатаКадры.РазбитьСтрокуНаПодСтроки(Заявление.НаименованиеБанка, ДлиныСтрок);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(НаименованиеБанка, Макет, "НаименованиеБанка_", 78);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерЛицевогоСчета, Макет, "НомерСчета_", 20);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.БИКБанка, Макет, "БИК_", 9);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеВыплатуЧерезПочту_2012(Макет, Заявление)
	
	Макет.Области["ВыплатаПочтой"].Текст = "v";
	
	СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(Заявление.АдресПроживания, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица"));	
	Если СтруктураАдреса <> Неопределено Тогда
		Город           = ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Город");
		НаселенныйПункт = ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "НаселенныйПункт");
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Индекс"), Макет, "Адрес_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Регион"), Макет, "Адрес_", 17, 7);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Район"), Макет, "Адрес_", 17, 24);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(
			?(ЗначениеЗаполнено(Город), Город + " " + НаселенныйПункт, НаселенныйПункт),
			Макет,
			"Адрес_", 34, 41);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Улица"), Макет, "Адрес_", 37, 75);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Дом"), Макет, "Адрес_", 8, 112);
		Если ВРег(СтруктураАдреса.ТипКорпуса) = "СТРОЕНИЕ" Тогда
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "Адрес_", 3, 123);
		Иначе
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "Адрес_", 3, 120);
		КонецЕсли;;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Квартира"), Макет, "Адрес_", 6, 126);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьВМакетеВыплатуЧерезПочту_2017(Макет, Заявление)
	
	Макет.Области["ВыплатаПочтой"].Текст = "v";
	
	СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(Заявление.АдресПроживания, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица"));	
	Если СтруктураАдреса <> Неопределено Тогда
		Город           = ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Город");
		НаселенныйПункт = ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "НаселенныйПункт");
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Индекс"), Макет, "Адрес_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Регион"), Макет, "Адрес_", 37, 7);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Район"), Макет, "Адрес_", 37, 44);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(
			?(ЗначениеЗаполнено(Город), Город + " " + НаселенныйПункт, НаселенныйПункт),
			Макет,
			"Адрес_", 34, 81);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Улица"), Макет, "Адрес_", 37, 115);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Дом"), Макет, "Адрес_", 8, 152);
		Если ВРег(СтруктураАдреса.ТипКорпуса) = "СТРОЕНИЕ" Тогда
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "Адрес_", 3, 163);
		Иначе
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "Адрес_", 3, 160);
		КонецЕсли;;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Квартира"), Макет, "Адрес_", 5, 166);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ПолучательПособия

Процедура ЗаполнитьВМакетеФИОПолучателя(Макет, Заявление)
	
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ФамилияПолучателя, Макет, "ФИО_Получателя_", 36);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ИмяПолучателя, Макет, "ФИО_Получателя_", 36, 37);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ОтчествоПолучателя, Макет, "ФИО_Получателя_", 36, 73);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеДатуРожденияПолучателя(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаРождения, "ДЛФ=D"),".",""), Макет, "ДатаРождения_", 8);
КонецПроцедуры

#КонецОбласти

#Область УдостоверениеЛичности

Процедура ЗаполнитьВМакетеУдостоверениеЛичности_2012(Макет, Заявление)
	
	ДокументСерия = Заявление.УдостоверениеЛичностиСерия;
	ДокументСерия = СтрЗаменить(ДокументСерия, " ", "");
	
	Если ЭтоПаспорт(Заявление.КодУдостоверенияЛичности) Тогда
		
		Макет.Области["Паспорт"].Текст = "v ";
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ПаспортСерия_", 4);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.УдостоверениеЛичностиНомер, Макет, "ПаспортНомер_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.УдостоверениеЛичностиДата, "ДЛФ=D"),".",""), Макет, "ПаспортДата_", 8);
		
		ДлиныСтрок = Новый Массив();
		ДлиныСтрок.Добавить(36);
		ДлиныСтрок.Добавить(39); 
		УдостоверениеЛичностиКемВыдан = ЗарплатаКадры.РазбитьСтрокуНаПодСтроки(Заявление.УдостоверениеЛичностиКемВыдан, ДлиныСтрок);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(УдостоверениеЛичностиКемВыдан, Макет, "ПаспортКемВыдан_", 75);
		
	ИначеЕсли ЭтоВременноеУдостоверениеЛичности(Заявление.КодУдостоверенияЛичности) Тогда
		
		Макет.Области["ВременноеУдостоверение"].Текст = "v ";
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.УдостоверениеЛичностиНомер, Макет, "ВременноеУдостоверениеНомер_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.УдостоверениеЛичностиСрокДействия, "ДФ=dd.MM.yy"),".",""), Макет, "ВременноеУдостоверениеДата_", 6);
		
	ИначеЕсли ЗначениеЗаполнено(Заявление.КодУдостоверенияЛичности) Тогда
		
		Макет.Области["ИнойДокумент"].Текст = "v ";
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ИнойДокументСерия_", 2);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.УдостоверениеЛичностиНомер, Макет, "ИнойДокументНомер_", 8);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.УдостоверениеЛичностиСрокДействия, "ДФ=dd.MM.yy"),".",""), Макет, "ИнойДокументДата_", 6);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеУдостоверениеЛичности_2017(Макет, Заявление)
	
	ДокументСерия = Заявление.УдостоверениеЛичностиСерия;
	ДокументСерия = СтрЗаменить(ДокументСерия, " ", "");
	
	Если ЭтоПаспорт(Заявление.КодУдостоверенияЛичности) Тогда
		
		Макет.Области["Паспорт"].Текст = "v ";
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ПаспортСерия_", 4);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.УдостоверениеЛичностиНомер, Макет, "ПаспортНомер_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.УдостоверениеЛичностиДата, "ДЛФ=D"),".",""), Макет, "ПаспортДата_", 8);
		
		ДлиныСтрок = Новый Массив();
		ДлиныСтрок.Добавить(36);
		ДлиныСтрок.Добавить(39); 
		УдостоверениеЛичностиКемВыдан = ЗарплатаКадры.РазбитьСтрокуНаПодСтроки(Заявление.УдостоверениеЛичностиКемВыдан, ДлиныСтрок);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(УдостоверениеЛичностиКемВыдан, Макет, "ПаспортКемВыдан_", 75);
		
	ИначеЕсли ЭтоВременноеУдостоверениеЛичности(Заявление.КодУдостоверенияЛичности) Тогда
		
		Макет.Области["ВременноеУдостоверение"].Текст = "v ";
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.УдостоверениеЛичностиНомер, Макет, "ВременноеУдостоверениеНомер_", 8);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.УдостоверениеЛичностиСрокДействия, "ДФ=dd.MM.yy"),".",""), Макет, "ВременноеУдостоверениеДата_", 6);
		
	ИначеЕсли ЗначениеЗаполнено(Заявление.КодУдостоверенияЛичности) Тогда
		
		Макет.Области["ИнойДокумент"].Текст = "v ";
		
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ИнойДокументСерия_", 2);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.УдостоверениеЛичностиНомер, Макет, "ИнойДокументНомер_", 8);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.УдостоверениеЛичностиСрокДействия, "ДФ=dd.MM.yy"),".",""), Макет, "ИнойДокументДата_", 6);
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ЭтоПаспорт(КодУдостоверенияЛичности)
	
	Возврат КодУдостоверенияЛичности = "01"
		ИЛИ КодУдостоверенияЛичности = "02"
		ИЛИ КодУдостоверенияЛичности = "06"
		ИЛИ КодУдостоверенияЛичности = "09"
		ИЛИ КодУдостоверенияЛичности = "10"
		ИЛИ КодУдостоверенияЛичности = "21"
		ИЛИ КодУдостоверенияЛичности = "22"
		ИЛИ КодУдостоверенияЛичности = "26";
	
КонецФункции 

Функция ЭтоВременноеУдостоверениеЛичности(КодУдостоверенияЛичности)
	
	Возврат КодУдостоверенияЛичности = "14";
	
КонецФункции 

#КонецОбласти

#Область РазрешениеНаПроживание

Процедура ЗаполнитьВМакетеРазрешениеНаПроживание(Макет, Заявление)
	
	ДокументСерия = Заявление.СерияДокументаНаПроживание;
	ДокументСерия = СтрЗаменить(ДокументСерия, " ", "");
	
	Если ЭтоРазрешениеНаВременноеПроживание(Заявление.КодДокументаНаПроживание) Тогда
		Макет.Области["ИнойДокумент2"].Текст = "v ";
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "РазрешениеСерия_", 2);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерДокументаНаПроживание, Макет, "РазрешениеНомер_", 8);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаВыдачиДокументаНаПроживание, "ДЛФ=D"),".",""), Макет, "РазрешениеДата_", 8);
	ИначеЕсли ЭтоВидНаЖительство(Заявление.КодДокументаНаПроживание) Тогда
		Макет.Области["ИнойДокумент1"].Текст = "v ";
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ДокументСерия, Макет, "ВидНаЖительствоСерия_", 2);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерДокументаНаПроживание, Макет, "ВидНаЖительствоНомер_", 8);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаВыдачиДокументаНаПроживание, "ДЛФ=D"),".",""), Макет, "ВидНаЖительствоДата_", 8);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоРазрешениеНаВременноеПроживание(КодДокументаНаПроживание)
	
	Возврат КодДокументаНаПроживание = "15";
	
КонецФункции 

Функция ЭтоВидНаЖительство(КодДокументаНаПроживание)
	
	Возврат КодДокументаНаПроживание = "12";
	
КонецФункции 

#КонецОбласти

Процедура ЗаполнитьВМакетеСведенияОМестеЖительства_2012(Макет, Заявление)
	
	СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(Заявление.АдресРегистрации, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица"));	
	Если СтруктураАдреса <> Неопределено Тогда
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Индекс"), Макет, "АдресРегистрации_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Регион"), Макет, "АдресРегистрации_", 17, 7);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Район"), Макет, "АдресРегистрации_", 17, 24);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(
			?(ЗначениеЗаполнено(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Город")),
				ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Город") + " " + ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "НаселенныйПункт"),
				ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "НаселенныйПункт")),
			Макет,
			"АдресРегистрации_", 34, 41);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Улица"), Макет, "АдресРегистрации_", 37, 75);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Дом"), Макет, "АдресРегистрации_", 8, 112);
		Если ВРег(СтруктураАдреса.ТипКорпуса) = "СТРОЕНИЕ" Тогда
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "АдресРегистрации_", 3, 123);
		Иначе
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "АдресРегистрации_", 3, 120);
		КонецЕсли;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Квартира"), Макет, "АдресРегистрации_", 6, 126);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеСведенияОМестеЖительства_2017(Макет, Заявление)
	
	СтруктураАдреса = ЗарплатаКадры.СтруктураАдресаИзXML(Заявление.АдресРегистрации, ПредопределенноеЗначение("Справочник.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица"));	
	Если СтруктураАдреса <> Неопределено Тогда
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Индекс"), Макет, "АдресРегистрации_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Регион"), Макет, "АдресРегистрации_", 37, 7);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Район"), Макет, "АдресРегистрации_", 37, 44);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(
			?(ЗначениеЗаполнено(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Город")),
				ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Город") + " " + ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "НаселенныйПункт"),
				ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "НаселенныйПункт")),
			Макет,
			"АдресРегистрации_", 34, 81);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Улица"), Макет, "АдресРегистрации_", 37, 115);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Дом"), Макет, "АдресРегистрации_", 8, 152);
		Если ВРег(СтруктураАдреса.ТипКорпуса) = "СТРОЕНИЕ" Тогда
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "АдресРегистрации_", 3, 163);
		Иначе
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Корпус"), Макет, "АдресРегистрации_", 3, 160);
		КонецЕсли;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(ПолеАдресаВВерхнемРегистре(СтруктураАдреса, "Квартира"), Макет, "АдресРегистрации_", 5, 166);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеТелефонПолучателя(Макет, Заявление)
	
	Если ПустаяСтрока(Заявление.Телефон) Тогда
		Возврат;	
	КонецЕсли;
	
	ПредставлениеТелефона = ПредставлениеТелефонаБезКодаСтраны(Заявление.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонДомашнийФизическиеЛица);
	
	ЗаполнитьВМакетеТелефон(Макет, ПредставлениеТелефона, "Тел_");
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеРеквизитыЛН(Макет, Заявление)
	
	Если ЭтоПособиеПоБеременностиИРодам(Заявление.ВидПособия) Тогда
		ПрефиксОбласти = "БеременностьРоды";
	Иначе
		ПрефиксОбласти = "Нетрудоспособность";
	КонецЕсли;
	
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаВыдачиБольничного, "ДФ=dd.MM.yy"),".",""),  Макет, ПрефиксОбласти + "ЛН_Дата_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерБольничного, Макет, ПрефиксОбласти + "ЛН_Номер_", 12);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеРеквизитыСправкиОПостановкеНаУчетВРанниеСрокиБеременности(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСправкиБеременной, "ДФ=dd.MM.yy"),".",""),  Макет, "СправкаПоБеременностиДата_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСправкиБеременной, Макет, "СправкаПоБеременностиНомер_", 11);
КонецПроцедуры

#Область ЕдиновременноеПособиеПриРожденииРебенка

Процедура ЗаполнитьВМакетеОбластьЕдиновременногоПособияПриРожденииРебенка_2012(Макет, Заявление)
	
	Если ДолжнаБытьСправкаОРождении(Заявление) Тогда
		// Реквизиты справки о рождении.
		Если Заявление.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма24 Тогда
			Макет.Параметры.Форма24 = Истина;
		ИначеЕсли Заявление.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма25 Тогда
			Макет.Параметры.Форма25 = Истина;
		ИначеЕсли Заявление.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма26 Тогда
			Макет.Параметры.Форма26 = Истина;
		КонецЕсли;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСправкиОРождении, "ДФ=dd.MM.yy"),".",""),  Макет, "СправкаДата_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСправкиОРождении, Макет, "СправкаНомер_", 10);
	Иначе
		ЗаполнитьВМакетеРеквизитыСвидетельстваОРождении(Макет, Заявление, "СвидетельствоОРождении", 4, 9);
		ЗаполнитьВМакетеРеквизитыИногоПодтвержденияРождения(Макет, Заявление, "ИноеПодтверждениеРождения", 12);
	КонецЕсли;
	
	Если ПредоставленаСправкаОНеполученииПособияОтОтца(Заявление) Тогда
		ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПособияОтДругогоРодителя(Макет, Заявление.НомерСправкиОтОтца, Заявление.ДатаСправкиОтОтца);
	Иначе
		ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПособияОтДругогоРодителя(Макет, Заявление.НомерСправкиОтМатери, Заявление.ДатаСправкиОтМатери);
	КонецЕсли;
	
	ЗаполнитьВМакетеРеквизитыРешенияОбОпеке(Макет, Заявление, "РешениеОбОпеке", 12);
	
	// Реквизиты решения об усыновлении.
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаРешенияОбУсыновлении, "ДЛФ=D"),".",""), Макет, "РешениеОбУсыновленииДата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерРешенияОбУсыновлении, Макет, "РешениеОбУсыновленииНомер_", 9);
	
	// Реквизиты договора о передаче на воспитание.
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаДоговораОПередачеНаВоспитание, "ДЛФ=D"),".",""),  Макет, "ДоговорОВоспитанииДата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерДоговораОПередачеНаВоспитание, Макет, "ДоговорОВоспитанииНомер_", 9);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеОбластьЕдиновременногоПособияПриРожденииРебенка_2017(Макет, Заявление)
	
	Если ДолжнаБытьСправкаОРождении(Заявление) Тогда
		// Реквизиты справки о рождении.
		Если Заявление.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма24 Тогда
			Макет.Параметры.Форма24 = Истина;
		ИначеЕсли Заявление.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма25 Тогда
			Макет.Параметры.Форма25 = Истина;
		ИначеЕсли Заявление.ВидСправкиОРожденииРебенка = Перечисления.ФормыСправкиОРожденииРебенка.Форма26 Тогда
			Макет.Параметры.Форма26 = Истина;
		КонецЕсли;
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСправкиОРождении, "ДФ=dd.MM.yy"),".",""),  Макет, "СправкаДата_", 6);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСправкиОРождении, Макет, "СправкаНомер_", 11);
	Иначе
		ЗаполнитьВМакетеРеквизитыСвидетельстваОРождении(Макет, Заявление, "СвидетельствоОРождении", 6, 11);
		ЗаполнитьВМакетеРеквизитыИногоПодтвержденияРождения(Макет, Заявление, "ИноеПодтверждениеРождения", 12);
	КонецЕсли;
	
	Если ПредоставленаСправкаОНеполученииПособияОтОтца(Заявление) Тогда
		ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПособияОтДругогоРодителя(Макет, Заявление.НомерСправкиОтОтца, Заявление.ДатаСправкиОтОтца);
	Иначе
		ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПособияОтДругогоРодителя(Макет, Заявление.НомерСправкиОтМатери, Заявление.ДатаСправкиОтМатери);
	КонецЕсли;
	
	ЗаполнитьВМакетеРеквизитыРешенияОбОпеке(Макет, Заявление, "РешениеОбОпеке", 12);
	
	// Реквизиты решения об усыновлении.
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаРешенияОбУсыновлении, "ДЛФ=D"),".",""), Макет, "РешениеОбУсыновленииДата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерРешенияОбУсыновлении, Макет, "РешениеОбУсыновленииНомер_", 12);
	
	// Реквизиты договора о передаче на воспитание.
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаДоговораОПередачеНаВоспитание, "ДЛФ=D"),".",""),  Макет, "ДоговорОВоспитанииДата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерДоговораОПередачеНаВоспитание, Макет, "ДоговорОВоспитанииНомер_", 12);
	
КонецПроцедуры

Функция ДолжнаБытьСправкаОРождении(Заявление)
	Возврат Не ЗначениеЗаполнено(Заявление.ДатаСвидетельстваОРождении) 
			И Не ЗначениеЗаполнено(Заявление.ДатаИногоПодтвержденияРождения);
КонецФункции 

Процедура ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПособияОтДругогоРодителя(Макет, НомерСправки, ДатаСправки)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(ДатаСправки, "ДФ=dd.MM.yy"),".",""),  Макет, "СправкаОтДругогоРодителяДата_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(НомерСправки, Макет, "СправкаОтДругогоРодителяНомер_", 12);
КонецПроцедуры

#КонецОбласти

#Область ЕжемесячноеПособиеПоУходуЗаРебенком

Процедура ЗаполнитьВМакетеОбластьЕжемесячноеПособиеПоУходуЗаРебенком_2012(Макет, Заявление)
	
	ЗаполнитьВМакетеРеквизитыСвидетельстваОРождении(Макет, Заявление, "СвидетельствоОРожденииII", 4, 9);
	
	ЗаполнитьВМакетеРеквизитыРешенияОбОпеке(Макет, Заявление, "РешениеОбОпекеII", 11);
	
	ЗаполнитьВМакетеРеквизитыИногоПодтвержденияРождения(Макет, Заявление, "ИноеПодтверждениеРожденияII", 11);
	
	ЗаполнитьВМакетеРеквизитыПриказаНаОтпускПоУходуЗаРебенком(Макет, Заявление);
	
	ЗаполнитьВМакетеДокументаОРожденииДругогоРебенка(Макет, Заявление);
	
	Если ПредоставленаСправкаОНеполученииПособияОтОбоихРодителей(Заявление) Тогда
		Макет.Параметры.СправкаОтОбоихРодителейОНеполученииПособия = Истина;
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтОтца(Макет, Заявление);
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтМатери(Макет, Заявление);
	ИначеЕсли ПредоставленаСправкаОНеполученииПособияОтОтца(Заявление) Тогда
		Макет.Параметры.СправкаОтОтцаОНеполученииПособия = Истина;
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтОтца(Макет, Заявление);
	ИначеЕсли ПредоставленаСправкаОНеполученииПособияОтМатери(Заявление) Тогда
		Макет.Параметры.СправкаОтМатериОНеполученииПособия = Истина;
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтМатери(Макет, Заявление);
	КонецЕсли;
	
	ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПоДругимМестамРаботы(Макет, Заявление);
	
	ЗаполнитьВМакетеДанныеОПроживанииРаботеВОсобойЗоне(Макет, Заявление);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеОбластьЕжемесячноеПособиеПоУходуЗаРебенком_2017(Макет, Заявление)
	
	ЗаполнитьВМакетеРеквизитыСвидетельстваОРождении(Макет, Заявление, "СвидетельствоОРожденииII", 7, 11);
	
	ЗаполнитьВМакетеРеквизитыРешенияОбОпеке(Макет, Заявление, "РешениеОбОпекеII", 12);
	
	ЗаполнитьВМакетеРеквизитыИногоПодтвержденияРождения(Макет, Заявление, "ИноеПодтверждениеРожденияII", 12);
	
	ЗаполнитьВМакетеРеквизитыПриказаНаОтпускПоУходуЗаРебенком(Макет, Заявление);
	
	ЗаполнитьВМакетеДокументаОРожденииДругогоРебенка(Макет, Заявление);
	
	Если ПредоставленаСправкаОНеполученииПособияОтОбоихРодителей(Заявление) Тогда
		Макет.Параметры.СправкаОтОтцаОНеполученииПособия = Истина;
		Макет.Параметры.СправкаОтМатериОНеполученииПособия = Истина;
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтОтца(Макет, Заявление);
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтМатери(Макет, Заявление);
	ИначеЕсли ПредоставленаСправкаОНеполученииПособияОтОтца(Заявление) Тогда
		Макет.Параметры.СправкаОтОтцаОНеполученииПособия = Истина;
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтОтца(Макет, Заявление);
	ИначеЕсли ПредоставленаСправкаОНеполученииПособияОтМатери(Заявление) Тогда
		Макет.Параметры.СправкаОтМатериОНеполученииПособия = Истина;
		ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтМатери(Макет, Заявление);
	КонецЕсли;
	
	ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПоДругимМестамРаботы(Макет, Заявление);
	
	ЗаполнитьВМакетеДанныеОПроживанииРаботеВОсобойЗоне(Макет, Заявление);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеРеквизитыПриказаНаОтпускПоУходуЗаРебенком(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаПриказаНаОтпускПоУходуЗаРебенком, "ДФ=dd.MM.yy"),".",""),  Макет, "ДатаПриказаНаОтпускПоУходуЗаРебенком_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ОтпускПоУходуЗаРебенкомДатаНачало, "ДФ=dd.MM.yy"),".",""),  Макет, "ОтпускПоУходуЗаРебенкомДатаНачало_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ОтпускПоУходуЗаРебенкомДатаОкончание, "ДФ=dd.MM.yy"),".",""),  Макет, "ОтпускПоУходуЗаРебенкомДатаОкончание_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Прав(Заявление.НомерПриказаНаОтпускПоУходуЗаРебенком,10), Макет, "НомерПриказаНаОтпускПоУходуЗаРебенком_", 10);
КонецПроцедуры

Процедура ЗаполнитьВМакетеДокументаОРожденииДругогоРебенка(Макет, Заявление)
	Макет.Параметры.НаличиеДокументаОРожденииПредыдущегоРебенка = Заявление.НаличиеДокументаОРожденииПредыдущегоРебенка;
	Макет.Параметры.НаличиеДокументаОСмертиПредыдущегоРебенка = Заявление.НаличиеДокументаОСмертиПредыдущегоРебенка;
КонецПроцедуры

#КонецОбласти

#Область СправкиОНеполученииПособия

Процедура ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтОтца(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСправкиОтОтца, "ДФ=dd.MM.yy"),".",""),  Макет, "ДатаСправкиОтОтца_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСправкиОтОтца,  Макет, "НомерСправкиОтОтца_", 11);
КонецПроцедуры

Процедура ЗаполнитьВМакетеДатуНомерСправкиОНеполученииПособияОтМатери(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСправкиОтМатери, "ДФ=dd.MM.yy"),".",""),  Макет, "ДатаСправкиОтМатери_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСправкиОтМатери,  Макет, "НомерСправкиОтМатери_", 11);
КонецПроцедуры

Процедура ЗаполнитьВМакетеРеквизитыСправкиОНеполученииПоДругимМестамРаботы(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСправкиПоДругимМестамРаботы, "ДФ=dd.MM.yy"),".",""),  Макет, "ДатаСправкиПоДругимМестамРаботы_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСправкиПоДругимМестамРаботы,  Макет, "НомерСправкиПоДругимМестамРаботы_", 11);
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьВМакетеДанныеОПроживанииРаботеВОсобойЗоне(Макет, Заявление)
	Макет.Параметры.ПроживаниеВЗоне = Заявление.ПроживаниеВЗоне;
	Макет.Параметры.РаботаВЗоне = Заявление.РаботаВЗоне;
	Макет.Параметры.ВЗонеСПравомНаОтселение = Заявление.ВЗонеСПравомНаОтселение;
	Макет.Параметры.ВЗонеОтселения = Заявление.ВЗонеОтселения;
	Макет.Параметры.ВЗонеСЛьготнымСтатусом = Заявление.ВЗонеСЛьготнымСтатусом;
КонецПроцедуры

#Область ПособияНаДетей

Процедура ЗаполнитьВМакетеРеквизитыСвидетельстваОРождении(Макет, Заявление, ПрефиксОбласти, ДлинаСерии, ДлинаНомера)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаСвидетельстваОРождении, "ДЛФ=D"),".",""), Макет, ПрефиксОбласти + "Дата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.СерияСвидетельстваОРождении, Макет, ПрефиксОбласти + "Серия_", ДлинаСерии);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерСвидетельстваОРождении, Макет, ПрефиксОбласти + "Номер_", ДлинаНомера);
КонецПроцедуры

Процедура ЗаполнитьВМакетеРеквизитыРешенияОбОпеке(Макет, Заявление, ПрефиксОбласти, ДлинаНомераРешенияОбОпеке)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаРешенияОбОпеке, "ДЛФ=D"),".",""),  Макет, ПрефиксОбласти + "Дата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерРешенияОбОпеке, Макет, ПрефиксОбласти + "Номер_", ДлинаНомераРешенияОбОпеке);
КонецПроцедуры

Процедура ЗаполнитьВМакетеРеквизитыИногоПодтвержденияРождения(Макет, Заявление, ПрефиксОбласти, ДлинаНомераИногоДокумента)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаИногоПодтвержденияРождения, "ДЛФ=D"),".",""),  Макет, ПрефиксОбласти + "Дата_", 8);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.НомерИногоПодтвержденияРождения, Макет, ПрефиксОбласти + "Номер_", ДлинаНомераИногоДокумента);
КонецПроцедуры

Функция ПредоставленаСправкаОНеполученииПособияОтОтца(Заявление)
	Возврат Заявление.СправкаОНеполученииПособия = Перечисления.РодителиПредоставившиеСправкуОНеполученииПособия.Отец;
КонецФункции

Функция ПредоставленаСправкаОНеполученииПособияОтМатери(Заявление)
	Возврат Заявление.СправкаОНеполученииПособия = Перечисления.РодителиПредоставившиеСправкуОНеполученииПособия.Мать;
КонецФункции

Функция ПредоставленаСправкаОНеполученииПособияОтОбоихРодителей(Заявление)
	Возврат Заявление.СправкаОНеполученииПособия = Перечисления.РодителиПредоставившиеСправкуОНеполученииПособия.ОбаРодителя;
КонецФункции

#КонецОбласти

Процедура ЗаполнитьВМакетеДатуПодачиЗаявления(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ДатаПодачиЗаявления, "ДФ=dd.MM.yy"),".",""),  Макет, "ДатаПодачи_", 6);
КонецПроцедуры

Процедура ЗаполнитьВМакетеНаименованиеРаботодателя(Макет, Заявление, ДлинаСтроки)
	ДлиныСтрок = Новый Массив();
	ДлиныСтрок.Добавить(ДлинаСтроки);
	НаименованиеРаботодателяИВидЗанятости = ЗарплатаКадры.РазбитьСтрокуНаПодСтроки("" + Заявление.НаименованиеОрганизации, ДлиныСтрок);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(НаименованиеРаботодателяИВидЗанятости, Макет, "РаботодательИВидЗанятости_", ДлинаСтроки*3);
КонецПроцедуры

Процедура ЗаполнитьВМакетеВидЗанятостиСотрудника(Макет, Заявление)
	
	Макет.Параметры.ОсновноеМестоРаботы = Заявление.ВидЗанятостиСотрудника = Перечисления.ВидыЗанятости.ОсновноеМестоРаботы;
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеСНИЛССотрудника(Макет, Заявление)
	
	СНИЛС = Заявление.СНИЛССотрудника;
	СНИЛС = СтрЗаменить(СНИЛС,"-","");
	СНИЛС = СтрЗаменить(СНИЛС," ","");
	
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СНИЛС, Макет, "СНИЛС_", 11);
	
КонецПроцедуры

Процедура ЗаполнитьВМакетеИННСотрудника(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Заявление.ИННСотрудника, Макет, "ИНННетрудоспособного_", 12);
КонецПроцедуры

#Область ЗаменаКалендарныхГодов

Функция ПредоставленоЗаявлениеОЗаменеКалендарныхГодов(Заявление)
	Возврат Заявление.ЗаявлениеРаботникаОЗаменеКалендарныхГодов;
КонецФункции

Процедура ЗаполнитьВМакетеДанныеОЗаменеКалендарныхГодов(Макет, Заявление)
	Макет.Параметры.ЗаявлениеРаботникаОЗаменеКалендарныхГодов = Истина;
	
	Если Не Заявление.ПервыйГодЗаменен И Заявление.ВторойГодЗаменен Тогда
		// Вывод 2го периода на месте 1го.
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ВторойЗамененныйГод - 2000, "ЧЦ=2; ЧВН="), Макет, "ПервыйГод_", 2);
		ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ВторойРасчетныйГод - 2000, "ЧЦ=2; ЧВН="), Макет, "ВторойГод_", 2);
	Иначе
		Если Заявление.ПервыйГодЗаменен Тогда
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ПервыйЗамененныйГод - 2000, "ЧЦ=2; ЧВН="), Макет, "ПервыйГод_", 2);
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ПервыйРасчетныйГод - 2000, "ЧЦ=2; ЧВН="), Макет, "ВторойГод_", 2);
		КонецЕсли;
		Если Заявление.ВторойГодЗаменен Тогда
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ВторойЗамененныйГод - 2000, "ЧЦ=2; ЧВН="), Макет, "ТретийГод_", 2);
			ЗарплатаКадры.ВывестиДанныеПоБуквенно(Формат(Заявление.ВторойРасчетныйГод - 2000, "ЧЦ=2; ЧВН="), Макет, "ЧетвертыйГод_", 2);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

Процедура ЗаполнитьВМакетеДанныеОПериодеПростоя(Макет, Заявление, ДлинаПоляСреднийЗаработок)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ПериодПростояДатаНачало, "ДФ=dd.MM.yy"),".",""),  Макет, "ПериодПростояДатаНачало_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ПериодПростояДатаОкончание, "ДФ=dd.MM.yy"),".",""),  Макет, "ПериодПростояДатаОкончание_", 6);
	ЗарплатаКадры.ВывестиСуммуВРубляхКопейкахВЯчейки(Заявление.СреднедневнойЗаработокНаПериодПростоя, Макет, "СреднедневнойЗаработокНаПериодПростоя_", ДлинаПоляСреднийЗаработок);
КонецПроцедуры

Процедура ЗаполнитьВМакетеПериодЗаКоторыйПособиеНеНазначается(Макет, Заявление)
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ПособияНеНазначаютсяДатаНачало, "ДФ=dd.MM.yy"),".",""),  Макет, "ПособияНеНазначаютсяДатаНачало_", 6);
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(СтрЗаменить(Формат(Заявление.ПособияНеНазначаютсяДатаОкончание, "ДФ=dd.MM.yy"),".",""),  Макет, "ПособияНеНазначаютсяДатаОкончание_", 6);
КонецПроцедуры

Процедура ЗаполнитьВМакетеДанныеРуководителяОрганизации(Макет, Заявление)
	Макет.Параметры.Подтверждаю = ЗначениеЗаполнено(Заявление.ФИОРуководителя);
	Макет.Параметры.ДолжностьРуководителя = "" + Заявление.ДолжностьРуководителя;
	Макет.Параметры.ФИОРуководителя = "" + Заявление.ФИОРуководителя;
КонецПроцедуры

Процедура ЗаполнитьВМакетеТелефонСоставителя(Макет, Заявление)
	
	Если ПустаяСтрока(Заявление.ТелефонСоставителя) Тогда
		Возврат;	
	КонецЕсли;
	
	ПредставлениеТелефона = ПредставлениеТелефонаБезКодаСтраны(Заявление.ТелефонСоставителя, Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	
	ЗаполнитьВМакетеТелефон(Макет, ПредставлениеТелефона, "ТелефонСоставителя_");
	
КонецПроцедуры

Функция ЭтоПособиеПоВременнойНетрудоспособности(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоВременнойНетрудоспособности;
КонецФункции 

Функция ЭтоПособиеПоБеременностиИРодам(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодам
		Или ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки;
КонецФункции 

Функция ЭтоПособиеВставшимНаУчетВРанниеСроки(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеВставшимНаУчетВРанниеСроки
		Или ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеПоБеременностиИРодамВставшимНаУчетВРанниеСроки;
КонецФункции 

Функция ЭтоЕдиновременноеПособиеПриРожденииРебенка(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ЕдиновременноеПособиеПриРожденииРебенка;
КонецФункции 

Функция ЭтоЕжемесячноеПособиеПоУходуЗаРебенком(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ЕжемесячноеПособиеПоУходуЗаРебенком;
КонецФункции 

Функция ЭтоПособиеПоНесчастномуСлучаю(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ПособиеВСвязиСНесчастнымСлучаемНаПроизводстве;
КонецФункции 

Функция ЭтоОтпускСверхЕжегодногоНаПериодЛечения(ВидПособия)
	Возврат ВидПособия = Перечисления.ПособияНазначаемыеФСС.ОтпускСверхЕжегодногоНаПериодЛечения;
КонецФункции 

Функция ПредставлениеТелефонаБезКодаСтраны(Телефон, ВидКонтактнойИнформации)
	СтруктураТелефона = РаботаСАдресами.ПредыдущаяСтруктураКонтактнойИнформацииXML(Телефон, ВидКонтактнойИнформации);
	Возврат УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона("", СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный,  "");	
КонецФункции

Процедура ЗаполнитьВМакетеТелефон(Макет, Телефон, ПрефиксОбласти)
	
	УдалитьНезначащиеСимволы(Телефон);
	
	ЗарплатаКадры.ВывестиДанныеПоБуквенно(Телефон, Макет, ПрефиксОбласти, 10);

КонецПроцедуры

Процедура УдалитьНезначащиеСимволы(Телефон)
	Телефон = СтрЗаменить(Телефон, "(", "");
	Телефон = СтрЗаменить(Телефон, ")", "");
	Телефон = СтрЗаменить(Телефон, " ", "");
	Телефон = СтрЗаменить(Телефон, "-", "");
	Телефон = СтрЗаменить(Телефон, ",", "");	
КонецПроцедуры

#КонецОбласти

Функция ПолеАдресаВВерхнемРегистре(Структура, ИмяСвойства)
	
	Значение = "";
	Структура.Свойство(ИмяСвойства, Значение);
	
	Возврат ВРег(Значение)
	
КонецФункции

Функция ДатаНаступленияСтраховогоСлучая(ДокументОснование) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ДокументОснование);
	
	Возврат Менеджер.ДатаНаступленияСтраховогоСлучая(ДокументОснование);
	
КонецФункции

Процедура ЗаполнитьНомерКартыМИР(ДокументОбъект) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.НомерКартыМИР) Тогда
		ПоследнийНомерКартыМИР = ПоследнийНомерКартыМИР(ДокументОбъект.Сотрудник, ДокументОбъект.Дата);
		Если ЗначениеЗаполнено(ПоследнийНомерКартыМИР) Тогда
			ДокументОбъект.НомерКартыМИР = ПоследнийНомерКартыМИР;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПоследнийНомерКартыМИР(Сотрудник, Дата)
	Если Не ЗначениеЗаполнено(Сотрудник)
		Или Не ЗначениеЗаполнено(Дата) Тогда
		Возврат "";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗаявлениеСотрудникаНаВыплатуПособия.НомерКартыМИР
	|ИЗ
	|	Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК ЗаявлениеСотрудникаНаВыплатуПособия
	|ГДЕ
	|	ЗаявлениеСотрудникаНаВыплатуПособия.Сотрудник = &Сотрудник
	|	И ЗаявлениеСотрудникаНаВыплатуПособия.Дата < &Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявлениеСотрудникаНаВыплатуПособия.Дата УБЫВ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗарплатаКадрыКлиентСервер.ЭтоНомерКарты(Выборка.НомерКартыМИР) Тогда
			Возврат Выборка.НомерКартыМИР;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

#Область МеханизмФиксацииИзменений

Функция ПараметрыФиксацииВторичныхДанных(Объект) Экспорт
	Возврат ФиксацияВторичныхДанныхВДокументах.ПараметрыФиксацииВторичныхДанных(ФиксируемыеРеквизиты(Объект), , Новый Структура);
КонецФункции

Функция ФиксируемыеРеквизиты(Объект)
	ФиксируемыеРеквизиты = Новый Соответствие;
	
	ИспользоватьФиксациюПоОснованию = ЗначениеЗаполнено(Объект.ДокументОснование);
	
	// Реквизиты документа-основания.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ОснованиеЗаполнения = "ДокументОснование";
	Шаблон.Используется        = ИспользоватьФиксациюПоОснованию;
	
	Шаблон.ИмяГруппы = "Шапка";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Организация");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Сотрудник");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВидПособия");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаПредставленияПакетаДокументов");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "КодПричиныПерерасчета");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Перерасчет");
	
	Шаблон.ИмяГруппы = "ЛистокНетрудоспособности";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаЛисткаНетрудоспособности");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерЛисткаНетрудоспособности");
	
	Шаблон.ИмяГруппы = "РасчетСреднегоЗаработка";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВторойЗамененныйГод");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВторойРасчетныйГод");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаНачалаРасчетногоПериода");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаОкончанияРасчетногоПериода");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ЗамененыКалендарныеГодыРасчетаСреднегоЗаработка");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ЗаработокВторойГодРасчета");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ЗаработокПервыйГодРасчета");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ПервыйЗамененныйГод");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ПервыйРасчетныйГод");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СреднийЗаработокЗаРасчетныйПериод");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СчитатьПоПравилам2010Года");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ЧислоКалендарныхДнейРасчетногоПериода");
	
	Шаблон.ИмяГруппы = "ОтпускПоУходуЗаРебенком";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаНачалаОтпускаПоУходуЗаРебенком");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаОкончанияОтпускаПоУходуЗаРебенком");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаПриказаОПредоставленииОтпускаПоУходуЗаРебенком");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаличиеОдногоИзДокументовНаПредыдущихДетей");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаличиеСвидетельстваОСмертиПредыдущихДетей");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерПриказаОПредоставленииОтпускаПоУходуЗаРебенком");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФинансированиеФедеральнымБюджетом");
	
	Шаблон.ИмяГруппы = "ДанныеРебенка";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаРожденияРебенка");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ИмяРебенка");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ОтчествоРебенка");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФамилияРебенка");
	
	Шаблон.ИмяГруппы = "СвидетельствоОРождении";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаСвидетельстваОРождении");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерСвидетельстваОРождении");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СерияСвидетельстваОРождении");
	
	Шаблон.ИмяГруппы = "РешениеОбОпеке";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаРешенияОбОпеке");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерРешенияОбОпеке");
	
	Шаблон.ИмяГруппы = "ИнойДокументПодтверждающийРождение";
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаИногоДокументаПодтверждающегоРождение");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерИногоДокументаПодтверждающегоРождение");
	
	
	// Сведения об организации.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "РеквизитыОрганизации";
	Шаблон.ОснованиеЗаполнения = "Организация";
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДолжностьУполномоченного");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаименованиеОрганизации");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаименованиеТерриториальногоОрганаФСС");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "РайонныйКоэффициент");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ТелефонУполномоченного");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФИОУполномоченного");
	
	
	// Сведения о сотруднике.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "ДанныеСотрудника";
	Шаблон.ОснованиеЗаполнения = "Сотрудник";
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "АдресПолучателяРегистрации");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "АдресПолучателяФактический");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Гражданство");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаРожденияПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДолжностнойОклад");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ИННПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НеполноеРабочееВремя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "РазмерСтавки");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СНИЛСПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СтатусНалогоплательщикаПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ТелефонПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ТипЗанятостиРаботника");
	
	// ФИО получателя и заявителя.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "ФИО";
	Шаблон.ОснованиеЗаполнения = "Сотрудник";
	Шаблон.ФиксацияГруппы = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ИмяЗаявителя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ОтчествоЗаявителя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФамилияЗаявителя");
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ИмяПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ОтчествоПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ФамилияПолучателя");
	
	// Документ, удостоверяющий личность получателя.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "ДокументУдостоверяющийЛичностьПолучателя";
	Шаблон.ОснованиеЗаполнения = "Сотрудник";
	Шаблон.ФиксацияГруппы = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВидДокументаУдостоверяющегоЛичностьПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаВыдачиДокументаУдостоверяющегоЛичностьПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаДействияДокументаУдостоверяющегоЛичностьПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "КемВыданДокументУдостоверяющийЛичностьПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерДокументаУдостоверяющегоЛичностьПолучателя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СерияДокументаУдостоверяющегоЛичностьПолучателя");
	
	// Документ, удостоверяющий личность заявителя.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "ДокументУдостоверяющийЛичностьЗаявителя";
	Шаблон.ОснованиеЗаполнения = "Сотрудник";
	Шаблон.ФиксацияГруппы = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВидДокументаУдостоверяющегоЛичностьЗаявителя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаВыдачиДокументаУдостоверяющегоЛичностьЗаявителя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "КемВыданДокументУдостоверяющийЛичностьЗаявителя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерДокументаУдостоверяющегоЛичностьЗаявителя");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СерияДокументаУдостоверяющегоЛичностьЗаявителя");
	
	// Документ на проживание.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "ДокументНаПроживаниеПолучателя";
	Шаблон.ОснованиеЗаполнения = "Сотрудник";
	Шаблон.ФиксацияГруппы = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ВидДокументаНаПроживание");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "ДатаВыдачиДокументаНаПроживание");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерДокументаНаПроживание");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СерияДокументаНаПроживание");
	
	// Сведения о банковском счете.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "БанковскиеРеквизиты";
	Шаблон.ОснованиеЗаполнения = "Сотрудник";
	Шаблон.ФиксацияГруппы = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "Банк");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НомерЛицевогоСчета");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "СпособВыплатыПособия");
	
	
	// Сведения о банке.
	Шаблон = ФиксацияВторичныхДанныхВДокументах.СтруктураПараметровОписанияФиксацииРеквизитов();
	Шаблон.ИмяГруппы = "БанковскиеРеквизиты";
	Шаблон.ОснованиеЗаполнения = "Банк";
	Шаблон.ФиксацияГруппы = Истина;
	
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "БИКБанка");
	ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, "НаименованиеБанка");
	
	Возврат Новый ФиксированноеСоответствие(ФиксируемыеРеквизиты);
КонецФункции

Процедура ДобавитьФиксируемыйРеквизит(ФиксируемыеРеквизиты, Шаблон, ИмяРеквизита)
	Шаблон.ИмяРеквизита = ИмяРеквизита;
	Ключ = ?(Шаблон.Путь = Неопределено, ИмяРеквизита, Шаблон.Путь + ИмяРеквизита);
	ФиксируемыеРеквизиты.Вставить(Ключ, Новый ФиксированнаяСтруктура(Шаблон));
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеИнформационнойБазы

Функция АктуальнаяВерсия() Экспорт
	Возврат 1;
КонецФункции

Процедура ОбновитьДокументы(ПараметрыОбновления = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1000
	|	ЗаявлениеСотрудникаНаВыплатуПособия.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаявлениеСотрудникаНаВыплатуПособия КАК ЗаявлениеСотрудникаНаВыплатуПособия
	|ГДЕ
	|	ЗаявлениеСотрудникаНаВыплатуПособия.ВерсияДокумента < &АктуальнаяВерсия
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаявлениеСотрудникаНаВыплатуПособия.Дата УБЫВ";
	Запрос.УстановитьПараметр("АктуальнаяВерсия", АктуальнаяВерсия());
	
	Если ПараметрыОбновления = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, " ПЕРВЫЕ 1000", "");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбработкаЗавершена = Выборка.Количество() < 1000;
	ПространствоБлокировки = "Документ.ЗаявлениеСотрудникаНаВыплатуПособия";
	ПолеБлокировки = "Ссылка";
	Пока Выборка.Следующий() Цикл
		Если Не ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ПодготовитьОбновлениеДанных(ПараметрыОбновления, ПространствоБлокировки, ПолеБлокировки, Выборка.Ссылка) Тогда
			ОбработкаЗавершена = Ложь;
			Продолжить;
		КонецЕсли;
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОбновитьДокумент(ДокументОбъект);
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ДокументОбъект);
		
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.УстановитьПараметрОбновления(ПараметрыОбновления, "ОбработкаЗавершена", ОбработкаЗавершена);
КонецПроцедуры

Функция ОбновитьДокумент(Документ) Экспорт
	Если Документ.ВерсияДокумента = АктуальнаяВерсия() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеИзменены = Ложь;
	
	Если Документ.ВерсияДокумента < 1 Тогда
		// При переходе на версию 1.7.5 изменился порядок заполнения поля RECALC_REASON_CODE (КодПричиныПерерасчета).
		// Удален код "03" (Поступление заявления от застрахованного лица о применении норм законодательства
		//   при исчислении среднего заработка, действовавшего до 01.01.2011г. Для пособия по беременности и родам.);
		// У кодов "04"-"07" сдвинута нумерация на -1 (стала "03"-"06").
		Если Документ.КодПричиныПерерасчета = "03" Тогда
			Документ.КодПричиныПерерасчета = "У1"; // Для целостности.
			ДанныеИзменены = Истина;
		ИначеЕсли Документ.КодПричиныПерерасчета = "04" Тогда
			Документ.КодПричиныПерерасчета = "03";
			ДанныеИзменены = Истина;
		ИначеЕсли Документ.КодПричиныПерерасчета = "05" Тогда
			Документ.КодПричиныПерерасчета = "04";
			ДанныеИзменены = Истина;
		ИначеЕсли Документ.КодПричиныПерерасчета = "06" Тогда
			Документ.КодПричиныПерерасчета = "05";
			ДанныеИзменены = Истина;
		ИначеЕсли Документ.КодПричиныПерерасчета = "07" Тогда
			Документ.КодПричиныПерерасчета = "06";
			ДанныеИзменены = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Документ.ВерсияДокумента = АктуальнаяВерсия();
	Возврат ДанныеИзменены;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
