
#Область СлужебныйПрограммныйИнтерфейс

Функция ДокументПоСсылке(ТипДокумента, НавигационнаяСсылка) Экспорт
	
	ДокументСсылка = Неопределено;
	
	ДокументМетаданные = Метаданные.Документы.Найти(ТипДокумента);
	Если ДокументМетаданные <> Неопределено Тогда
		ДокументСсылка = Документы[ТипДокумента].ПолучитьСсылку(Новый УникальныйИдентификатор(НавигационнаяСсылка));
	КонецЕсли; 
	
	Возврат ДокументСсылка
	
КонецФункции

Функция ИспользоватьЦепочкиДокументов() Экспорт 
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьЦепочкиДокументов");
	
КонецФункции

Функция ОписаниеДокументовЗамещения(ДокументСсылка) Экспорт
	Возврат ЦепочкиДокументов.ОписаниеДокументовЗамещения(ДокументСсылка);
КонецФункции
 
#КонецОбласти
