////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с банками по зарплатным проектам".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьИзмененияЛицевыхСчетов(ЛицевыеСчетаФизическихЛиц, Организация, ДатаНачала) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ЗарегистрироватьИзмененияЛицевыхСчетов(ЛицевыеСчетаФизическихЛиц, Организация, ДатаНачала);
КонецПроцедуры

Функция ДеньВыплатыЗарплатыВОрганизации(Организация) Экспорт
	Возврат ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДеньВыплатыЗарплатыВОрганизации(Организация);
КонецФункции

Процедура ДополнитьКадровыеДанные(КадровыеДанные, ТекстЗапроса) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьКадровыеДанные(КадровыеДанные, ТекстЗапроса);
КонецПроцедуры

Процедура ДополнитьОписаниеФиксацииРеквизитовЗаявкиНаОткрытиеЛицевыхСчетов(ОписаниеФиксацииРеквизитов) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьОписаниеФиксацииРеквизитовЗаявкиНаОткрытиеЛицевыхСчетов(ОписаниеФиксацииРеквизитов)
КонецПроцедуры

Процедура ДополнитьПараметрыПолученияСотрудников(ПараметрыПолученияСотрудников) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьПараметрыПолученияСотрудников(ПараметрыПолученияСотрудников);
КонецПроцедуры

Процедура ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров, АдресХранилища) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ВыгрузитьФайлыДляОбменаСБанком(СтруктураПараметров, АдресХранилища);
КонецПроцедуры

Процедура ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭД) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭД);
КонецПроцедуры

// см. ОбменСБанкамиПоЗарплатнымПроектам.ПолучитьСтруктуруКлючевыхРеквизитовОбъекта
Процедура ПолучитьСтруктуруКлючевыхРеквизитовОбъекта(ИмяОбъекта, СтруктураКлючевыхРеквизитов) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ПолучитьСтруктуруКлючевыхРеквизитовОбъекта(ИмяОбъекта, СтруктураКлючевыхРеквизитов);
КонецПроцедуры

Процедура ДополнитьСоставКомандЭДО(СоставКомандЭДО) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьСоставКомандЭДО(СоставКомандЭДО);	
КонецПроцедуры

Процедура ДополнитьСуммуПоДокументу(СуммаПоДокументу, МассивВедомостей) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьСуммуПоДокументу(СуммаПоДокументу, МассивВедомостей);	
КонецПроцедуры

Процедура ДополнитьТаблицуВедомостей(ТаблицаВедомостей, МассивВедомостей) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.ДополнитьТаблицуВедомостей(ТаблицаВедомостей, МассивВедомостей);	
КонецПроцедуры

Процедура УточнитьТекстЗапросаДинамическогоСпискаЗачислениеЗарплаты(ЗачислениеЗарплаты) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.УточнитьТекстЗапросаДинамическогоСпискаЗачислениеЗарплаты(ЗачислениеЗарплаты);
КонецПроцедуры

#Область ПервоначальноеЗаполнениеИОбновлениеИнформационнойБазы

Процедура СформироватьДвиженияПоДокументамОплаты(ДокументОплаты) Экспорт
	ОбменСБанкамиПоЗарплатнымПроектамРасширенный.СформироватьДвиженияПоДокументамОплаты(ДокументОплаты);
КонецПроцедуры

#КонецОбласти

#КонецОбласти