#Область ПрограммныйИнтерфейс

// Позволяет модифицировать параметры блокировки сеансов.
//
// Параметры:
//	ПараметрыБлокировкиСеансов - Структура - См. описание в процедуре СоединенияИБ.ПараметрыБлокировкиСеансов
//
Процедура ПриОпределенииПараметровБлокировкиСеансов(ПараметрыБлокировкиСеансов) Экспорт
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыКорпоративнаяПодсистемы.СамообслуживаниеСотрудников") Тогда 
		Модуль = ОбщегоНазначения.ОбщийМодуль("СамообслуживаниеСотрудников");
		Модуль.ПриОпределенииПараметровБлокировкиСеансов(ПараметрыБлокировкиСеансов);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

