
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Кандидат", Кандидат);
	
	ОбновитьОтчетНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	
	ОбновитьОтчетНаСервере();	
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьОтчетНаСервере()
	
	ТаблицаОтчета = Новый ТабличныйДокумент;
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Кандидат, ТаблицаОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		ДополнитьРасшифровкуДаннымиКандидата(Расшифровка);
		ОткрытьФорму("Обработка.СравнениеХарактеристикКандидатов.Форма.ФормаРасшифровка", Расшифровка, ЭтаФорма, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДополнитьРасшифровкуДаннымиКандидата(Расшифровка)
	
	Расшифровка.Вставить("Вакансия", Кандидат.Вакансия);
	Расшифровка.Вставить("ФизическоеЛицо", Кандидат.ФизическоеЛицо);
	
КонецПроцедуры

#КонецОбласти
