
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ЗадолженностьПоУдержаниям.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресСведенийОЗадолженности));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗадолженностьПоУдержаниям

&НаКлиенте
Процедура ЗадолженностьПоУдержаниямВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьОВыбранномОсновании();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОповеститьОВыбранномОсновании();
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповеститьОВыбранномОсновании()
	
	ТекущиеДанные = Элементы.ЗадолженностьПоУдержаниям.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеОснования = Новый Структура("ДокументОснование,Удержание,Задолженность");
	ЗаполнитьЗначенияСвойств(ДанныеОснования, ТекущиеДанные);
	Оповестить("ВыбраноОснованиеВзыскания", ДанныеОснования, ЭтаФорма.ВладелецФормы);
	
КонецПроцедуры

#КонецОбласти
