////////////////////////////////////////////////////////////////////////////////
// УправлениеШтатнымРасписаниемВызовСервера:
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ГрафикРаботыПоУмолчанию(ОбъектВладелец) Экспорт
	
	Возврат УправлениеШтатнымРасписанием.ГрафикРаботыПоУмолчанию(ОбъектВладелец);
	
КонецФункции

Функция ДанныеПодразделения(Подразделение) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Подразделение, "РайонныйКоэффициент,ПроцентСевернойНадбавки");
	
КонецФункции

Функция ТерриториальныеУсловияПФРПодразделения(Подразделение, ДатаСведений) Экспорт
	
	Возврат УправлениеШтатнымРасписаниемФормы.ТерриториальныеУсловияПФРПодразделений(Подразделение, ДатаСведений).Получить(Подразделение);;
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбораСправочникаШтатноеРасписание(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	ВидДоговора = Неопределено;
	Параметры.Свойство("ВидДоговора", ВидДоговора);
	Если ТипЗнч(ВидДоговора) = Тип("ПеречислениеСсылка.ВидыДоговоровССотрудниками") Тогда
		Если ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыПриложения.ГосударственнаяСлужба") Тогда
			Модуль = ОбщегоНазначения.ОбщийМодуль("ГосударственнаяСлужба");
			Модуль.ОбработкаПолученияДанныхВыбораСправочникаШтатноеРасписание(ДанныеВыбора, Параметры, СтандартнаяОбработка);
			Возврат; 			
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Функция ПолноеИмяМетаданныхДокумента(СсылкаНаДокумент) Экспорт
	
	МетаданныеРегистратора = СсылкаНаДокумент.Метаданные();
	Возврат МетаданныеРегистратора.ПолноеИмя();
	
КонецФункции

#КонецОбласти
