
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоРежимОграниченнойФункциональности = ЭлектронныйДокументооборотСКонтролирующимиОрганами.ЭтоРежимОграниченнойФункциональности();
	
	Если ЭтоРежимОграниченнойФункциональности Тогда
		ИмяМакета = "ПредложениеОформитьЗаявлениеНаПодключение1СБизнесСтарт";
	Иначе
		ИмяМакета = "ПредложениеОформитьЗаявлениеНаПодключение";
	КонецЕсли;
		
	HTMLДокумент = Обработки.ОбщиеОбъектыРеглОтчетности.ПолучитьМакет(ИмяМакета).ПолучитьТекст();

	Если Параметры.Свойство("ПоказыватьКнопки") И Параметры.ПоказыватьКнопки Тогда
		
		Элементы.ГруппаКнопок.Видимость = Истина;
		
		БольшеНеПоказывать 	= ХранилищеОбщихНастроек.Загрузить("Обработка.ОбщиеОбъектыРеглОтчетности", "НеПоказыватьПредложениеОформитьЗаявлениеНаПодключение");
		
		Если БольшеНеПоказывать = Истина Тогда
			Отказ = Истина;
		КонецЕсли;
		
		ВремяПоследнегоНапоминания 	= ХранилищеОбщихНастроек.Загрузить("Обработка.ОбщиеОбъектыРеглОтчетности", "ВремяПоследнегоНапоминания");
		Если ВремяПоследнегоНапоминания <> Неопределено 
			И ВремяПоследнегоНапоминания + 4 * 60 * 60 > ТекущаяДатаСеанса() Тогда
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Организация = Параметры.Организация;
	
	Если ЭтоРежимОграниченнойФункциональности Тогда
		
		ИмяКонстанты = "ОписаниеТарифовURL";
		
		Если Метаданные.Константы.Найти(ИмяКонстанты) <> Неопределено Тогда
			СсылкаПерейдитеНаПлатныйТариф = Константы[ИмяКонстанты].Получить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	Попытка
		Ссылка = ДанныеСобытия.href;
	Исключение
		Возврат;
	КонецПопытки;
	
	Если СтрНайти(Ссылка, "&ОформлениеЗаявления") <> 0 Тогда
		
		Закрыть(Истина);
		
	ИначеЕсли ЭтоРежимОграниченнойФункциональности И СтрНайти(Ссылка, "&Тарифы") <> 0 Тогда
		
		Если ЗначениеЗаполнено(СсылкаПерейдитеНаПлатныйТариф) Тогда
			ПоказатьВебСтраницу(СсылкаПерейдитеНаПлатныйТариф);
		Иначе
			ПоказатьВебСтраницу("http://v8.1c.ru/edi/edi_app/1c-otchetnost/rates/index.htm");
		КонецЕсли;
		
	ИначеЕсли Ссылка <> Неопределено Тогда
		
		ПоказатьВебСтраницу(Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВебСтраницу(АдресСтраницы) 
	
	Попытка
	
		ПерейтиПоНавигационнойСсылке(АдресСтраницы);

	Исключение
		
		ОбработкаИсключения(ИнформацияОбОшибке());
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИсключения(ИнформацияОбОшибке)
	
	ПричинаОшибки = ИнформацияОбОшибке().Причина;
	
	ПоказатьПредупреждение(,?(ПричинаОшибки.Описание = Неопределено,
					 "При выполнении действия произошла ошибка.",
					 ПричинаОшибки.Описание));
	
КонецПроцедуры // ОбработкаИсключения() 

&НаСервереБезКонтекста
Процедура СохранитьЗначениеБольшеНеПоказыватьНаСервере(БольшеНеПоказывать)
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.ОбщиеОбъектыРеглОтчетности", "НеПоказыватьПредложениеОформитьЗаявлениеНаПодключение", БольшеНеПоказывать);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// КОМАНДЫ ФОРМЫ

&НаКлиенте
Процедура НажатиеБольшеНеПоказывать(Команда)
		
	СохранитьЗначениеБольшеНеПоказыватьНаСервере(Истина);
		
	Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура НажатиеПоказатьПозже(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
