#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ЭтоГруппа Тогда
		
		Если ЗначениеЗаполнено(Ссылка) И ИдентичныйРесурс = Ссылка Тогда
			Текст = НСтр("ru = 'Ресурс не может быть идентичен сам себе'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
		ИдентичныйРесурсИдентичногоРесурса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИдентичныйРесурс, "ИдентичныйРесурс");
		
		Если ЗначениеЗаполнено(ИдентичныйРесурсИдентичногоРесурса) Тогда
			Текст = НСтр("ru = 'Идентичный ресурс не должен быть идентичен другому ресурсу.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДополнительныеСвойства.Вставить("ОбъектКопирования", ОбъектКопирования);
КонецПроцедуры

Процедура ПередЗаписью(Отказ)	
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;
	КонецЕсли;
	
	РазработкаЭлектронныхКурсовСлужебный.ПроверитьВозможностьЗаписиЭлементаПередЗаписью(ЭтотОбъект, Отказ);
	РазработкаЭлектронныхКурсовСлужебный.УстановитьДатуИзмененияПередЗаписью(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
