#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализОбеспеченностиТрудовымиРесурсами");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Наличие необходимого количества сотрудников для продолжения работы 
		|предприятия в периоды мобилизации и в военное время'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ДонесениеОКоличествеГражданВЗапасе");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Донесение о количестве граждан, пребывающих в запасе, 
		|забронированных за отраслями экономики Российской Федерации'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СведенияОбОбеспеченностиТрудовымиРесурсами");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения об обеспеченности трудовыми ресурсами из числа граждан,
		|пребывающих в запасе, на период мобилизации и на военное время'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЧисленностьРаботающихИЗабронированныхГражданЗапаса");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о численности работающих и забронированных граждан, 
		|пребывающих в запасе'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЧисленностьРаботающихИЗабронированныхГражданЗапаса2015");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сведения о численности работающих и забронированных граждан, 
		|пребывающих в запасе'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли