
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Процедура ПровестиДокументыПоУчетам(Параметры, АдресХранилища) Экспорт
	
	ВидыУчета = Параметры.ВидыУчета;
		
	МассивДокументов = МассивДокументов(Параметры, ВидыУчета);
	
	Для Каждого Документ Из МассивДокументов Цикл
		
		Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПереносДанных") Тогда
			Продолжить;
		КонецЕсли;
		
		НачатьТранзакцию();
		УстановитьПривилегированныйРежим(Истина);
		Отказ = Ложь;
		МенеджерДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Документ);
		МенеджерДокумента.ПровестиПоУчетам(Документ, РежимПроведенияДокумента.Неоперативный, Отказ, ВидыУчета);		
		УстановитьПривилегированныйРежим(Ложь);
		ЗафиксироватьТранзакцию();
	 	 		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Истина, АдресХранилища);
	                                               	
КонецПроцедуры

Функция МассивДокументов(Параметры, ВидыУчета)
	
	Если ВидыУчета = "ДанныеДляРасчетаСреднего" Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачисленияСреднийЗаработокОбщий.Ссылка КАК Начисление
		|ПОМЕСТИТЬ ВТ_Начисления
		|ИЗ
		|	ПланВидовРасчета.Начисления.СреднийЗаработокОбщий КАК НачисленияСреднийЗаработокОбщий
		|ГДЕ
		|	НачисленияСреднийЗаработокОбщий.Значение <> &Значение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НачисленияСреднийЗаработокФСС.Ссылка
		|ИЗ
		|	ПланВидовРасчета.Начисления.СреднийЗаработокФСС КАК НачисленияСреднийЗаработокФСС
		|ГДЕ
		|	НачисленияСреднийЗаработокФСС.Значение <> &ЗначениеФСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_Начисления.Начисление
		|ПОМЕСТИТЬ ВТ_НачисленияБезДублей
		|ИЗ
		|	ВТ_Начисления КАК ВТ_Начисления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	НачисленияУдержанияПоСотрудникамОбороты.Регистратор
		|ПОМЕСТИТЬ ВТ_Регистраторы
		|ИЗ
		|	РегистрНакопления.НачисленияУдержанияПоСотрудникам.Обороты(
		|			&ДатаНачала,
		|			&ДатаОкончания,
		|			Регистратор,
		|			Организация = &Организация
		|				И НачислениеУдержание В
		|					(ВЫБРАТЬ
		|						ВТ_НачисленияБезДублей.Начисление
		|					ИЗ
		|						ВТ_НачисленияБезДублей КАК ВТ_НачисленияБезДублей)) КАК НачисленияУдержанияПоСотрудникамОбороты
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Регистратор
		|ИЗ
		|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий
		|ГДЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация = &Организация
		|	И ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор
		|ИЗ
		|	РегистрНакопления.ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС КАК ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС
		|ГДЕ
		|	ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор.Организация = &Организация
		|	И ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВТ_Регистраторы.Регистратор
		|ИЗ
		|	ВТ_Регистраторы КАК ВТ_Регистраторы";
		
		Если Не ЗначениеЗаполнено(Параметры.Организация) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаФСС.Регистратор.Организация = &Организация", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ДанныеОНачисленияхДляРасчетаСреднегоЗаработкаОбщий.Организация = &Организация", "ИСТИНА");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Организация = &Организация", "ИСТИНА");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("ДатаНачала", Параметры.Период.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", Параметры.Период.ДатаОкончания);
		Запрос.УстановитьПараметр("Значение", Перечисления.УчетНачисленийВСреднемЗаработкеОбщий.НеВключать);
		Запрос.УстановитьПараметр("ЗначениеФСС", Перечисления.УчетНачисленийВСреднемЗаработкеФСС.НеВключать);
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
	
#КонецЕсли
