#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализШтатногоРасписания");
	НастройкиВарианта.Описание =
		НСтр("ru = 'План-фактный анализ штатного расписания, как по ставкам, так и по ФОТ'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СоблюдениеШтатногоРасписания");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Сопоставление штатного расписания и фактически занятых позиций 
		|штатного расписания. ""Перерасход"" ставок отображается красным'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЗаполненностьШтатногоРасписания");
	НастройкиВарианта.Описание = НСтр("ru = 'Заполненность штатного расписания'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ШтатнаяРасстановка");
	НастройкиВарианта.Описание = НСтр("ru = 'Штатная расстановка'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#КонецЕсли