////////////////////////////////////////////////////////////////////////////////
// Подсистема "Взаиморасчеты с сотрудниками ВХО".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПриПолученииДанныхНаСервере(Форма) Экспорт
	ОграничениеИспользованияДокументовФормы.ПриПолученииДанныхНаСервере(Форма, "ВыполнитьВнутреннююКоманду");
КонецПроцедуры

Процедура ВыполнениеКомандыНаСервере(Форма) Экспорт
	ОграничениеИспользованияДокументовФормы.ОграничитьДокумент(Форма);
КонецПроцедуры

#КонецОбласти
