
#Область СлужебныеПроцедурыИФункции

Функция ПарсерJSON(ТекущаяСтрока, ПрочитатьВСоответствие) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПарсерJSON(ТекущаяСтрока, ПрочитатьВСоответствие);
	
КонецФункции

Функция ЗаписьJSON(Данные) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаписьJSON(Данные);
	
КонецФункции

Функция ТипЗначенияJSONСтрока() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONСтрока();
	
КонецФункции

Функция ТипЗначенияJSONЧисло() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONЧисло();
	
КонецФункции

Функция ТипЗначенияJSONНачалоМассива() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONНачалоМассива();
	
КонецФункции

Функция ТипЗначенияJSONНачалоОбъекта() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONНачалоОбъекта();
	
КонецФункции

Функция ТипЗначенияJSONБулево() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ТипЗначенияJSONБулево();
	
КонецФункции

Процедура УстановитьФОИспользуетсяВзаимодействиеСРекрутинговымиСайтами() Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.УстановитьФОИспользуетсяВзаимодействиеСРекрутинговымиСайтами();
	
КонецПроцедуры

Функция СтруктураТрудоваяДеятельность() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СтруктураТрудоваяДеятельность();
	
КонецФункции

Функция СтруктураЗнаниеЯзыков() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.СтруктураЗнаниеЯзыков();
	
КонецФункции

Процедура ЗаполнитьМассивКонтактнойИнформацииHeadHunter(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииHeadHunter(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтактнойИнформацииRabota(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииRabota(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивКонтактнойИнформацииSuperJob(СтруктураРезюме, МассивКонтактнаяИнформация) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивКонтактнойИнформацииSuperJob(СтруктураРезюме, МассивКонтактнаяИнформация);
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеHeadHunter(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеHeadHunter(СтруктураРезюме, МассивОбразование);
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеRabota(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеRabota(СтруктураРезюме, МассивОбразование)
	
КонецПроцедуры

Процедура ЗаполнитьМассивОбразованиеSuperJob(СтруктураРезюме, МассивОбразование) Экспорт
	
	ИнтеграцияРекрутинговыхСайтовРедакция3.ЗаполнитьМассивОбразованиеSuperJob(СтруктураРезюме, МассивОбразование);
	
КонецПроцедуры

Функция ПубликацияВакансииHeadHunter(Дерево, Сайт) Экспорт	

	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииHeadHunter(Дерево, Сайт);	
	
КонецФункции

Функция ПубликацияВакансииRabota(Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииRabota(Дерево);
	
КонецФункции

Функция ПубликацияВакансииSuperJob(Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ПубликацияВакансииSuperJob(Дерево);
	
КонецФункции

Функция ОбновлениеВакансииHeadHunter(ИдентификаторВакансии, Дерево, Сайт) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииHeadHunter(ИдентификаторВакансии, Дерево, Сайт);
	
КонецФункции

Функция ОбновлениеВакансииRabota(ИдентификаторВакансии, Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииRabota(ИдентификаторВакансии, Дерево);
	
КонецФункции

Функция ОбновлениеВакансииSuperJob(ИдентификаторВакансии, Дерево) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОбновлениеВакансииSuperJob(ИдентификаторВакансии, Дерево);
	
КонецФункции

Функция НайтиКандидатов(ПараметрыПроцедуры, УникальныйИдентификатор, АдресХранилища) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.НайтиКандидатов(ПараметрыПроцедуры, УникальныйИдентификатор, АдресХранилища);
	
КонецФункции

Функция РеквизитВакансииСоответствующийПолюПубликации(Путь, Вакансия) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.РеквизитВакансииСоответствующийПолюПубликации(Путь, Вакансия);
	
КонецФункции

Функция ОпубликованныеВакансииСИдентификаторами(Сайт) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ОпубликованныеВакансииСИдентификаторами(Сайт);
	
КонецФункции

Функция РеквизитПубликацииСоответствующийРеквизитуВакансии(Сайт, Вакансия, Реквизит) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.РеквизитПубликацииСоответствующийРеквизитуВакансии(Сайт, Вакансия, Реквизит);
	
КонецФункции

Функция ЗагружаемыеРеквизитыВакансии(Сайт) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.ЗагружаемыеРеквизитыВакансии(Сайт);
	
КонецФункции

Функция НоваяСтепеньЗнанияЯзыка(Код) Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.НоваяСтепеньЗнанияЯзыка(Код);
	
КонецФункции

Функция КонстантаИспользоватьИнтеграциюРекрутинговыхСайтов() Экспорт
	
	Возврат ИнтеграцияРекрутинговыхСайтовРедакция3.КонстантаИспользоватьИнтеграциюРекрутинговыхСайтов();
	
КонецФункции

#КонецОбласти