#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормироватьАвтоматически Тогда
		Родитель = Справочники.ГруппыСотрудников.ПустаяСсылка();
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормироватьАвтоматически Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ГруппаСотрудников", Ссылка);
		
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	СоставГруппСотрудников.Сотрудник
			|ИЗ
			|	РегистрСведений.СоставГруппСотрудников КАК СоставГруппСотрудников
			|ГДЕ
			|	СоставГруппСотрудников.ГруппаСотрудников = &ГруппаСотрудников";
			
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			НаборЗаписей = РегистрыСведений.СоставГруппСотрудников.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ГруппаСотрудников.Установить(Ссылка);
			НаборЗаписей.Записать();
			
		КонецЕсли; 
		
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
