#Область СлужебныйПрограммныйИнтерфейс

Функция Подключены() Экспорт
	
	Возврат ОбсужденияСлужебныйВызовСервера.Подключены();
	
КонецФункции

Процедура ПоказатьПодключение() Экспорт
	
	ОбщегоНазначенияКлиент.ОткрытьНавигационнуюСсылку("e1cib/app/Обработка.ПодключениеОбсуждений")
	
КонецПроцедуры

Процедура ПоказатьОтключение() Экспорт
	
	ОбщегоНазначенияКлиент.ОткрытьНавигационнуюСсылку("e1cib/command/Обработка.ПодключениеОбсуждений.Команда.ОтключениеОбсуждений");
	
КонецПроцедуры

#КонецОбласти
